{"Blog-Posts/Keyboards/Dactyl-Manuform-R-Track":{"title":"Dactyl Manuform R-Track","links":["Blog-Posts/Keyboards/ErgoTravel","Research/Ergonomic-Mechanical-Keyboards/Ergonomic-Keyboards"],"tags":["keyboards"],"content":"Dactyl Manuform R-Track\nPreface: This design is entirely made by QQurn, and details can be found at gitlab.com/keyboards1/dm_r_track.\nAfter building my first ergonomic keyboard a few months prior, I wanted to do more electronics. I started toying with the idea of having a pointing device (something to move the mouse) integrated into the keyboard. In researching that idea, I stumbled upon an amazing design. Here are some of the key features:\n\nSplit Keyboard, 5x6 layout for 62 keys\nPMW3360 Motion Sensor Integrated under the right thumb for Trackball\nI^2C Communciation Between the Halves over RJ9\nArduino Micro on the Right, Pro Micro on the Left\nFully programmable with 32kB of flash\n\nI was enthralled, but the only way to make one was with a 3D Printer. So I purchased a 3D Printer over the holidays, and got to work setting it up. After honing in the printer, I fired it up to create the case. But that was just the beginning of the work. The shape is molded to the human hand to minimize movement and maximize comfort, which requires a 3D “keywell,” curving the keys to the fingers. This shape prevents standard printed circuit boards, which are rigid and planar.\nSo, QQurn’s design resorts to “handwiring,” where the switches are connected by dozens of individual short wires soldered in air. To make matters worse, switch matrices require a diode on each key (see here for why). You have to solder each wire in air, totaling over 200 connections. It is very tedious.\nSo, painfully, over about 20 hours, I wired all the switches, along with an I^2C bus to communicate between the two microcontrollers, and the trackball sensor. A few hours of troubleshooting and a lot of firmware tweaking later, and I have an absolutely amazing keyboard. You really can’t understand how comfortable it is until you use it for a full work day, but it was definitely worth the time, money, and effort. Now for the fun part: Photos!\n\n\nWhat Did I Learn?\nWhile I didn’t create this design myself, there was still a lot of work involved in manufacturing and wiring it. I learned a ton about 3D printing, soldering, and also the QMK firmware framework which enables the keyboard to work."},"Blog-Posts/Keyboards/ErgoTravel":{"title":"ErgoTravel","links":["Research/Ergonomic-Mechanical-Keyboards/Ergonomic-Keyboards"],"tags":["keyboards"],"content":"\nThe ErgoTravel was my first foray into the world of Ergonomic Keyboards. For this first build, I stuck with something tried and true. I purchased a kit from an online retailer, and built it according to the instructions. While the components were all included, I had to solder everything by hand, my first major experience with soldering. It was a lot of fun.\nOnce I had everything soldered and assembled, the next step was firmware. The keyboard runs QMK, a C-based firmware framework that runs on hundreds of keyboard designs, including the ErgoTravel. The main config, describing the electrical design, was already complete, but I had to create and tweak my own keymap. The keymap determines what pressing a given key actually does. I decided to get ambitious and try out as many of QMKs features as possible, including tap dances, layers, layer-taps, and leader key. It was great to explore the firmware and learn a bit of C.\nOnce I had built the keyboard and been using it for a few weeks, a small problem became apparent: the kit didn’t come with a full case, so the PCB was partially exposed. I was slowly noticing dust and gunk accumulating, which I thought could become an issue long term. So I wanted to create a more full enclosure. Luckily, my father is a hobbyist wood-worker, so we worked together create a case of walnut. It’s beautiful, I think."},"Blog-Posts/Keyboards/Icarus":{"title":"Icarus","links":["Concepts/Programming/Programming-Languages/CPP/QMK"],"tags":["keyboards"],"content":"Icarus\nIntroduction\nI had just finished a written math assignment when I thought to myself: why should I have to compute something on my calculator, then enter it into the computer? Why isn’t the calculator directly connected to my computer? So I decided to try and solve that problem by making a numpad and calculator in one. You activate calculate mode, input your calculation, and it writes out the answer. Here’s a quick feature overview:\n\nFully Programmable with QMK firmware\nCustom PCB with onboard Cortex M4 Microprocessor\nIntegrated 128x32 OLED\nUSB-C Connection\n4x5 Mechanical Key Matrix for 20 Keys\n\nThe project has two main parts: Hardware (PCB and case) and software (actual functionality).\nHardware Development\nCircuitry\nThe microprocessor (i.e. the brain) is integrated directly into a custom PCB, along with USB circuitry, the key matrix, and a voltage regulator. The MCU runs on an external 16MHz crystal. I designed the PCB using KiCad, a free and open source CAD suite for electrical engineering. PCB development is one of my favorite parts of these keyboard projects, because its the right mix of creativity, problem solving, and research. For this board in particular I spent a lot of time reading about the STM32F4xx series and the best design practices for PCBs. Here’s the final schematic:\n\nAnd the PCB Layout:\n\nI had the PCB manufactured and some of the surface mount soldering done by JLCPCB.\nCase Design\nOnce I had a designed the PCB, I needed somewhere to put it. A few months prior I had purchased a 3D printer, so I decided to design and 3D print a case. I created the enclosure in AutoDesk Fusion 360. I tried my hand at creating a screw-less design. The stackup involves three parts:\n\nThe main plate\nThe PCB\nThe bottom plate\n\nThe PCB is attached to the main plate by the tension between the mechanical switches (which snap into the plate) and the holes in the PCB. The bottom plate then has a “snap-fit” to attach to the main plate, fulling enclosing the PCB. Overall, I think it was pretty successful.\nSoftware Development\nThis ended up being where the bulk of my time on this project went. It turns out that programming a calculator isn’t as easy as I thought! It turned out to be a great learning experience. At the start of this project I didn’t really have much experience with C programming, but I developed a lot of skills by programming Icarus. The base for the firmware is the wonderful Quantum Mechanical Keyboard Firmware, or QMK. It has a lot of abstraction that makes it easy to get started with your own firmware. Each keyboard has a config that defines its electrical configuration and layout, and then each user can create their own keymaps, with a specific layout to fit them. I assumed that setting up the initial config would be the easy part (as it had been with my previous boards), but I was quickly proved wrong. The first time I plugged in the PCB and flashed it with firmware that I thought was correct, the entire thing hung and became non-responsive. I spent hours debugging before eventually discovering that the quartz clock that I had chosen for the microcontroller was not the same speed as the QMK default. Once I fixed that, it was on to programming the calculator functionality.\nWhile most normal inputs are easy to setup in QMK, I had to program the calculator functionality mostly from scratch. The way I tackled this was to create a togglable layer with custom defined keycodes corresponding to each matrix position. In other words, I defined functions for each key. Most of these functions write to a char array representing the current equation. The ”=” button then calls a function from the TinyExpr library to interpret that buffer into a numeric result, if possible. Pressing enter then sends it to the computer using the qmk “send_string()” function.\nTo make this all more user-friendly, I added a little 128x32 OLED that displays the current expression buffer and expected result as you enter in characters. On the default layer, where you just enter numbers like a numpad, it displays the layout because my keycaps are blank.\nFinal Product\n"},"Blog-Posts/Keyboards/Silvis":{"title":"Silvis","links":["Blog-Posts/Keyboards/Tantalus","keyboards/r_track","keyboards/icarus"],"tags":["keyboards"],"content":"\nIntroduction\nAfter building Tantalus and another Dactyl Manuform 5x6, I still wasn’t fully satisfied with my secondary keyboard. My Dactyl Manuform R-Track is perfect for my primary setup, but I have been moving around more and doing school work on a laptop. Unfortunately the Dactyl is quite bulky and a little finicky (owing to my amateur soldering job), so it isn’t very mobile.\nI began toying around with ideas for a while. I finally settled on creating another flat keyboard. There would be no mousing device, no curved keywells. I wanted to prioritize the typing experience, above other luxuries. I figure it is better to make the best portable keyboard possible than a mediocre mouse and mediocre keyboard. So from that came Silvis.\nFeature List\n\nCustom PCB with On-board STM32F411 microcontroller\n3D Printed Case designed in Fusion 360\nProgrammable with QMK\nAddressable Per-Key RGB\nUSB-C\nHotswappable Cherry MX keys\n\nHardware Development\nPCB\nI designed the Silvis PCB using the KiCad suite, which I’m now pretty adept with. The PCB features an STM32F411 microcontroller, which has 512 Kb of flash and 128 Kb of ram, plenty for a keyboard. The schematic is overall similar to one of my previous projects, Icarus, because I chose the same MCU for both. The biggest difference is that Silvis features per-key SK6812 Mini-E LEDs, which are reversed mounted. This means that you solder them on the back, but they point up through a hole illuminating the keys from below.\nLaying out the components for this PCB proved far more challenging then any of my previous designs. I wanted the design to be symmetric but unibody, with a couple of different angles between columns to match the splay of my hand. Additionally, each and every one of the 58 keys has both an LED and a diode (see here for why) attached to it. Placing that all by hand was… daunting. I knew I would make a mistake. So I started looking into ways to do it programmatically instead.\nErgoGen\nErgogen, short for ergonomic keyboard generator, is a Javascript project that allows you to describe a 2D keyboard layout using a YAML config, and then generate design files, including plate SVGs, PCBs, and even cases, from there. This allows for a much faster workflow, by tweaking code instead of manually shifting keys in KiCad. I used ErgoGen to place the switches, diodes, and LEDs for the Silvis matrix. I’m a huge fan of this project, and strongly suggest it to anyone looking to make their own ergonomic keyboard.\nCase Design\nI wanted Silvis to be able to hold up to abuse. I wanted a rigid case with a durable design. Of course, for those purposes, a 3D printed case probably wasn’t my best choice, but its what I had to work with.\nThe overall design is pretty simple. I have a 3d-printed shell that the PCB drops down into, then a FR4 plate goes over that, with 10 M3 screws holding everything together. I designed all of this in Fusion360.\nSoftware Development\nSoftware for this project was really easy. Over my past keyboard projects I have developed a strong understanding of QMK, so that is what I chose to use again. The only tricky part was configuring the LEDs to work properly.\nUsage\nI’ve now been using Silvis as my daily driver for about 6 months, and it is wonderful. All of my tedious design work really did pay off."},"Blog-Posts/Keyboards/Tantalus":{"title":"Tantalus","links":["Research/Ergonomic-Mechanical-Keyboards/Ergonomic-Keyboards","Blog-Posts/Keyboards/Dactyl-Manuform-R-Track","Concepts/Programming/Programming-Languages/CPP/QMK","KiCad"],"tags":["keyboards"],"content":"Tantalus\nIntroduction\nThis is my 3rd ergonomic keyboard, and my first completely custom design. My previous build, the Dactyl Manuform R-Track, was almost perfect. However I needed another board for my second setup, and really didn’t want to handwire again. So, I set about learning how to design my own 3d models and create my own PCBs. I had a couple goals in mind:\n\nFully Programmable with QMK\n38 Choc Keys with a layout optimized for prose\nCustom PCB with integrated MCU\nUSB-C Connection\nTrackball on a daughterboard\n\nI achieved most of these goals, but in practice it isn’t perfect.\nHardware Development\nThis project was a great learning experience for a number of reasons, but the big one is that I got very acquainted with KiCad, an open source PCB design tool. From scratch, I learned how to create schematics, modify and design footprints, layout a PCB, route a PCB, and read datasheets. Since this was my first design, I kept it somewhat simple. No LEDs, no OLED, no split board, none of the other possible bells and whistles for QMK boards.\nInstead of using a separate daughterboard for the microcontroller as I had on my previous two builds, Tantalus has an ATMEGA32U4 directly on the PCB, along with all of the clock and voltage regulating circuity that entails. This enables me to have a USB-C connection anywhere else on the PCB.\nAnd the PCB Layout:\n\nOnce I finished the PCB, I set to work learning another tool from the ground up: AutoDesk Fusion 360. I needed to create a 3d printable enclosure for the PCB, with a spot for the trackball. I severely underestimated how hard it’d be. After many, many iterations, here is a render of the final design:\n\nAssembly\nI had the PCB manufactured and partially soldered by JLCPCB. Once I had soldered the rest of the components and printed the case, it came time to assemble everything. Unfortunately, everything didn’t go to plan. Some of the tolerances on the case were bad, the wiring was tight, and the trackball sensor interefered with the case closing. Additionally, I made a couple small mistakes on the PCB that rendered two keys non-functional, until I ran jumper wires to fix it. However, with a bit of gumption and a dremel, I was eventually able to get everything fitting and the case to close.\nFinal Product\nWithout further adue, here is how it turned out:\n\nAnd the internals:\n\nIs it janky? Yes. Did I make mistakes? Yes. Am I happy with the final product? Not really. Am I glad I did it? Absolutely. This was a great learning experience."},"Blog-Posts/Posts/BWSI":{"title":"Beaver Works Summer Institute","links":[],"tags":[],"content":"Beaver Works Summer Institute\nIntroduction\nIn the summer of 2023, I had the pleasure of attending the Beaver Works Summer Institute, a program for rising high school seniors run by MIT. It offers the brightest students in the nation the chance to work on fascinating engineering projects with courses taught by MIT faculty.\nI chose to take the Autonomous Underwater Vehicle Challenge, where we learned to take a remotely operated underwater robot and transform it into something fully autonomous using sensor data, computer vision, and motor control. Here is what our robot looked like:\n\nPhysics\nThe first step on our journey to autonomy was understanding how the robot moves in the water. It has a 6 thruster configuration, with 4 on the xy plane and 2 for vertical movement. This allows us full control in all 3 dimensions. You can turn the robot (yaw) by turning on opposing horizontal thrusters. We didn’t really bother with pitch and roll, but you should be able to control those to. In order to understand how the robot actually moves, you have to do just a little bit of linear algebra. Thinking only in the 2D plane, you can find the horizontal and vertical components of each thruster using basic trigonometry. You can do the same to calculate torque, assuming you know the dimensions of the robot. Once you have the components relative to the AUV, you can translate them into the global plane using a rotation matrix. Now that calculation only gives us the acceleration of the AUV. You really want the expected position, so you have to integrate twice. This math formed the basis of our first week of study.\nMotor Control\nNow that we had an idea as to how the robot would respond, it was time to learn how to actually control it. We did so using the PID control model, which relies on an error and the change in that error over time in order to calculate how much to change by. Essentially, the speed of the motors depends on how far away from your target you are, and how quickly that distance is changing. This prevents you from overshooting. The code for this is actually exceedingly simple, but the bulk of the work came from testing it on our actual robots and honing in on the gain values.\nComputer Vision\nOkay, so we can control our robot and make it go where we want to now. How do we know, autonomously, where to go? The same way you do: with vision! Our robot is equipped with a high resolution, high refresh rate camera. You can process that image to gather data about the surroundings, and then decide where to go accordingly. For us, we had to main modes of travel: following April Tags (basically QR codes for robots), or following the lane of a pool. April tags stand out quite a bit an image, so they are pretty easy to find and follow. They give a lot of information based on their size in the image, so you can actually follow them pretty accurately. Pool lanes are a lot harder. They are just dark edges at the bottom of the pool, and there is often times multiple of them in the image, so it can be very difficult to detect them all and pick the right one. I would say that this problem is where the bulk of my development work went throughout the 4 week program."},"Blog-Posts/Posts/Biking":{"title":"Biking","links":[],"tags":[],"content":"Biking\nResearch\nAs winter settled in and I began to spend more time inside, I was looking to get into a new excerise hobby. I spent a while thinking about it, and eventually decided that I wanted to start biking. I’ve known how to ride a bike for a long time, but I’ve never really had a good one, and never really gone on wrong rides. But after discovering the world of bikepacking and seeing all kinds of adventures documented on YouTube, I decided I was going to get into it. So, I spent about a month looking into all kinds of bikes, from sleek and modern road bikes to full-suspension mountain bikes. I learned a lot from that research. For one, bikes are expensive. There are also a lot of options. There’s suspension, drive trains, rim versus disc brakes, dropbar versus flatbar, and countless other of decisions to make before purchasing a bike. But, eventually, I started to develop an idea of what I wanted.\nThe Poseidon X\nThe bike I settled on, and purchased in December 2022, is the Poseidon X. It is a gravel bike, built for rougher terrain (like on gravel roads!) but not neccarisly bumpy and steep trails like you might tackle on a mountain bike. This seems like a good compromise for me, because I will be doing likely 80-90% of my riding on roads, even if I am excited to get on trails come summer. It is a rigid bike, meaning no front or rear suspension. This makes it easier to maintain and cheaper to purchase. It has a 1x10 cassette, which still offers plenty of range for tackling hills or going downhill.\nAs of January, I haven’t been able to go on any long rides yet due to cold weather. But, from the ~10 mile days I have done, the bike is excellent! Its a blast to ride, with smooth gear shifting, lots of braking power, and good ergonomics. I’m really happy with it!"},"Blog-Posts/Posts/Obsidian":{"title":"Obsidian Notes","links":[],"tags":[],"content":"Obsidian Notes\nWhat is Obsidian?\nIn late 2022, I was lucky enough to stumble onto a wonderful project called Obsidian Notes. The principle is simple: a note-taking software composed of plain markdown files with a focus on interconnection and extensibility. You create a folder of markdown files, and use local links, tags, and canvases to connect everything. This allows you to move from file to file as you would thought to thought. It sounds simple, but is extremely powerful in practice.\nBut… why?\nI was skeptical at first too. People online speak of note software like Obsidian as if they will completly change your life, and I didn’t believe them. But, now that I have been using Obsidian for about 3 months, it really does have a big impact on my workflow and thought proccesses. Essentially, whenever I learn a new concept or have an interesting thought I expect to revisit, I write it down in my Obsidian vault, often in shorthand at first. Then, when I have time later, I can expand it fully. Next time I think about that thing, I can just look at my note to refresh my memory. This can also serve as a to-do list; when you think of something you need to do, just write it down. Maybe tag it. Then you come back later. It has a huge impact on my ability to get things done. Fleeting thoughts become reality a lot more now that I use Obsidian.\nDaily Notes\nThe very first place I write down most of these notes and thoughts is my daily note. A daily note is simply a file that you create each day with the date. From my daily notes I can get to everything I worked or thought about that day. In Obsidian, if you want to create a new file, you just write [[$file_name$]], and then hit Ctrl+Enter. This file will then have a “backlink” to your daily note, which can later be viewed graphically. This allows you to visualize ideas and thoughts on a graph, and follow your train of thoughts. This is especially powerful when you return to a project or idea after a long time.\nTags\nAnother hugely important feature of Obsidian is tags. I use tags just as topics. So if I make a file about a physics topic, I just tag it with physics. This can be done in two ways:\n\nInline tags\nYAML Frontmatter\n\nInline tags are just written like#topic directly in your markdown. These are fast to make, but produce visual clutter. YAML Frontmatter tags are written at the very top of the file, like this:\n---\ntags: [xxxxx, yyyyy]\n---\n\nBoth methods work with the other, so you can use whatever you want depending on the note. I tend to use inline tags in my daily notes, but YAML frontmatter for when I extract something to its own file.\nGraph View\nI mentioned the graph view, but I just wanted to give you a visual of what that looks like:\n\nThat is a screenshot of my main Obsidian vault, with over 500 notes. It gives a clear visual of how ideas and tags are related. Most of the grouping comes from tags, but those can be disabled to get a direct view of file-to-file connections, if that is what you are looking for. Its really interesting to visualize what you have learned and thought about for the past months.\nSyncing\nA conventional note-taking approach would involve a notebook, that you can take around with you and write things down in. Obsidian is digital, and not even natively in the cloud. So what do I do if I’m out and about and want to write something down? Well, the way I see it, there are two options:\n\nSync your vault across devices\nTake intermediary notes on another device\n\nI use a mix of both. Sometimes I will write things down on scraps of paper and fold them up in my pocket. Other times, I will write them using Obsidian for my phone (yes, its cross platform!).\nThere are a couple ways to sync a vault from your phone to laptop or similar. Obsidian themselves offer a service called Obsidian Sync, which is $10 a month for cross-platform cloud syncing with version history. A free approach is to setup a Git/GitHub repository, using the obsidian-git plugin.\nConclusion\nSo, I implore you: take a look at Obsidian. It might not be for you, and that’s fine, but if you have ever wanted to try out a note taking software, I truly believe that Obsidian is the best option available."},"Concepts/Concepts":{"title":"Concepts","links":["Concepts/Psychology/Psychology","Concepts/Psychology/Memory/Prototype-(Psychology)","Research/Sources/Myers-Psychology-for-the-AP-Course"],"tags":["psychology","flashcards","psych-unit4"],"content":"Topic: Psychology\nConcepts\nConcepts are ideas, rules, or mental groupings of similar objects, events, people, and activities. You have a concept of a ball that includes footballs, rubber balls, soccer balls, and cannon balls, for example. Concepts are typically based on prototypes.\nConcepts can be loosely defined, such as a bird; this is a superordinate concept. They could also be very specific, which is called a subordinate concept, for example a Orange-breasted bunting.\nThis folder includes notes on a variety of concepts from a range of fields and across the subordinate to superordinate spectrum.\n\nReferences\nMyers Psychology for the AP Course; Module 34"},"Concepts/Science/Physics/Angular-Motion/Angular-Acceleration":{"title":"Angular Acceleration","links":["Concepts/Science/Physics/Angular-Motion/Angular-Motion","Acceleration","Concepts/Science/Physics/Angular-Motion/Angular-Velocity","Centripetal-Force","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics/angular"],"content":"Angular Acceleration\nTopic: Angular Motion\nAngular acceleration is the angular equivalent of Acceleration. It can be defined as the change in Angular Velocity:\n\\bar\\alpha = \\frac{\\Delta \\omega}{\\Delta t}\nInstantaneous angular acceleration is:\n\\alpha = \\frac{d\\omega}{dt}\nAngular acceleration is related to the tangential linear acceleration a_{\\tan} of a point in the rotating object by:\na_{\\tan{}} = \\frac{dv}{dt} = R \\frac{d \\omega}{dt} = R\\alpha\nThis also gives us another way to find the Centripetal Force acting on the object:\na_{R} = \\frac{v^{2}}{R} = \\omega^{2}R\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 10"},"Concepts/Science/Physics/Angular-Motion/Angular-Frequency":{"title":"Angular Frequency","links":["Oscillations-and-Vibrations","Concepts/Science/Physics/Waves/Frequency"],"tags":["science/physics/angular"],"content":"Angular Frequency\nTopic: Oscillations and Vibrations\nAngular frequency is 2\\pi \\times fwhere f is the Frequency.\n\nReferences"},"Concepts/Science/Physics/Angular-Motion/Angular-Momentum":{"title":"Angular Momentum","links":["Concepts/Science/Physics/Angular-Motion/Angular-Motion","Concepts/Science/Physics/Newtonian-Mechanics/Momentum/Linear-Momentum","Principle-Axis","School-Notes/Archives/Physics/Newtons-Laws-of-Motion","Concepts/Science/Physics/Angular-Motion/Torque","Concepts/Math/Linear-Algebra/Vectors/Vector-Cross-Product","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics/angular"],"content":"Angular Momentum\nTopic: Angular Motion\nAngular momentum is the angular analogue of Linear Momentum. It can most simply be stated as:\n\\vec{L} = I\\vec{\\omega}\nHowever, this is only true when the rotation is about a fixed Principle Axis.\nSecond Law Equivalent\n\\sum\\limits \\vec{\\tau} = \\frac{d\\vec{L}}{dt}\nConservation\nIf no net external Torque acts on a system, then the total angular momentum is conserved.\nGeneral Definition\n\\vec{L} = \\vec{r} \\times \\vec{p}\nWhere \\vec{r} is the position, and \\vec{p} is the Linear Momentum. This is a Vector Cross Product.\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 11"},"Concepts/Science/Physics/Angular-Motion/Angular-Motion":{"title":"Angular Motion","links":[],"tags":["topic","science/physics/angular"],"content":"Angular Motion\nThe study of rotational motion.\nSubtopics\ntable without id file.inlinks\nwhere file.name = this.file.name"},"Concepts/Science/Physics/Angular-Motion/Angular-Position":{"title":"Angular Position","links":["Concepts/Science/Physics/Angular-Motion/Angular-Motion","Concepts/Math/Calculus/Integrals/Solids-of-Revolution/Arc-Length","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics/angular"],"content":"Angular Position\nTopic: Angular Motion\nEach translatational property has a angular equivalent. Angular position is the equivalent of x, y, z position.\n\\theta = \\frac{\\ell}{R}\nWhere \\ell is the Arc Length, and R is the distance from the axis of rotation.\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 10"},"Concepts/Science/Physics/Angular-Motion/Angular-Velocity":{"title":"Angular Velocity","links":["Concepts/Science/Physics/Angular-Motion/Angular-Motion","Concepts/Science/Physics/Newtonian-Mechanics/Velocity","Concepts/Science/Physics/Angular-Motion/Angular-Position","Concepts/Science/Physics/Angular-Motion/Angular-Acceleration","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics/angular"],"content":"Angular Velocity\nTopic: Angular Motion\nAngular velocity is the angular equivalent of Velocity, just as Angular Position is the equivalent of position. Average angular velocity is defined as:\n\\bar{\\omega} = \\frac{\\Delta \\theta}{\\Delta t}\nAnd instantaneous velocity is defined as:\n\\omega = \\frac{d\\theta}{dt}\nIt has units of radians per second.\n\\omega is the same for all points of a rotating object. Because of this, you can find the linear Velocity of any point on a rotating object using this formula:\nv = \\frac{d\\ell}{dt} = \\frac{Rd\\theta}{dt} = R \\omega\nThe derivative of \\omega is Angular Acceleration.\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 10"},"Concepts/Science/Physics/Angular-Motion/Centripetal-Acceleration":{"title":"Centripetal Acceleration","links":[],"tags":["science/physics/angular"],"content":"Centripetal Acceleration\na_{c} = \\frac{v^{2}}{r} \n\nReferences"},"Concepts/Science/Physics/Angular-Motion/Moment-of-Inertia":{"title":"Moment of Inertia","links":["Concepts/Science/Physics/Angular-Motion/Angular-Motion","Concepts/Science/Physics/Materials/Center-of-Mass","Concepts/Math/Calculus/Integrals/Multivariable/Double-Integral-Applications","Concepts/Science/Physics/Materials/Density","Concepts/Math/Calculus/Integrals/Multivariable/Triple-Integrals","Concepts/Math/Geometry/Cylindrical-Coordinates"],"tags":["science/physics/angular"],"content":"Moment of Inertia\nTopic: Angular Motion\nMoment of inertia (I) is the angular equivalent of Center of Mass. It is can be difficult to define and find, far more than CM. This is because I varies based on the axis of rotation, the shape of the object, the density distribution of the object, and the size.\nPlanar Object Calculations\nThe moment of inertia of a point mass is I = mr^{2}, where m is the mass and r^{2} is the distance from the rotational axis. The moment of inertia of a larger object can be found by approximating the object as a sum of point masses. Let \\delta(x,y) be the density at point (x,y). The moment of inertia about the origin is the following double integral I_{0}= \\iint_{R}r^{2} \\delta dA\nwhere r^{2} = x^{2} +y^{2}.\n\n\n                  \n                  Example: Rotating a Disk about the Origin \n                  \n                \n\nConsider a uniform disk of radius a and Density \\delta = 1. What is the moment of inertia?\nSolution:\nThis is easiest to do in polar coordinates.\nI_{0} = \\iint_{R}r^{2}dA = \\int\\limits_{0}^{2\\pi} \\int\\limits_{0}^{a} r^{2} \\cdot r dr d \\theta\nEvaluating that integral yields\nI_{0} = \\int\\limits_{0}^{2\\pi} \\frac{a^{4}}{4} d \\theta = 2\\pi \\frac{a^{4}}{4} = \\frac{\\pi}{2} a^{4}\n\n\nOther Axes\nThe origin (or \\hat{\\textbf{k}}) isn’t the only axis we can rotate about. Instead, consider rotation about the x-axis. The distance to the x-axis is just |y|, so\nI_{x} = \\iint_{R} y^{2} \\delta dA\nVolumetric Objects\nThe moment of inertia about an axi\\iiinty the Triple Integrals: \\iiint_{R} (\\text{distance to axis})^{2} \\delta dV\nwhere \\delta is the density function and R is the region of the object.\nThe moment of inertia about the z-axis:\nI_{z} = \\iiint_{R} r^{2} \\delta dV = \\iiint_{R} (x^{2} + y ^{2}) \\delta dV\nThe x-axis:\nI_{x} = \\iiint_{R} (y^{2} + z^{2}) \\delta dV\nThe y-axis:\nI_{y} = \\iiint_{R} (x^{2} + z^{2}) \\delta dV\n\n\n                  \n                  Find the Moment of Inertia \n                  \n                \n\nWhat is I_{z} of a solid cone between z = ar and z = b?\nSolution:\nWe will use a triple integral in the Cylindrical Coordinates. Let \\delta = 1. We can find the area of each disk, and then sum the disks vertically to find the moment of inertia.\nI_{z} = \\int\\limits_{0}^{b}\\int\\limits_{0}^{2\\pi}\\int\\limits_{0}^{\\frac{z}{a}}r^{3} dr d \\theta dz = \\frac{\\pi b^{5}}{10 a^{4}}\n\n\n\nReferences"},"Concepts/Science/Physics/Angular-Motion/Parallel-Axis-Theorem":{"title":"Parallel Axis Theorem","links":["Concepts/Science/Physics/Angular-Motion/Moment-of-Inertia","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics/angular"],"content":"Parallel Axis Theorem\nThe Moment of Inertia of an object around a parallel axis to its center of mass is equal to:\nI = I_{cm} + Mh^{2}\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 10"},"Concepts/Science/Physics/Angular-Motion/Torque":{"title":"Torque","links":["Concepts/Science/Physics/Angular-Motion/Angular-Motion","Concepts/Science/Physics/Newtonian-Mechanics/Force","vectors","Concepts/Math/Linear-Algebra/Vectors/Vector-Cross-Product","School-Notes/Archives/Physics/Newtons-Laws-of-Motion","Concepts/Science/Physics/Newtonian-Mechanics/Inertial-Frames-of-Reference","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics/angular"],"content":"Torque\nTopic: Angular Motion\nTorque (\\tau) is the angular equivalent of Force. The amount of torque you do for a given amount of energy depends on the position on the object which you apply a force, and the angle at which you apply the force.\nThe amount of torque can be found It can be found in many different ways, all involving vectors and trigonometry:\n\nr \\sin{(\\theta)}F where r is the length from the axis of rotation and \\theta is the angle at which the force is being applied\nrF_{\\perp}, where F_{\\perp} is the magnitude of the force perpendicular to the radial from the axis of rotation\nr_{\\perp}F, where r_{\\perp} is the moment arm — the length of the radial that is perpendicular to the axis through which the force is being applied\n\\vec{ \\tau } = \\vec{\\textbf{r}} \\times \\vec{\\textbf{F}}, Vector Cross Product\n\nAngular Second Law of Motion\n\\sum \\vec{\\tau} = I_{cm}\\vec{\\alpha}_{cm}\nOnly true for:\n\naxis fixed in Inertial Frames of Reference\naxis accelerating in one dimension\n\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 10"},"Concepts/Science/Physics/Angular-Motion/Uniform-Circular-Motion":{"title":"Uniform Circular Motion","links":["Concepts/Science/Physics/Angular-Motion/Centripetal-Acceleration"],"tags":["science/physics/angular"],"content":"Uniform Circular Motion\nAn object in uniform circular motion is moving at a constant speed around a circle. It is accelerating to change the direction of velocity. This is called the Centripetal Acceleration.\nv = \\dfrac{2\\pi r}{T}\n"},"Concepts/Science/Physics/Electricity-and-Magnetism/Ampere's-Law":{"title":"Ampere's Law","links":["Electromagnetism","Concepts/Math/Calculus/Integrals/Multivariable/Line-Integral","Concepts/Science/Physics/Electricity-and-Magnetism/Magnetic-Field","Concepts/Science/Physics/Electricity-and-Magnetism/Vacuum-Magnetic-Permeability","Concepts/Science/Physics/Electricity-and-Magnetism/Maxwell's-Equations","Concepts/Science/Physics/Electricity-and-Magnetism/Electric-Flux","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics/em"],"content":"Topic: Electromagnetism\nAmpere’s Law\nAmpere’s Law states that the Line Integral of the Magnetic Field \\vec{\\textbf{B}} around any closed path is equal to \\mu_{0} times the total net current I_{encl} enclosed by that path: \\oint \\vec{\\textbf{B}} \\cdot d \\vec{\\ell} = \\mu_{0} I_{encl}\nWhere \\mu_{0} is the magnetic constant.\nMaxwell’s Addition\nMaxwell found that a changing Electric Flux also influences the magnetic field. He added a term to Ampere’s Law to account for this, creating the finalized equation: \\oint \\vec{\\textbf{B}} \\cdot d \\vec{\\ell} = \\mu_{0} I_{encl} + \\mu_{0} \\epsilon_{0} \\frac{d\\Phi_{e}}{dt}\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 28"},"Concepts/Science/Physics/Electricity-and-Magnetism/Biot-Savart-Equation":{"title":"Biot-Savart Equation","links":["Electromagnetism","Concepts/Science/Physics/Electricity-and-Magnetism/Current","Concepts/Science/Physics/Electricity-and-Magnetism/Magnetic-Field","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics/em"],"content":"Biot-Savart Equation\nTopic: Electromagnetism\nThe relationship between an electric Current I and the Magnetic Field \\vec{B} can be expressed by the equation \\vec{\\textbf{B}} = \\frac{\\mu_{0} I}{4 \\pi} \\int\\limits_{}^{}{\\frac{d \\vec{\\ell} \\times \\hat{\\textbf{r}}}{r^{2}}}\nwhere d\\vec{\\ell} is the tiny change in arc length along the wire.\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 28"},"Concepts/Science/Physics/Electricity-and-Magnetism/Charge":{"title":"Charge","links":["Electromagnetism","Ions","Concepts/Science/Physics/Electricity-and-Magnetism/Elementary-Charge","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics/em"],"content":"Charge\nTopic: Electromagnetism\nElectric charge, denoted by the symbol Q or q, is the property of matter that causes it to experience a force when placed in an electromagnetic field.\nThere are five main ways to charge something:\n\nMove electrons from one to another; i.e. create Ions\nTransfer charge by friction (triboelectric charging)\nCharge by conduction, i.e. physical contact\nPolarization: one side of a neutral object appears positive, other side negative, e.g. water\nInduction: start with polarization, then provide a path for some charge to escape\n\nTransclude of Elementary-Charge#elementary-charge\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 21"},"Concepts/Science/Physics/Electricity-and-Magnetism/Circuits/AC-Circuits":{"title":"AC Circuits","links":["Electromagnetism","Concepts/Science/Physics/Electricity-and-Magnetism/Circuits/RC-Circuits","Concepts/Science/Physics/Electricity-and-Magnetism/Circuits/LC-Circuits","Concepts/Science/Physics/Electricity-and-Magnetism/Circuits/LR-Circuits","Concepts/Science/Physics/Electricity-and-Magnetism/Circuits/LRC-Circuits","Concepts/Science/Physics/Electricity-and-Magnetism/Circuits/Alternating-Current","Concepts/Science/Physics/Electricity-and-Magnetism/Current","Concepts/Science/Physics/Electricity-and-Magnetism/Resistance","Concepts/Science/Physics/Electricity-and-Magnetism/Ohms-Law","Concepts/Science/Physics/Electricity-and-Magnetism/Circuits/Inductors","Concepts/Science/Physics/Electricity-and-Magnetism/Circuits/Inductive-Reactance","Concepts/Science/Physics/Electricity-and-Magnetism/Circuits/Capacitors","Concepts/Science/Physics/Electricity-and-Magnetism/Circuits/Capacitive-Reactance","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics/em"],"content":"AC Circuits\nTopic: Electromagnetism\nIn RC Circuits, LC Circuits. LR Circuits, and LRC Circuits, we assume direct current. However, circuits can alternatively be connected to Alternating Current of a sinusoidal voltage of frequency f. This complicates matters.\nIn an AC circuit, we assume a Current I(t) = I_{0} \\cos{(2\\pi f t)} = I_{0} \\cos{(\\omega t)}\nand averages V_{rms} = V_{0}/\\sqrt{2}, I_{rms} = I_{0}/\\sqrt{2}.\nResistor\nWhen an AC source is connected to a Resistor, the current increases and decreases with the alternating voltage according to Ohms Law:\nV = V_{0} \\cos{(\\omega t)} = IR = I_{0}R \\cos{(\\omega t)}\nwhere V_{0} = I_{0}R is the peak voltage. Energy is lost at an average rate \\bar{P} = I_{rms}^{2}R = \\frac{V_{rms}^{2}}{R}\nInductor\nIn an inductor of Self-Inductance L, it can be shown that V = V_{0} \\cos{(\\omega t + \\frac{\\pi}{2})}; \\quad V_{0} = I_{0} \\omega L\nTherefore, the current lags behind the voltage by \\frac{\\pi}{2} radians.\nThe inductive reactance of the inductor is given by X_{L} = \\omega L = w \\pi f L\nand has units of \\ohm.\nInductive Reactance\nCapacitor\nWhen a Capacitors of capacitance C is connected to an alternating current source, V = V_{0} \\cos{( \\omega t - \\frac{\\pi}{2})}; \\quad V_{0} = I_{0} \\left(\\frac{1}{\\omega C} \\right)\nTherefore, the current leads the voltage by \\frac{\\pi}{2} radians.\nJust as with inductors, there is a capacitive reactance: V_{0} = I_{0}X_{C}; \\quad X_{C} =  \\frac{1}{\\omega C} = \\frac{1}{2 \\pi f C}\nCapacitive Reactance\nAcronym\nRemembering the phases: ELI the ICE man:\n\nE(mf) before I(current) in L(inductors)\nI(current) before E(mf) in C(apacitors)\n\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 30-7"},"Concepts/Science/Physics/Electricity-and-Magnetism/Circuits/Alternating-Current":{"title":"Alternating Current","links":["Electromagnetism","Concepts/Science/Physics/Electricity-and-Magnetism/Electric-Battery","Concepts/Science/Physics/Electricity-and-Magnetism/Circuits/Circuit","Concepts/Science/Physics/Electricity-and-Magnetism/Current","Concepts/Science/Physics/Electricity-and-Magnetism/Voltage","Concepts/Science/Physics/Waves/Frequency","Concepts/Science/Physics/Electricity-and-Magnetism/Ohms-Law","Concepts/Science/Physics/Energy/Power","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics/em"],"content":"Alternating Current\nTopic: Electromagnetism\nWhen a Electric Battery is connected to a Circuit, the Current moves steadily in one direction. This is called direct current. However, we can instead use Alternating Current, AC, which reverses direction many times per second in a sinusoidal pattern. Almost our entire power system relies on AC systems, because AC can be transmitted across longer distances with less energy loss.\nThe Voltage as a function of time in a AC circuit can be written as\nV(t) = V_{0}\\sin{(\\omega t)} = V_{0} \\sin{(2 \\pi f t)}\nwhere V_{0} is the peak voltage and f is the number of complete oscillations per second (Frequency). In the US, f = 60 \\text{ Hz}.\nIn the same manner, from Ohms Law, we find that I = \\frac{V}{R} = I_{0} \\sin{(\\omega t)}\nwhere I_{0} is the peak current.\nThe root-mean-square voltage and current are\nI_{rms} = \\frac{I_{0}}{\\sqrt{2}}; \\quad V_{rms} = \\frac{V_{0}}{\\sqrt{2}}\nand the average Power is\n\\bar{P} = I_{rms}V_{rms} = I^{2}_{rms} R = \\frac{V_{rms}^{2}}{R}\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 25-7"},"Concepts/Science/Physics/Electricity-and-Magnetism/Circuits/Capacitive-Reactance":{"title":"Capacitive Reactance","links":["Electromagnetism","Concepts/Science/Physics/Electricity-and-Magnetism/Circuits/AC-Circuits","Concepts/Science/Physics/Electricity-and-Magnetism/Circuits/Capacitors","Concepts/Science/Physics/Electricity-and-Magnetism/Current","Concepts/Science/Physics/Electricity-and-Magnetism/Circuits/Inductive-Reactance","Concepts/Science/Physics/Electricity-and-Magnetism/Resistance","Concepts/Science/Physics/Electricity-and-Magnetism/Circuits/Impedance","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics/em"],"content":"Capacitive Reactance\nTopic: Electromagnetism\nIn an alternating current circuit with a capacitor, the capacitor impedes the flow of Current. The capacitive reactance represents this impedance, and is given by X_{C} = \\frac{1}{\\omega C} = \\frac{1}{2\\pi f C}\nTogether with the Inductive Reactance and the Resistance, this becomes the Impedance.\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 30"},"Concepts/Science/Physics/Electricity-and-Magnetism/Circuits/Capacitors-in-Parallel":{"title":"Capacitors in Parallel","links":["Electromagnetism","Concepts/Science/Physics/Electricity-and-Magnetism/Circuits/Capacitors","Concepts/Science/Physics/Electricity-and-Magnetism/Voltage","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics/em"],"content":"Capacitors in Parallel\nTopic: Electromagnetism\n\nCapacitors in parallel are all directly connected to the same source.\nThe same Potential Difference V exists across each of the capacitors.\nEach capacitor plate acquires a charge given by Q_{1} = C_{1}V, Q_{2} = C_{2}V, \\dots Q_{n} = C_{n}V\nThe total charge that leaves the battery is Q = Q_{1} + Q_{2} +  \\dots + Q_{n} = C_{eq}V\nThe equivalent capacitance C_{eq} is given by C_{eq} = C_{1} + C_{2} + \\dots + C_{n}\nCapacitors in parallel increase the total capacitance\n\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 24-3"},"Concepts/Science/Physics/Electricity-and-Magnetism/Circuits/Capacitors-in-Series":{"title":"Capacitors in Series","links":["Electromagnetism","Concepts/Science/Physics/Electricity-and-Magnetism/Circuits/Capacitors","Concepts/Science/Physics/Electricity-and-Magnetism/Voltage","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics/em"],"content":"Capacitors in Series\nTopic: Electromagnetism\n\nCapacitors in series all have the same charge Q\nThe total Voltage V across all capacitors in series must equal the sum of the voltages across each: V = V_{1} + V_{2} + \\dots + V_{n}\nThe equivalent capacitance is \\frac{1}{C_{eq}} = \\frac{1}{C_{1}} + \\frac{1}{C_{2}} + \\dots + \\frac{1}{C_{n}}\nThe equivalent capacitance is smaller than the smallest contributing capacitance\n\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 24-3"},"Concepts/Science/Physics/Electricity-and-Magnetism/Circuits/Capacitors":{"title":"Capacitors","links":["Concepts/Science/Physics/Electricity-and-Magnetism/Farad","Concepts/Science/Physics/Electricity-and-Magnetism/Electrical-Fields","Concepts/Science/Physics/Materials/Hookes-Law","Concepts/Science/Physics/Electricity-and-Magnetism/Voltage","Concepts/Science/Physics/Energy/Potential-Energy","Permittivity-of-Free-Space","Concepts/Science/Physics/Electricity-and-Magnetism/Dielectric-Constant","Concepts/Science/Physics/Electricity-and-Magnetism/Energy-Stored-in-a-Capacitor","Concepts/Science/Physics/Electricity-and-Magnetism/Circuits/Capacitors-in-Series","Concepts/Science/Physics/Electricity-and-Magnetism/Circuits/Capacitors-in-Parallel"],"tags":["science/physics/em"],"content":"Capacitors\nTwo layers of conducting materials separated by a layer of insulator form a capacitor.\n\nAn electrical device used for storing electric charge.\nModeled by two parallel conducting plates holding equal charge Q\nThe movement of charge between the plates is prevented by the insulating layer.\nThe unit of measurement for capacitance is the Farad (F)\n\nElectrical Properties\n\nThe Electric Field inside a capacitor is uniform: E = \\frac{\\sigma}{\\epsilon_{0}}\nThe schematic symbol is two parallel lines\nWhen connected to a battery, the voltage difference becomes equal to that of the battery\nCharge on plates is proportional to voltage: Q = CV\nCapacitor is the electrical equivalent to a spring\n\n\n\n                  \n                  Electric Potential Difference for Parallel Plate Capacitor \n                  \n                \n\nThe Potential Difference between the parallel plates of a capacitor is V_{ba} = Ed\nwhen you move from the positive plate at point a to the negative plate at point b. It makes conceptual sense that this is negative because holding a positive charge near the positive plate is difficult, thus increasing Potential Energy, but as it moves to the negative charge it lowers.\n\n\n\nCapacitance\nThe capacitance of a parallel plate capacitor is given by\nC = \\frac{A \\epsilon_{0} K}{d}\nwhere A is the area of each plate, \\epsilon_{0} is the Permittivity of Free Space, K is the Dielectric Constant of the separation material (1 for air!) and d is the distance between the two plates.\nStored Energy\nEnergy Stored in a Capacitor\nCircuits\nSee Capacitors in Series and Capacitors in Parallel."},"Concepts/Science/Physics/Electricity-and-Magnetism/Circuits/Circuit":{"title":"Circuit","links":[],"tags":["electronics","science/physics/em"],"content":"Circuit\nA circuit is a connection of electrical components."},"Concepts/Science/Physics/Electricity-and-Magnetism/Circuits/Impedance":{"title":"Impedance","links":["Electromagnetism","Concepts/Science/Physics/Electricity-and-Magnetism/Resistance","Concepts/Science/Physics/Electricity-and-Magnetism/Circuits/LRC-Series-AC-Circuit","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics/em"],"content":"Impedance\nTopic: Electromagnetism\nThe impedance of a circuit represents the reactances and resistances. In a LRC Series AC Circuit, it is given as Z = \\sqrt{R^{2} + (X_{L} - X_{C})^{2}}\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 30"},"Concepts/Science/Physics/Electricity-and-Magnetism/Circuits/Inductive-Reactance":{"title":"Inductive Reactance","links":["Electromagnetism","Concepts/Science/Physics/Electricity-and-Magnetism/Circuits/AC-Circuits","Concepts/Science/Physics/Electricity-and-Magnetism/Circuits/Inductors","Concepts/Science/Physics/Angular-Motion/Angular-Frequency","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics/em"],"content":"Inductive Reactance\nTopic: Electromagnetism\nIn an AC Circuits containing an inductor, there is an inductive reactance; this is how the inductor impedes the flow of charge.\nX_{L} = \\omega L = \\omega \\pi f L\nwhere L is the Self-Inductance, \\omega is the Angular Frequency of the current.\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 30"},"Concepts/Science/Physics/Electricity-and-Magnetism/Circuits/Inductors":{"title":"Inductors","links":["Electromagnetism","Concepts/Science/Physics/Electricity-and-Magnetism/Circuits/Circuit","Concepts/Science/Physics/Electricity-and-Magnetism/Current","Concepts/Science/Physics/Electricity-and-Magnetism/Magnetic-Flux","Concepts/Science/Physics/Electricity-and-Magnetism/EMF","Concepts/Science/Physics/Electricity-and-Magnetism/Faraday's-Law-of-Induction","Concepts/Science/Physics/Electricity-and-Magnetism/Henrys","Concepts/Science/Physics/Electricity-and-Magnetism/Solenoid","Concepts/Science/Physics/Electricity-and-Magnetism/Energy-Stored-in-a-Magnetic-Field","Concepts/Science/Physics/Electricity-and-Magnetism/Circuits/LR-Circuits","Concepts/Science/Physics/Electricity-and-Magnetism/Circuits/LRC-Circuits","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["electronics","science/physics/em"],"content":"Inductors\nTopic: Electromagnetism\nInductors are components used in circuits. When Current passes through an inductor, the tightly wrapped coils produce a Magnetic Flux which in turns induces a EMF by Faraday’s Law of Induction. This EMF opposes the current, as seen by Lenz’s Law. The result is that if current is increasing, then the induced EMF tends to counter it; and vice versa if decreasing. They can be thought of as adding inertia to the system.\nIf a coil of N turns of wire has a Magnetic Flux of \\Phi_{B} flowing through it due to a Current I, then the self-inductance L is given by L = \\frac{N\\Phi_{B}}{I}\nand the EMF induced in a coil of self-inductance L is \\mathscr{E} = - L \\frac{dI}{dt}\nSelf-inductance is measured in Henrys.\nWhen calculating self-inductance, it is often useful to use the Solenoid magnetic field of B = \\frac{\\mu_{0}NI}{\\ell} \\to \\Phi_{B} = BA = \\frac{\\mu_{0}NIA}{\\ell}.\nInductors allow us to store energy.\nSee also:\n\nLR Circuits\nLRC Circuits\n\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 30-2"},"Concepts/Science/Physics/Electricity-and-Magnetism/Circuits/LC-Circuits":{"title":"LC Circuits","links":["Electromagnetism","Concepts/Science/Physics/Electricity-and-Magnetism/Circuits/Capacitors","Concepts/Science/Physics/Electricity-and-Magnetism/Circuits/Inductors","Concepts/Science/Physics/Electricity-and-Magnetism/Charge","Concepts/Science/Physics/Electricity-and-Magnetism/Voltage","Concepts/Science/Physics/Electricity-and-Magnetism/Kirchhoffs-Rules","Concepts/Math/Differential-Equations/Methods-of-Solution/Solutions-of-Homogeneous-Linear-Equations-with-Constant-Coefficients","Concepts/Science/Physics/Electricity-and-Magnetism/Circuits/LR-Circuits","Concepts/Science/Physics/Electricity-and-Magnetism/Circuits/LC-Circuits","Concepts/Science/Physics/Electricity-and-Magnetism/Circuits/RC-Circuits","Concepts/Science/Physics/Electricity-and-Magnetism/Circuits/LRC-Circuits","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics/em"],"content":"LC Circuits\nTopic: Electromagnetism\nA circuit with a capacitor and an inductor is charged so that one plate of the capacitor has Charge Q_{0} and the other -Q_{0} and the Potential Difference is V = \\frac{Q}{C}. Suppose that at t = 0 a switch is closed allowing the plates to connect. Current flows. By Kirchhoffs Rules, \\frac{Q}{C} - L \\frac{dI}{dt} = 0\nwhich, using that I = - \\frac{dQ}{dt}, becomes \\frac{d^{2}Q}{dt^{2}} + \\frac{Q}{LC} = 0\nThis can be solved using the techniques in Solutions of Homogeneous Linear Equations with Constant Coefficients to find that Q(t) = Q_{0} \\cos{(\\omega t + \\phi)}\nwhere \\omega = \\sqrt{\\frac{1}{LC}}.\nWe can find, again using that I = - \\frac{dQ}{dt}, the current: I(t) = \\omega Q_{0} \\sin{(\\omega t + \\phi)}\nBoth the current and charge oscillate, so this circuit is called an LC oscillator.\nThe next step is combining LR Circuits, LC Circuits, and RC Circuits to describe LRC Circuits.\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 30-5"},"Concepts/Science/Physics/Electricity-and-Magnetism/Circuits/LR-Circuits":{"title":"LR Circuits","links":["Electromagnetism","Concepts/Science/Physics/Electricity-and-Magnetism/Resistance","Concepts/Science/Physics/Electricity-and-Magnetism/Circuits/Inductors","Concepts/Science/Physics/Electricity-and-Magnetism/Voltage","Concepts/Science/Physics/Electricity-and-Magnetism/Current","Concepts/Science/Physics/Electricity-and-Magnetism/Kirchhoffs-Rules","Concepts/Math/Differential-Equations/Methods-of-Solution/Linear-Ordinary-Differential-Equations","Concepts/Science/Physics/Electricity-and-Magnetism/Circuits/RC-Circuits","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics/em"],"content":"LR Circuits\nTopic: Electromagnetism\nConnected\nConsider a circuit with a resistor R and Self-Inductance L connected to a battery of Voltage V_0. At the instant the circuit is closed, current starts to flow, although opposed by inductor. Eventually, it reaches an asymptote when the current stops changing and the inductor stops mattering; at this point, I_{0} = \\frac{V_{0}}{R}\nWe can find the Current at any time I(t) using Kirchhoffs Rules:\nV_{0} - IR - L \\frac{dI}{dt} \\Longrightarrow L \\frac{dI}{dt} + RI = V_{0}\nThis Linear Ordinary Differential Equations can be solved using an integrating factor and the initial conditions that I = 0 when t = 0 to find that I = \\frac{V_{0}}{R}(1 - e^{\\frac{-t}{\\tau}})\nwhere \\tau = \\frac{L}{R}\nis called the time constant of the LR circuit, much like \\tau in RC Circuits.\nDisconnect\nWhen this circuit is disconnected from a battery, the current decays as I = I_{0}e^{\\frac{-t}{\\tau}}\nV = IR\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 30-4"},"Concepts/Science/Physics/Electricity-and-Magnetism/Circuits/LRC-Circuits":{"title":"LRC Circuits","links":["Electromagnetism","Concepts/Science/Physics/Electricity-and-Magnetism/Resistance","Concepts/Science/Physics/Electricity-and-Magnetism/Circuits/Capacitors","Concepts/Science/Physics/Electricity-and-Magnetism/Circuits/Inductors","Concepts/Science/Physics/Waves/SHM/Damped-Harmonic-Motion","Concepts/Science/Physics/Electricity-and-Magnetism/Kirchhoffs-Rules","Concepts/Science/Physics/Electricity-and-Magnetism/Current","Concepts/Math/Differential-Equations/Differential-Equations","Concepts/Math/Differential-Equations/Methods-of-Solution/Solutions-of-Homogeneous-Linear-Equations-with-Constant-Coefficients","Eulers-Formula","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics/em"],"content":"LRC Circuits\nTopic: Electromagnetism\nThe LRC circuit contains a Resistor R, capacitor C charged to Q, and inductor L. An LRC circuit is much like Damped Harmonic Motion.\nBy applying Kirchhoffs Rules, we find that -L \\frac{dI}{dt} - IR + \\frac{Q}{C} = 0\nusing that the Current I = - \\frac{dQ}{dt}, this becomes L \\frac{d^{2}Q}{dt^{2}} + R \\frac{dQ}{dt} + \\frac{1}{C}Q = 0\nThis is a pretty tricky Differential Equation to solve, but it can be done using Solutions of Homogeneous Linear Equations with Constant Coefficients. The trick is that we don’t know if it has complex roots to the associated equation. If R^{2} &lt; \\frac{4L}{C}\nthe system is said to be underdamped, and will oscillate; it is overdamped for R^{2} &gt; 4L/C, and critically damped if equal.\nUnderdamped\nIf it is underdamped, the associated equation has complex roots and applying Eulers Formula results in the charge Q as a function of time:\nQ(t) = Q_{0}e^{- \\frac{R}{2L} t } \\cos{(\\omega&#039; t + \\phi)}\nwhere \\omega&#039; = \\sqrt{\\frac{1}{LC} - \\frac{R^{2}}{4L^{2}}}\nand \\phi is a phase constant which depends on the initial conditions.\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 30-6"},"Concepts/Science/Physics/Electricity-and-Magnetism/Circuits/LRC-Series-AC-Circuit":{"title":"LRC Series AC Circuit","links":["Electromagnetism","Concepts/Science/Physics/Electricity-and-Magnetism/Resistance","Concepts/Science/Physics/Electricity-and-Magnetism/Circuits/Inductors","Concepts/Science/Physics/Electricity-and-Magnetism/Circuits/Capacitors","Phasor-Diagram","Concepts/Science/Physics/Electricity-and-Magnetism/Circuits/Inductive-Reactance","Concepts/Science/Physics/Electricity-and-Magnetism/Circuits/Capacitive-Reactance","Concepts/Science/Physics/Electricity-and-Magnetism/Circuits/Impedance","Concepts/Science/Physics/Waves/SHM/Resonance","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics/em"],"content":"LRC Series AC Circuit\nTopic: Electromagnetism\nAn LRC series AC circuit contains a Resistor of R, a inductor L, and a capacitor C. (or some subset therein). We let V_{R}, V_{L}, \\text{ and } V_{C} represent the voltage across each component at a given instant in time, and V_{R0}, V_{L0}, \\text{ and } V_{C0} represent the peak voltages. The total voltage at any instant is given by V = V_{R} + V_{L} + V_{C}. Note that the sum of the maximums can be greater than the peak voltage of the source.\nLet current be I = I_{0} \\cos{( \\omega t)}\nWe use a Phasor Diagram to make this easier. The magnitude of each arrow is given by V_{R0} = I_{0}R; \\quad V_{L0} = I_{0} X_{L}; \\quad V_{C0} = I_{0} X_{C}\nwhere X_{L} is the Inductive Reactance and X_{C} is the Capacitive Reactance.\nThe total Impedance Z of the circuit is related to voltage by V_{0} = I_{0} Z (or RMS). The phase angle is \\tan{(\\phi)} = \\frac{X_{L}-X_{C}}{R} or \\cos{(\\phi)} = \\frac{R}{Z}.\nThe average power is I_{rms}V_{rms} \\cos{(\\phi)}.\nThe Resonance frequency is \\omega_{0} = \\sqrt{\\frac{1}{LC}}\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 30"},"Concepts/Science/Physics/Electricity-and-Magnetism/Circuits/Mutual-Inductance":{"title":"Mutual Inductance","links":["Electromagnetism","Concepts/Science/Physics/Electricity-and-Magnetism/Circuits/Alternating-Current","Concepts/Science/Physics/Electricity-and-Magnetism/Magnetic-Flux","Concepts/Science/Physics/Electricity-and-Magnetism/Current","Concepts/Science/Physics/Electricity-and-Magnetism/EMF","Concepts/Science/Physics/Electricity-and-Magnetism/Faraday's-Law-of-Induction","Concepts/Science/Physics/Electricity-and-Magnetism/Henrys","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics/em"],"content":"Mutual Inductance\nTopic: Electromagnetism\nMutual inductance refers to the idea that two coils with Alternating Current flowing through them are related. If we let \\Phi_{21} equal the Magnetic Flux through each loop of coil 2 created by coil 1, and let N_{2} equal the number of turns through coil 2, then we can say that N_{2} \\Phi_{21} = MI_{1}\nwhere I_{1} is the Current flowing through coil 1 and M is the mutual inductance. The EMF induced in coil 2, by Faraday’s Law of Induction, is \\mathscr{E}_{2} = - M \\frac{dI_{1}}{dt}\nSimilarly, N_{1} \\Phi_{12} = M I_{2}; \\quad \\mathscr{E}_{1} = -M \\frac{dI_{2}}{dt}\nThe mutual inductance is measured in Henrys.\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 30"},"Concepts/Science/Physics/Electricity-and-Magnetism/Circuits/RC-Circuits":{"title":"RC Circuits","links":["Electromagnetism","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics/em"],"content":"RC Circuits\nTopic: Electromagnetism\nQuick facts:\n\nRC Circuits:\n\nTime Constant: \\tau = RC; half-life t_\\frac{1}{2} = RC \\ln{(2)}\nCapacitor Charging:\n\nQ = C \\epsilon(1 - e^{\\frac{-t}{RC}})\nI = \\frac{\\mathscr{E}}{R} e^{\\frac{-t}{RC}}\nV = \\mathscr{E}(1 - e^{\\frac{-t}{RC}})\n\n\nCapacitor Discharging:\n\nQ - Q_{0} e^{\\frac{-t}{RC}}\nV_{C} = V_{0} e^{\\frac{-t}{RC}}\nI = I_{0}e^{\\frac{-t}{RC}}\n\n\n\n\n\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter"},"Concepts/Science/Physics/Electricity-and-Magnetism/Circuits/Resistors-in-Parallel":{"title":"Resistors in Parallel","links":["Electromagnetism","Concepts/Science/Physics/Electricity-and-Magnetism/Circuits/Capacitors-in-Series","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics/em"],"content":"Resistors in Parallel\nTopic: Electromagnetism\nTo find the equivalent resistance to a group of resistors in parallel, we use the relation:\n\\frac{1}{R_{eq}} = \\frac{1}{R_{1}} + \\frac{1}{R_{2}} + \\cdots + \\frac{1}{R_{n}}\nThis is similar to Capacitors in Series.\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 26"},"Concepts/Science/Physics/Electricity-and-Magnetism/Circuits/Resistors-in-Series":{"title":"Resistors in Series","links":["Electromagnetism","Concepts/Science/Physics/Electricity-and-Magnetism/Circuits/Capacitors-in-Parallel","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics/em"],"content":"Resistors in Series\nTopic: Electromagnetism\nTo find the equivalent resistance to a number of resistors in series of one another, simply sum them:\nR_{eq} = R_{1} + R_{2} + \\cdots + R_{n}\nThis is reminiscent of Capacitors in Parallel.\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 26"},"Concepts/Science/Physics/Electricity-and-Magnetism/Coulomb":{"title":"Coulomb","links":["Concepts/Science/Physics/Electricity-and-Magnetism/Coulomb"],"tags":["science/physics/em"],"content":"Coulomb\n1 Coulomb is associated with 6.25 billion billion electrons. This is about the amount of charge that passes through a common 100-watt light bulb in a little over a second."},"Concepts/Science/Physics/Electricity-and-Magnetism/Coulombs-Law":{"title":"Coulombs Law of Electrical Forces","links":["Concepts/Science/Physics/Electricity-and-Magnetism/Coulomb","Permittivity-of-Free-Space","Concepts/Math/Linear-Algebra/Vectors/Vectors","Concepts/Science/Physics/Newtonian-Mechanics/Force"],"tags":["science/physics/em"],"content":"Coulombs Law of Electrical Forces\n\n\n                  \n                  Coulomb&#039;s Law of Electrical Forces \n                  \n                \n\nFor charged particles that are smaller than the distance between them, the force between two charges varies as the product of the charges and inversely as the square of the separation distance. The force acts along a straight line from one charge to the other.\nF_{e}= \\frac{Kq_{1}q_{2}}{r^{2}} \\hat{\\textbf{r}}\nwhere F_{e}=\\text{the electrical force between the two charges, measured in Newtons}\nK = 8.99 \\cdot 10^{9} \\cdot \\frac{N*m^{2}}{c^{2}}\nq_{1}=\\text{the quantity of charge of one particle, measured in coulombs (C)}\nq_{2}=\\text{the quantity of charge of the second particle, measured in coulombs (C)}\nr = \\text{distance in meters}\n\n\n1 C or 1 Coulomb is associated with 6.25 billion billion electrons. This is about the amount of charge that passes through a common 100-watt light bulb in a little over a second.\nK is the electrical constant, and is equal to \\frac{1}{4\\pi \\epsilon_{0}}\nWhere \\epsilon_{0} is the constant for the Permittivity of Free Space, 8.85 \\text{ pF/m}.\nMultiple Charges\nWhen there are multiple charges acting, we perform a simple vector sum as with any other Force problem:\nF_{net} = \\sum\\limits_{i} K \\frac{q q_{i}}{r_{i}^{2}} \\hat{\\textbf{r}}_{i} "},"Concepts/Science/Physics/Electricity-and-Magnetism/Current-Density":{"title":"Current Density","links":["Electromagnetism","Concepts/Science/Physics/Electricity-and-Magnetism/Current","Concepts/Math/Calculus/Integrals/Multivariable/Line-Integral","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics/em"],"content":"Current Density\nTopic: Electromagnetism\nCurrent can be defined in terms of a microscopic quantity \\vec{\\textbf{j}}, called the current density. It is defined as the Current per unit cross-sectional area at any point in space. Current can then be defined as the Line Integral\nI = \\int\\limits_{}^{}{\\vec{\\textbf{j}} \\cdot d \\vec{\\textbf{A}}}\nThis allows for current to be calculated in situations where the current is not uniform or the area of the wire is not uniform.\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 25"},"Concepts/Science/Physics/Electricity-and-Magnetism/Current":{"title":"Current","links":["Electromagnetism","Concepts/Science/Physics/Energy/Ampere","Concepts/Science/Physics/Electricity-and-Magnetism/Coulomb","Concepts/Math/Calculus/Derivatives/Instantaneous-Rate-of-Change","Concepts/Science/Physics/Electricity-and-Magnetism/Circuits/Circuit","Concepts/Science/Physics/Electricity-and-Magnetism/Charge","Concepts/Science/Physics/Quantum-Mechanics/Electrons","Concepts/Science/Physics/Electricity-and-Magnetism/Voltage","Concepts/Science/Physics/Electricity-and-Magnetism/Resistance","Concepts/Science/Physics/Electricity-and-Magnetism/Ohms-Law","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["electronics","science/physics/em"],"content":"Current\nTopic: Electromagnetism\nCurrent refers to the rate of flow of electricity. It is measured in Amperes, which is charge/second = Coulomb/second (1 \\text{ A} = 1 \\text{ C/s}).\nThe instantaneous current is defined by the derivative in the limit of I = \\lim_{\\Delta t\\to0} \\frac{\\Delta Q}{\\Delta t} = \\frac{dQ}{dt}\nCurrent can only flow in a Circuit that is complete; there is no break.\nCurrent flows in the conventional direction, which assumes that positive Charge flows. In reality, it is Electrons that flow - our model is inverted.\nCurrent is related to Voltage and Resistance by Ohms Law.\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 25"},"Concepts/Science/Physics/Electricity-and-Magnetism/Dielectric-Constant":{"title":"Dielectric Constant","links":["Electromagnetism","Concepts/Science/Physics/Electricity-and-Magnetism/Electrical-Conductors","Concepts/Science/Physics/Electricity-and-Magnetism/Circuits/Capacitors","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics/em"],"content":"Dielectric Constant\nTopic: Electromagnetism\nA dielectric is an Insulator between the two plates of a capacitor. It has an associated dielectric constant which determines how effective it is at increasing the capacitance. It is given the symbol K, can scales the capacitance by C = K C_{0}. The full equation is seen in Capacitance.\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 24-5"},"Concepts/Science/Physics/Electricity-and-Magnetism/Dipoles":{"title":"Dipoles","links":["Electromagnetism","Concepts/Science/Physics/Electricity-and-Magnetism/Charge","Concepts/Science/Physics/Electricity-and-Magnetism/Electrical-Fields","Concepts/Science/Physics/Angular-Motion/Torque","Concepts/Math/Linear-Algebra/Vectors/Vector-Cross-Product","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics/em"],"content":"Dipoles\nTopic: Electromagnetism\nA dipole is an electrical system with two point charges of equal and opposite charge separated by a distance \\ell.\nAn electric dipole is represented mathematically by \\vec{\\textbf{p}} = Q\\ell, where \\vec{\\textbf{p}} points from the negative to the positive charge.\nAn electric dipole placed in an Electric Field may have some Torque. Specifically, it will have torque given by\n\\vec{\\tau} = \\vec{\\textbf{p}} \\times \\vec{\\textbf{E}}\nWhen \\theta = 0 or 180, this will be 0. However, the system is only stable when \\theta = 0. See Vector Cross Product.\n\n\n                  \n                  Potential Energy of a Dipole \n                  \n                \n\nA dipole will have potential energy equal to U = -\\vec{\\textbf{p}} \\cdot \\vec{\\textbf{E}}\n\n\n\n\n                  \n                  Electric Field on a Charge From a Dipole \n                  \n                \n\nA dipole will create an Electric Field of form \\vec{\\textbf{E}} = - \\frac{1}{4 \\pi \\epsilon_{0}} \\frac{p}{(r^{2} + \\frac{\\ell^{2}}{4})^\\frac{3}{2}} \\hat{\\textbf{p}}\nWhich, for sufficiently large values of r \\gg \\ell, simply becomes \\vec{\\textbf{E}} = - \\frac{1}{4\\pi \\epsilon_{0}} \\frac{p}{r^{3}} \\hat{\\textbf{p}}\n\n\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 21"},"Concepts/Science/Physics/Electricity-and-Magnetism/EMF":{"title":"EMF","links":["Electromagnetism","Concepts/Science/Physics/Electricity-and-Magnetism/Voltage","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics/em"],"content":"EMF\nTopic: Electromagnetism\nThe term EMF originally referred to electromotive force. Now, the Potential Difference between the terminals of a source, when no current flows to an external circuit, is called the emf of the source. The symbol \\mathscr{E} (script E) is used to denote this value.\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 26"},"Concepts/Science/Physics/Electricity-and-Magnetism/Electric-Battery":{"title":"Electric Battery","links":["Electromagnetism","Concepts/Science/Physics/Energy/Energy","Concepts/Science/Physics/Energy/Potential-Energy","Concepts/Science/Physics/Electricity-and-Magnetism/Electric-Potential-Energy","Concepts/Science/Physics/Electricity-and-Magnetism/Voltage","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics/em"],"content":"Electric Battery\nTopic: Electromagnetism\nA battery stores Energy. It has to somehow convert that stored Potential Energy into Electric Potential Energy to produce a voltage and current. The way that modern batteries work, typically, is by having some chemical reaction that releases electrons as a byproduct. The electrons are then attracted to a metal, typically zinc, which creates a negative charge in relation to a positive electrode, typically carbon. The resulting Potential Difference is the Voltage of the battery.\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 25-1"},"Concepts/Science/Physics/Electricity-and-Magnetism/Electric-Field-Determined-from-Voltage":{"title":"Electric Field Determined from Voltage","links":["Electromagnetism","Concepts/Science/Physics/Electricity-and-Magnetism/Voltage","Concepts/Math/Calculus/Derivatives/Multivariable/Gradient-Vector","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics/em"],"content":"Electric Field Determined from Voltage\nTopic: Electromagnetism\nIf we take the derivative of the equation \\Delta V = \\int\\limits_{}^{}{\\vec{\\textbf{E}} \\cdot d\\vec{\\ell}} (^3e149e), we find that\ndV = -E_{\\ell}d\\ell\nwhere dV is the infinitesimal Potential Difference between two points a distance d\\ell apart with a component of the electric field E_{\\ell} in the direction of the displacement. Rearranging, we find that\nE_{\\ell} = - \\frac{dV}{d\\ell}\nor \\vec{\\textbf{E}} = - \\vec{\\nabla} V\nwhere \\nabla represents the Gradient Vector.\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 23-7"},"Concepts/Science/Physics/Electricity-and-Magnetism/Electric-Field-Lines":{"title":"Electric Field Lines","links":["Electromagnetism","Concepts/Science/Physics/Electricity-and-Magnetism/Electrical-Fields","Concepts/Science/Physics/Electricity-and-Magnetism/Voltage","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics/em"],"content":"Electric Field Lines\nTopic: Electromagnetism\nA common way of thinking about Electrical Fields is in terms of a simple diagram of charged particles or bodies with lines flowing into or out of them. These are called electric field lines or simply field lines.\nThere are many rules for how field lines should be drawn:\n\nElectric field lines indicate the direction of the electric field; the field points in the direction tangent to the field line at any point\nThe lines are drawn so that the magnitude of the electric field, E, is proportional to the number of lines crossing unit area perpendicular to the lines. The closer together the lines, the stronger the field.\nElectric field lines start on positive charges and end on negative charges (or infinity!); and the number starting or ending is proportional to the magnitude of the charge.\nElectric field lines never cross. You can’t have two directions at the same point.\nLines are always perpendicular to lines of constant Voltage\n\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 21"},"Concepts/Science/Physics/Electricity-and-Magnetism/Electric-Flux":{"title":"Electric Flux","links":["Electromagnetism","Concepts/Science/Physics/Electricity-and-Magnetism/Electrical-Fields","Concepts/Science/Physics/Electricity-and-Magnetism/Electric-Field-Lines","Concepts/Science/Physics/Electricity-and-Magnetism/Gauss's-Law","Concepts/Math/Calculus/Integrals/Multivariable/Flux-in-Two-Dimensions","Concepts/Math/Calculus/Integrals/Multivariable/Flux-in-Three-Dimensions","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics/em"],"content":"Electric Flux\nTopic: Electromagnetism\n\n\n                  \n                  Electric Flux \n                  \n                \n\nThe electric flux refers to the Electrical Fields passing through a given area, and is denoted by \\Phi_{E} = \\vec{\\textbf{E}} \\cdot \\vec{\\textbf{A}}\nwhere \\vec{\\textbf{E}} is the electric field vector and \\vec{\\textbf{A}} is the area vector; that is, the vector with magnitude corresponding to area and direction normal to it.\n\n\nElectric flux is often though about in terms of Electric Field Lines, such that if you have N field lines passing through an area then N \\propto \\Phi. Typically, flux is found using Gauss’s Law.\nFor ways of evaluating flux, see Flux in Two Dimensions and Flux in Three Dimensions.\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 22"},"Concepts/Science/Physics/Electricity-and-Magnetism/Electric-Potential-Due-To-A-Point-Charge":{"title":"Electric Potential Due To A Point Charge","links":["Electromagnetism","Concepts/Science/Physics/Electricity-and-Magnetism/Charge","Concepts/Science/Physics/Electricity-and-Magnetism/Electrical-Fields","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics/em"],"content":"Electric Potential Due To A Point Charge\nTopic: Electromagnetism\n\n\n                  \n                  Electric Potential Due to Point Charges \n                  \n                \n\nConsider a single point Charge Q. The Electric Field due to this point charge is a symmetric E = \\frac{1}{4\\pi \\epsilon_{0}} \\frac{Q}{r^{2}}\nThe potential difference due to this field is V_{b} - V_{a} = - \\int\\limits_{r_{a}}^{r_{b}}{\\vec{\\textbf{E}} \\cdot d\\vec{\\ell}} = - \\frac{Q}{4 \\pi \\epsilon_{0}} \\int\\limits_{r_{a}}^{r_{b}}{\\frac{1}{r^{2}}dr} = \\boxed{\\frac{1}{4\\pi \\epsilon_{0}}\\left(\\frac{Q}{r_{b}} - \\frac{Q}{r_{a}}\\right)}\nIf we let V_{b} = 0 at r_{b} = \\infty, then potential difference at a distance r from a single point charge is simply V = \\frac{1}{4\\pi \\epsilon_{0}} \\frac{Q}{r}\nThis is sometimes called the Coulomb potential.\n\n\n\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 23-3"},"Concepts/Science/Physics/Electricity-and-Magnetism/Electric-Potential-Energy":{"title":"Electric Potential Energy","links":["Electromagnetism","Concepts/Science/Physics/Energy/Potential-Energy","Concepts/Science/Physics/Energy/Conservative-Forces","Concepts/Science/Physics/Electricity-and-Magnetism/Electrical-Fields","Concepts/Science/Physics/Energy/Conservation-of-Energy","Concepts/Science/Physics/Electricity-and-Magnetism/Charge","Concepts/Science/Physics/Energy/Work","Concepts/Science/Physics/Electricity-and-Magnetism/Voltage","Concepts/Science/Physics/Electricity-and-Magnetism/Volt","Concepts/Science/Physics/Electricity-and-Magnetism/Coulomb","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics/em"],"content":"Electric Potential Energy\nTopic: Electromagnetism\nElectric Potential Energy is due to the conservative force due to Electrical Fields.\n\n\n                  \n                  Derivation of EPE \n                  \n                \n\nFrom the Conservation of Energy for conservative forces, we know that \\Delta U = -W. We can then define the change in electric potential energy to be \\Delta U = U_{b} - U_{a} when a Charge q moves from some point a to another point b. If we assume the field \\vec{\\textbf{E}} is uniform, then the Work done W by the electric field to move the distance a charge d (to go from a to b) is W = Fd = qEd\nThe change in electric potential energy is the negative of this, so \\text{EPE} = \\Delta U = U_{b} - U_{a} = -W = -qEd\nTypically, we then define U_{a} to be 0 or U_{b} to be 0. The latter is often convenient because it leaves us with positive values.\n\n\nThe electric potential energy per charge is defines Electric Potential.\nUsing Voltage, we can also write the change in potential energy of a charge q when it moves from point a to point b as\n\\Delta U = U_{b} - U_{a} = q(V_{b} - V_{a}) = qV_{ba}\n\n\n                  \n                  Potential Energy Example \n                  \n                \n\nIf the potential difference between two parallel plates is 6 volts, and a charge of 1 Coulomb is moved across them, what is the change in potential energy?\nSolution:\n\\Delta U = qV_{ba} = (1 \\text{ C})(6 \\text{ V}) = 6 \\text{ J}\n\n\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 23"},"Concepts/Science/Physics/Electricity-and-Magnetism/Electrical-Conductors":{"title":"Electrical Conductors","links":["Electromagnetism","Concepts/Science/Physics/Materials/Materials","Concepts/Science/Physics/Quantum-Mechanics/Electrons","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics/em"],"content":"Electrical Conductors\nTopic: Electromagnetism\nMaterials have an associated property called their electrical conductivity. It refers to how easily electricity flows through them. Materials that are good conductors, like copper, typically have free Electrons, which allow them to transfer charge easily. These are thus good conductors.\nA material which is good at conducting is called a conductor, and one which isn’t is called a insulator or dielectric.\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 24-5"},"Concepts/Science/Physics/Electricity-and-Magnetism/Electrical-Fields":{"title":"Electrical Fields","links":["Electromagnetism","Concepts/Science/Physics/Electricity-and-Magnetism/Charge","Concepts/Science/Physics/Electricity-and-Magnetism/Coulombs-Law","Concepts/Science/Physics/Electricity-and-Magnetism/Volt","Concepts/Science/Physics/Electricity-and-Magnetism/Coulomb","Permittivity-of-Free-Space","Concepts/Science/Physics/Electricity-and-Magnetism/Electric-Field-Lines","Concepts/Science/Physics/Electricity-and-Magnetism/Electrical-Conductors","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics/em"],"content":"Electrical Fields\nTopic: Electromagnetism\nA Charge produces an electric field in all of space, with a force dictated by Coulombs Law. Every “thing” in the field experiences a force due to it. A field is denoted by \\vec{E}.\nThe magnitude of \\vec{E} on a “test charge” q is \\vec{\\textbf{E}} = \\frac{\\vec{\\textbf{F}}}{q}\nwhere the charge is assumed to be small enough that it does not impact \\vec{E}.\nThe electric field, \\vec{E} = \\frac{K}{r^{2} q}\\hat{\\textbf{r}}, can be measured \\text{ in V/m or N/C}. (volts per meter or Newtons per Coulomb). Note that K = 8.99 \\cdot 10^{9} \\cdot \\frac{N*m^{2}}{c^{2}} or K is the electrical constant, and is equal to \\frac{1}{4\\pi \\epsilon_{0}}\nWhere \\epsilon_{0} is the constant for the Permittivity of Free Space, 8.85 \\text{ pF/m}.\nField Lines\nTransclude of Electric-Field-Lines#electric-field-lines\nElectric Fields and Electrical Conductors\n\nElectric field inside a conductor is 0 (electrons move inside)\nNet charge on a conductor is on the outside\nElectric field of a conductor is always perpendicular to the surface for an electrostatic\nSharp or round ends have larger charge density which equals large electric fields. More mathematically, areas of greater curvature have greater electric fields\n\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 21"},"Concepts/Science/Physics/Electricity-and-Magnetism/Electromagnetic-Velocity-Selector":{"title":"Electromagnetic Velocity Selector","links":["Electromagnetism","Ions","Concepts/Science/Physics/Electricity-and-Magnetism/Charge","Concepts/Science/Physics/Electricity-and-Magnetism/Electrical-Fields","Concepts/Science/Physics/Electricity-and-Magnetism/Magnetic-Field","Concepts/Science/Physics/Electricity-and-Magnetism/Lorentz-Force","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics/em"],"content":"Electromagnetic Velocity Selector\nTopic: Electromagnetism\nIf you release Ions of Charge q through a slit into a region where there are perpendicular Electrical Fields and Magnetic Fields, the ions will follow a straight-line path if the electric force is balanced by the magnetic force, which occurs only when v = \\frac{E}{B}\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 27"},"Concepts/Science/Physics/Electricity-and-Magnetism/Electromagnetic-Waves":{"title":"Electromagnetic Waves ","links":["Concepts/Science/Physics/Waves/Waves","Concepts/Science/Physics/Electricity-and-Magnetism/Electrical-Fields","Concepts/Science/Physics/Electricity-and-Magnetism/Magnetic-Field","Light"],"tags":["science/physics/em"],"content":"Electromagnetic Waves\nWaves of the Electric Field and Magnetic Field that propagate through space. Light is an example."},"Concepts/Science/Physics/Electricity-and-Magnetism/Electron-Drift-Speed":{"title":"Electron Drift Speed","links":["Electromagnetism","Concepts/Science/Physics/Electricity-and-Magnetism/Current-Density","Concepts/Science/Physics/Quantum-Mechanics/Electrons","Concepts/Science/Physics/Newtonian-Mechanics/Momentum/Collisions","Concepts/Science/Physics/Electricity-and-Magnetism/Current","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics/em"],"content":"Electron Drift Speed\nTopic: Electromagnetism\nOne occasionally useful way to define Current Density is in terms of the number of moving Electrons and their drift speed v_{d}. Drift speed refers to the average speed of electrons inside a wire. Collisions within the wire keep them from accelerating further, so the drift speed is much smaller than the electron’s average random speed.\nThe relation is:\nj = -ne v_{d}\nwhere the - sign denotes that the electrons move opposite of conventional Current.\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 25"},"Concepts/Science/Physics/Electricity-and-Magnetism/Electron-Volt":{"title":"Electron Volt","links":["Electromagnetism","Concepts/Science/Physics/Quantum-Mechanics/Electrons","Concepts/Science/Physics/Energy/Joules","Concepts/Science/Physics/Electricity-and-Magnetism/Elementary-Charge","Concepts/Science/Physics/Electricity-and-Magnetism/Voltage","Concepts/Science/Physics/Electricity-and-Magnetism/Volt","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics/em"],"content":"Electron Volt\nTopic: Electromagnetism\nWhen dealing with Electrons, Joules are a very large unit of energy. Accordingly, we sometimes use the electron volt (eV) which is defined as the energy acquired by a particle carrying the Elementary Charge through a Potential Difference of 1 Volt. Thus, 1 \\text{ eV} = 1.6022 \\times 10^{-19} \\text{ J}\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 23-8"},"Concepts/Science/Physics/Electricity-and-Magnetism/Elementary-Charge":{"title":"Elementary Charge","links":["Electromagnetism","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics/em"],"content":"Elementary Charge\nTopic: Electromagnetism\nThe magnitude of the charge of a proton or an electron is equal to e = 1.60 \\times 10^{-19} \\text{ C}, where \\text{C} is a Coulomb. An electron has a charge of -e, and a proton has e. It has been found that all other charges are exact multiples of e. That is, all charges Q = \\alpha e, \\alpha \\in \\mathbb{Z}.\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 23-8"},"Concepts/Science/Physics/Electricity-and-Magnetism/Energy-Stored-in-a-Capacitor":{"title":"Energy Stored in a Capacitor","links":["Electromagnetism","Concepts/Science/Physics/Electricity-and-Magnetism/Circuits/Capacitors","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics/em"],"content":"Energy Stored in a Capacitor\nTopic: Electromagnetism\nThe energy stored in a capacitor is found by\nU = \\frac{1}{2} \\frac{Q^{2}}{C} = \\frac{1}{2}CV^{2}= \\frac{1}{2}QV\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 23-4"},"Concepts/Science/Physics/Electricity-and-Magnetism/Energy-Stored-in-a-Magnetic-Field":{"title":"Energy Stored in a Magnetic Field","links":["Electromagnetism","Concepts/Science/Physics/Electricity-and-Magnetism/Circuits/Inductors","Concepts/Science/Physics/Electricity-and-Magnetism/Current","Concepts/Science/Physics/Electricity-and-Magnetism/Energy-Stored-in-a-Capacitor","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics/em"],"content":"Energy Stored in a Magnetic Field\nTopic: Electromagnetism\nAn Inductors of inductance L is carrying a Current I. The energy stored in the inductor is given by U = \\frac{1}{2} LI^{2}\nwhen we take U = 0 when I = 0.\nThis formula is comparable to the Energy Stored in a Capacitor.\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 30-3"},"Concepts/Science/Physics/Electricity-and-Magnetism/Equipotential-Lines-and-Surfaces":{"title":"Equipotential Lines and Surfaces","links":["Electromagnetism","Concepts/Science/Physics/Electricity-and-Magnetism/Voltage","Concepts/Math/Functions/Visualizing-Multivariable-Functions","Concepts/Science/Physics/Electricity-and-Magnetism/Electrical-Fields","Concepts/Science/Physics/Energy/Work","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics/em"],"content":"Equipotential Lines and Surfaces\nTopic: Electromagnetism\nThe Electric Potential over space can be represented by drawing equipotential lines or, in three dimensions, equipotential surfaces.\n\nSurfaces where the potential difference between any two points is zero, i.e. Level Curves\nSurfaces must be perpendicular to the Electric Field at any point\nNo Work is required to move a charge from one point on the surface to another\n\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 23-5"},"Concepts/Science/Physics/Electricity-and-Magnetism/Farad":{"title":"Farad","links":["Concepts/Science/Physics/Electricity-and-Magnetism/Circuits/Capacitors"],"tags":["science/physics/em"],"content":"Farad\nThe unit of Capacitors."},"Concepts/Science/Physics/Electricity-and-Magnetism/Faraday's-Law-of-Induction":{"title":"Faraday's Law of Induction","links":["Electromagnetism","Concepts/Science/Physics/Electricity-and-Magnetism/Magnetic-Field","Concepts/Science/Physics/Electricity-and-Magnetism/EMF","Concepts/Science/Physics/Electricity-and-Magnetism/Magnetic-Flux","Concepts/Science/Physics/Electricity-and-Magnetism/Maxwell-Faraday-Equation","Concepts/Science/Physics/Electricity-and-Magnetism/Maxwell's-Equations","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics/em"],"content":"Faraday’s Law of Induction\nTopic: Electromagnetism\nMichael Faraday discovered that a changing Magnetic Field induces a EMF: \\mathscr{E} = - \\frac{d\\Phi_{B}}{dt}\nwhere \\Phi_{B} is the Magnetic Flux.\nThe induced EMF produces a current whose magnetic field opposes the original change in flux. This is called Lenz’s Law.\nSee also Maxwell-Faraday Equation. This is one of Maxwell’s Equations.\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 29"},"Concepts/Science/Physics/Electricity-and-Magnetism/Ferromagnets":{"title":"Ferromagnets","links":["Electromagnetism","Concepts/Science/Physics/Electricity-and-Magnetism/Magnetic-Field","Concepts/Science/Physics/Electricity-and-Magnetism/Charge","Concepts/Science/Physics/Quantum-Mechanics/Electrons","Concepts/Science/Physics/Materials/Materials","Concepts/Science/Physics/Electricity-and-Magnetism/Biot-Savart-Equation","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics/em"],"content":"Ferromagnets\nTopic: Electromagnetism\nAll magnetic fields are said to be produced due to moving Electrical Charges. How, then, do fridge magnets work? Well it is due to the Electrons moving inside the material. For example, the electrons in the orbit of a copper atom produce some tiny magnetic field, as described by the Biot-Savart Equation. In most materials, these electron-induced fields cancel out. In certain ferromagnets, however, they can be reinforce to become permanent magnets.\nFerromagnets are made up of many tiny domains, each a tiny sub-magnet. In a permanent magnet, they become aligned. When they become fixed in place, they become “hard.” In other materials, these aligned domains instead return to random, in which case they are considered “soft.”\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 28"},"Concepts/Science/Physics/Electricity-and-Magnetism/Force-on-an-Electric-Current-in-a-Magnetic-Field":{"title":"Force on an Electric Current in a Magnetic Field","links":["Electromagnetism","Concepts/Science/Physics/Electricity-and-Magnetism/Current","Concepts/Science/Physics/Electricity-and-Magnetism/Magnetic-Field","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics/em"],"content":"Force on an Electric Current in a Magnetic Field\nTopic: Electromagnetism\nWhen a wire carrying an electric Current is placed in a Magnetic Field, it experiences a force. The direction of the force is given by a right-hand-rule: put your fingers in the direction of the conventional Current I, curl them in the direction of the magnetic field \\vec{\\textbf{B}}, then your thumb points in the direction of \\vec{\\textbf{F}}. Mathematically, it is found that:\n\\vec{\\textbf{F}} = I \\vec{\\ell} \\times \\vec{\\textbf{B}}\nwhere \\vec{\\ell} is the length and direction of a straight wire. More generally, though, it can be written that d \\vec{\\textbf{F}} = I d\\vec{\\ell} \\times \\vec{\\textbf{B}} \\to \\vec{\\textbf{F}} = I \\int\\limits_{}^{}{d\\vec{\\ell} \\times \\vec{\\textbf{B}}} = \\int\\limits_{}^{}{\\vec{j} \\cdot d\\vec{A}} \\int\\limits_{}^{}{d\\vec{\\ell} \\times \\vec{\\textbf{B}}}\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 27"},"Concepts/Science/Physics/Electricity-and-Magnetism/Gauss's-Law":{"title":"Gauss's Law","links":["Electromagnetism","Concepts/Science/Physics/Electricity-and-Magnetism/Electric-Flux","Concepts/Math/Calculus/Integrals/Multivariable/Surface-Integrals","Concepts/Math/Calculus/Derivatives/Multivariable/Divergence-Theorem","Concepts/Math/Calculus/Derivatives/Multivariable/Divergence-Operator","Concepts/Science/Physics/Electricity-and-Magnetism/Electrical-Fields","Concepts/Science/Physics/Materials/Density","Permittivity-of-Free-Space","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics/em"],"content":"Topic: Electromagnetism\nGauss’s Law\nGauss’s Law is a method for finding/analyzing the net charge in an enclosed space and the related Electric Flux through a surface.\n\n\n                  \n                  Gaussian Surface \n                  \n                \n\nWe deem an imaginary closed surface surrounding some section of space to be a Gaussian Surface.\n\n\n\n\n                  \n                  Gauss&#039;s Law \n                  \n                \n\nThe relation between the electric flux through a closed surface (Gaussian Surface) and the net charge Q_\\text{encl} enclosed within that surface is given by\n\\oint \\vec{\\textbf{E}} \\cdot d\\vec{\\textbf{A}} = \\frac{Q_\\text{encl}}{\\epsilon_{0}}\nwhich is a surface integral.\n\n\nThe law is found by dividing a surface into many small areas of size d \\vec{\\textbf{A}} and summing over the surface to find the total electric flux through a closed surface.\nDifferential Form\nIt follows from the Divergence Theorem that Gauss’s Law can be alternatively written in the differential form \\nabla \\cdot \\vec{\\textbf{E}} = \\frac{\\rho}{\\epsilon_{0}}\nwhere \\nabla \\cdot \\vec{\\textbf{E}} is the Divergence Operator of the Electric Field \\vec{\\textbf{E}}, \\rho is the volume charge Density, and \\epsilon_{0} is the Permittivity of Free Space.\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 22"},"Concepts/Science/Physics/Electricity-and-Magnetism/Henrys":{"title":"Henrys","links":["Electromagnetism","Concepts/Science/Physics/Electricity-and-Magnetism/Circuits/Mutual-Inductance","Concepts/Science/Physics/Electricity-and-Magnetism/Volt","Concepts/Science/Physics/Energy/Ampere","Concepts/Science/Physics/Electricity-and-Magnetism/Resistance","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics/em"],"content":"Henrys\nTopic: Electromagnetism\nThe Henry is a unit of inductance (used for Mutual Inductance and L in circuits): 1 \\text{ H} = \\frac{1 \\text{ V} \\cdot \\text{s}}{1 \\text{ A}} = 1 \\Omega \\cdot \\text{s}\nwhere V is Volt, A is Ampere, and \\ohm is Resistance.\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 30"},"Concepts/Science/Physics/Electricity-and-Magnetism/Kirchhoffs-Rules":{"title":"Kirchhoffs Rules","links":["Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics/em","electronics"],"content":"Kirchhoffs Rules\nKirchhoff’s First Law\nThe total current flowing towards a junction is equal to the total current flowing away from that junction. i.e the algebraic sum of the currents flowing in a junction is zero.\nKirchhoff’s Second Law\nIn a closed circuit the algebraic sum of the products of the current and the resistance of each part of the circuit is equal to the resultant EMF, or voltage, in the circuit.\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 26-3"},"Concepts/Science/Physics/Electricity-and-Magnetism/Lorentz-Force":{"title":"Lorentz Force","links":["Electromagnetism","Concepts/Science/Physics/Electricity-and-Magnetism/Electrical-Fields","Concepts/Science/Physics/Electricity-and-Magnetism/Magnetic-Field","Concepts/Science/Physics/Electricity-and-Magnetism/Charge","Concepts/Math/Linear-Algebra/Vectors/Vector-Cross-Product","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics/em"],"content":"Lorentz Force\nTopic: Electromagnetism\nThe Lorentz Force is the combination of the Electric Field and the Magnetic Field on a point charge. It states that a particle of Charge q moving with a velocity \\vec{\\textbf{v}} in an electric field \\vec{\\textbf{E}} and a magnetic field \\vec{\\textbf{B}} experiences a force of\nF = q(\\vec{\\textbf{E}} + v \\times \\vec{\\textbf{B}})\nwhere (\\vec{\\textbf{v}} \\times \\vec{\\textbf{B}}) is a Vector Cross Product.\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 27"},"Concepts/Science/Physics/Electricity-and-Magnetism/Magnet":{"title":"Magnet","links":["Electromagnetism","Concepts/Science/Physics/Electricity-and-Magnetism/Magnetic-Field","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics/em"],"content":"Magnet\nTopic: Electromagnetism\nA magnet is an object with a Magnetic Field. It has a north and south pole.\nIf a magnet is divided, it creates two smaller magnets both with north and south poles.\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 27"},"Concepts/Science/Physics/Electricity-and-Magnetism/Magnetic-Dipole-Moment":{"title":"Magnetic Dipole Moment","links":["Electromagnetism","Concepts/Science/Physics/Angular-Motion/Torque","Concepts/Science/Physics/Electricity-and-Magnetism/Magnetic-Field","Concepts/Science/Physics/Electricity-and-Magnetism/Current","Concepts/Math/Linear-Algebra/Vectors/Vectors","Concepts/Science/Physics/Electricity-and-Magnetism/Torque-on-a-Current-Loop-in-a-Magnetic-Field","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics/em"],"content":"Magnetic Dipole Moment\nTopic: Electromagnetism\nThe magnetic dipole moment (\\vec{\\mu}) of an object determines the magnitude of the Torque that the object experiences in a given Magnetic Field. It emerges from the idea of Current flowing in a closed loop of wire.\n\\vec{\\mu} = NI \\vec{A}\nwhere \\vec{A} is the area vector - it has direction normal to the plane of the coil and magnitude equal to the area - and N is the number of loops of wire.\nSee also Torque on a Current Loop in a Magnetic Field.\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 27"},"Concepts/Science/Physics/Electricity-and-Magnetism/Magnetic-Field-Due-To-A-Long-Straight-Wire":{"title":"Magnetic Field Due To A Long Straight Wire","links":["Electromagnetism","Concepts/Science/Physics/Electricity-and-Magnetism/Magnetic-Field","Concepts/Science/Physics/Electricity-and-Magnetism/Current","Concepts/Science/Physics/Electricity-and-Magnetism/Vacuum-Magnetic-Permeability","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics/em"],"content":"Magnetic Field Due To A Long Straight Wire\nTopic: Electromagnetism\nThe Magnetic Field due to a long straight wire holding a Current I is proportional to the distance r from the wire: B = \\frac{\\mu_{0}}{2\\pi} \\frac{I}{r}\nwhere \\mu_{0} is the magnetic constant. The direction of the magnetic field lines is given by a right-hand-rule: point your thumb in the direction, and your fingers curl in the direction of the Magnetic Field.\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 28"},"Concepts/Science/Physics/Electricity-and-Magnetism/Magnetic-Field-of-a-Moving-Point-Charge":{"title":"Magnetic Field of a Moving Point Charge","links":["Electromagnetism","Concepts/Science/Physics/Electricity-and-Magnetism/Charge","Concepts/Science/Physics/Newtonian-Mechanics/Velocity","Concepts/Science/Physics/Electricity-and-Magnetism/Magnetic-Field","Concepts/Math/Linear-Algebra/Vectors/Unit-Vectors","Concepts/Science/Physics/Electricity-and-Magnetism/Vacuum-Magnetic-Permeability","Concepts/Science/Physics/Electricity-and-Magnetism/Biot-Savart-Equation","Concepts/Science/Physics/Electricity-and-Magnetism/Current","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics/em"],"content":"Magnetic Field of a Moving Point Charge\nTopic: Electromagnetism\nWhen a Charge q moves through space with a Velocity \\vec{v}, it creates a Magnetic Field at a distance r in the direction of the unit vector \\hat{\\textbf{r}} given by \\vec{\\textbf{B}} = \\frac{\\mu_{0}}{4\\pi} \\frac{q \\vec{v} \\times \\hat{\\textbf{r}}}{r^{2}}\nwhere \\mu_{0} is the Vacuum Magnetic Permeability. This becomes generalized for more charges in the Biot-Savart Equation for a Current.\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 28"},"Concepts/Science/Physics/Electricity-and-Magnetism/Magnetic-Field":{"title":"Magnetic Field","links":["Electromagnetism","Concepts/Math/Calculus/Integrals/Multivariable/Vector-Fields","Concepts/Science/Physics/Electricity-and-Magnetism/Magnet","Concepts/Science/Physics/Electricity-and-Magnetism/Electrical-Fields","Concepts/Science/Physics/Electricity-and-Magnetism/Tesla","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics/em"],"content":"Magnetic Field\nTopic: Electromagnetism\nThe magnetic field, denoted by \\vec{\\textbf{B}}, is the Vector Field surrounding a Magnet. It can be thought of much as the Electric Field. The direction of the magnetic field at a given location is the direction that the north pole of a compass needle would point if placed at that location.\nThe SI unit for the magnetic field is the Tesla (t). It is often measured in the gauss (G): 1 \\text{ G} = 10^{-4} \\text{ T}.\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 27"},"Concepts/Science/Physics/Electricity-and-Magnetism/Magnetic-Flux":{"title":"Magnetic Flux","links":["Electromagnetism","Concepts/Math/Calculus/Integrals/Multivariable/Surface-Integrals","Concepts/Math/Calculus/Integrals/Multivariable/Flux-in-Three-Dimensions","Concepts/Science/Physics/Electricity-and-Magnetism/Faraday's-Law-of-Induction","Concepts/Science/Physics/Electricity-and-Magnetism/Voltage","Concepts/Science/Physics/Electricity-and-Magnetism/Weber-Unit","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics/em"],"content":"Magnetic Flux\nTopic: Electromagnetism\nThe magnetic flux passing through a certain area is given by the Surface Integral \\Phi_{B} = \\iint \\vec{\\textbf{B}} \\cdot d \\vec{\\textbf{A}}\nalso see Flux in Three Dimensions. By Faraday’s Law of Induction, a changing magnetic flux induces a Voltage.\nIt is measured in Webers.\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 29"},"Concepts/Science/Physics/Electricity-and-Magnetism/Magnetic-Gauss's-Law":{"title":"Magnetic Gauss's Law","links":["Electromagnetism","Concepts/Science/Physics/Electricity-and-Magnetism/Gauss's-Law","Concepts/Math/Calculus/Integrals/Multivariable/Flux-in-Three-Dimensions","Concepts/Science/Physics/Electricity-and-Magnetism/Magnetic-Field","Concepts/Math/Calculus/Integrals/Multivariable/Surface-Integrals","Concepts/Math/Calculus/Derivatives/Multivariable/Divergence-Operator","Concepts/Math/Calculus/Derivatives/Multivariable/Del-Notation","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics/em"],"content":"Magnetic Gauss’s Law\nTopic: Electromagnetism\nMuch like Gauss’s Law, there is a relationship between the Flux in Three Dimensions due to a Magnetic Field. Specifically, it states that the Surface Integral evaluates to 0:\n\\oint\\oint_{S} \\vec{\\textbf{B}} \\cdot d\\vec{\\textbf{A}} = 0\nDifferential Form\nIn differential form, using the Divergence Operator as written in Del Notation, \\nabla \\cdot \\vec{\\textbf{B}} = 0\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 29"},"Concepts/Science/Physics/Electricity-and-Magnetism/Mass-Spectrometer":{"title":"Mass Spectrometer","links":["Electromagnetism","Concepts/Science/Physics/Electricity-and-Magnetism/Magnetic-Field","Concepts/Science/Physics/Electricity-and-Magnetism/Electrical-Fields","Ions","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics/em"],"content":"Mass Spectrometer\nTopic: Electromagnetism\nA mass spectrometer uses Magnetic Field and Electric Field effects to measure the mass of Ions, which in turn allows for you to determine the material makeup of a sample.\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 27"},"Concepts/Science/Physics/Electricity-and-Magnetism/Maxwell's-Equations":{"title":"Maxwell's Equations","links":["Electromagnetism","Concepts/Science/Physics/Electricity-and-Magnetism/Gauss's-Law","Concepts/Science/Physics/Electricity-and-Magnetism/Magnetic-Gauss's-Law","Concepts/Science/Physics/Electricity-and-Magnetism/Faraday's-Law-of-Induction","Concepts/Science/Physics/Electricity-and-Magnetism/Maxwell-Faraday-Equation","Concepts/Science/Physics/Electricity-and-Magnetism/Ampere's-Law"],"tags":["science/physics/em"],"content":"Maxwell’s Equations\nJames Clark Maxwell outlined a series of four equations which form the basis of the study of Electromagnetism. The equations are:\n\nGauss’s Law\nMagnetic Gauss’s Law\nFaraday’s Law of Induction (a.k.a) Maxwell-Faraday Equation\nAmpere’s Law\n\n\nReferences"},"Concepts/Science/Physics/Electricity-and-Magnetism/Maxwell-Faraday-Equation":{"title":"Maxwell-Faraday Equation","links":["Electromagnetism","Concepts/Science/Physics/Electricity-and-Magnetism/Faraday's-Law-of-Induction","Concepts/Science/Physics/Electricity-and-Magnetism/Magnetic-Flux","Concepts/Science/Physics/Electricity-and-Magnetism/Electrical-Fields","Concepts/Math/Calculus/Integrals/Multivariable/Line-Integral","Concepts/Math/Calculus/Derivatives/Multivariable/Curl-Operator","Concepts/Math/Calculus/Derivatives/Multivariable/Partial-Derivatives","Concepts/Science/Physics/Electricity-and-Magnetism/Magnetic-Field","Concepts/Math/Calculus/Integrals/Multivariable/Stokes'-Theorem","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics/em"],"content":"Maxwell-Faraday Equation\nTopic: Electromagnetism\nFaraday’s Law of Induction can be extended into the Maxwell-Faraday Equation, which states that a changing Magnetic Flux produces an Electric Field. The mathematical relation is \\oint \\vec{\\textbf{E}} \\cdot d \\vec{\\ell} = - \\frac{d\\Phi_{B}}{dt}\nwhere \\vec{\\textbf{E}} is the Electric Field and \\Phi_{B} is the Magnetic Flux. For evaluating this, see Line Integrals.\nDifferential Interpretation\nThis can also be written as \\nabla \\times \\vec{\\textbf{E}} = - \\frac{\\partial \\vec{\\textbf{B}}}{\\partial t}\nwhere \\nabla \\times \\vec{\\textbf{E}} represents the Curl of the Electrical Fields and those are Partial Derivatives of the Magnetic Field. You can go from one form to the other by Stokes’ Theorem.\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 29"},"Concepts/Science/Physics/Electricity-and-Magnetism/Ohms-Law":{"title":"Ohms Law","links":["Concepts/Science/Physics/Electricity-and-Magnetism/Resistance","Concepts/Science/Physics/Electricity-and-Magnetism/Current","Concepts/Science/Physics/Energy/Ampere","Concepts/Science/Physics/Electricity-and-Magnetism/Voltage","Concepts/Science/Physics/Electricity-and-Magnetism/Volt"],"tags":["science/physics/em"],"content":"Ohms Law\n\n\n                  \n                  Ohm&#039;s Law \n                  \n                \n\nCurrent, or amperage (I), in a circuit is equal to the voltage (V) in the circuit divided by the resistance (R) of the circuit. I = \\frac{V}{R} \\to V = IR \\to R = \\frac{V}{I}\nResistance is measured in ohms (\\ohm) Current in Amps (A) and Voltage in volts (V).\n\n\n\n\n                  \n                  Equivalence in Water \n                  \n                \n\nConsider a pipe with water flowing through it. Think of current as the water flow rate, the voltage as the potential energy due to height, and the resistance as the width of a pipe. It makes sense that for more water to flow (I_{f} &gt; I_{0}) either the resistance must decrease (R_{f} &lt; R_{0}) or the energy must increase to push it harder (V_{f} &gt; V_{0}).\n\n"},"Concepts/Science/Physics/Electricity-and-Magnetism/Potential-Due-to-Any-Charge-Distribution":{"title":"Potential Due to Any Charge Distribution","links":["Electromagnetism","Concepts/Science/Physics/Electricity-and-Magnetism/Electric-Potential-Due-To-A-Point-Charge","Concepts/Science/Physics/Electricity-and-Magnetism/Charge","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics/em"],"content":"Potential Due to Any Charge Distribution\nTopic: Electromagnetism\nThe Electric Potential Due To A Point Charge is given by\nV = \\frac{1}{4\\pi \\epsilon_{0}} \\frac{Q}{r}\nA Charge distribution is then given by summing over all the charges. Using a limiting approach, this yields, for a continuous distribution,\nV = \\frac{1}{4\\pi \\epsilon_{0}} \\int\\limits_{}^{}{\\frac{dq}{r}} \nExamples\n\n\n                  \n                  Potential Difference Due to a Ring of Charge \n                  \n                \n\nA thin circular ring of radius R has a uniformly distributed charge Q. Determine the electrical potential at a point P along the axis of the ring at a distance x from its center.\nSolution:\nWe simply integrate over the ring using the above equation. Each point on the ring is equidistant from P, and that distance is r = (x^{2} + R^{2})^{\\frac{1}{2}}:\nV = \\frac{1}{4\\pi \\epsilon_{0}} \\int\\limits_{}^{}{\\frac{dq}{r}} = \\frac{1}{4\\pi \\epsilon_{0}} \\frac{Q}{(x^{2} + R^{2})^{\\frac{1}{2}}}\n\n\n”\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 23-4"},"Concepts/Science/Physics/Electricity-and-Magnetism/Resistance":{"title":"Resistance","links":["Concepts/Science/Physics/Electricity-and-Magnetism/Circuits/Circuit","Concepts/Science/Physics/Electricity-and-Magnetism/Ohms-Law","Concepts/Science/Physics/Quantum-Mechanics/Electrons","Concepts/Science/Physics/Electricity-and-Magnetism/Resistivity","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics/em"],"content":"Resistance\nAny Circuit component that hinders the flow of charge is called a resistor.\nThe ability to hinder the flow of charge is called resistance, and is measured in Ohms (\\ohm) (see Ohms Law).\nWhen electricity is flowing through a wire, the length of the wire is proportional to the resistance. The thickness of the wire also impacts the amount of resistance. The thinner wire will offer more resistance than a thicker wire due to the decreased numbers of Electrons in the thinner wire. The relationship between resistance and the area of the cross section or a wire is inversely proportional. Mathematically, this becomes\nR = \\rho \\frac{\\ell}{A}\nwhere \\ell is the thickness of the wire, A is the cross-sectional area, and \\rho is the Resistivity.\nA resistor can be compared to a coffee filter hindering the flow of coffee water.\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 25"},"Concepts/Science/Physics/Electricity-and-Magnetism/Resistivity":{"title":"Resistivity","links":["Electromagnetism","Concepts/Science/Physics/Materials/Materials","Concepts/Science/Physics/Electricity-and-Magnetism/Resistance","Concepts/Science/Physics/Thermodynamics/Temperature","Concepts/Science/Physics/Electricity-and-Magnetism/Electrical-Conductors","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics/em"],"content":"Resistivity\nTopic: Electromagnetism\nThe resistivity (\\rho) is a material property that determines how much Resistance (\\Omega) it generates per unit distance (\\text{m}). It makes sense, then, that the units are [\\rho] = [\\Omega \\cdot \\text{m}].\nWhat this means is that a wire of a high resistivity material impedes the flow of electricity a lot, whereas one with a low value allows electricity to flow easily. Generally, the values depend on Temperature, heat treatment, and other factors.\nCopper has a value of \\rho = 1.68 \\times 10^{-8} \\text{ }\\Omega\\cdot\\text{m}.\nEach material also has a resistivity temperature coefficient \\alpha. The resistance of metals increases with temperature by \\rho_{T} = \\rho_{0}[1 + \\alpha(T - T_{0})]\n\n\n                  \n                  Relationship between Resistivity and Conductivity \n                  \n                \n\nThe reciprocal of the resistivity gives the conductivity of the material: \\sigma = \\frac{1}{\\rho}\n\n\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 25-4"},"Concepts/Science/Physics/Electricity-and-Magnetism/Solenoid":{"title":"Solenoid","links":["Electromagnetism","Concepts/Science/Physics/Electricity-and-Magnetism/Magnetic-Field","Concepts/Science/Physics/Electricity-and-Magnetism/Current","Concepts/Science/Physics/Electricity-and-Magnetism/Vacuum-Magnetic-Permeability","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics/em"],"content":"Solenoid\nTopic: Electromagnetism\nA solenoid is an electrical component consisting of many tightly wound wires. The Magnetic Field inside a solenoid is constant, and given by: B = \\mu_{0} n I\nwhere n is the number of loops per unit length, I is the Current, and \\mu_{0} is the magnetic constant.\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 28"},"Concepts/Science/Physics/Electricity-and-Magnetism/Terminal-Voltage":{"title":"Terminal Voltage","links":["Electromagnetism","Concepts/Science/Physics/Electricity-and-Magnetism/Voltage","Concepts/Science/Physics/Electricity-and-Magnetism/Electric-Battery","Concepts/Science/Physics/Electricity-and-Magnetism/Current","Concepts/Science/Physics/Electricity-and-Magnetism/EMF","Concepts/Science/Physics/Electricity-and-Magnetism/Resistance","Concepts/Science/Physics/Electricity-and-Magnetism/Circuits/Resistors-in-Series","Concepts/Science/Physics/Energy/Power","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics/em"],"content":"Terminal Voltage\nTopic: Electromagnetism\nThe terminal voltage is the Voltage measured across the two terminals of a Electric Battery, V_{ab} = V_{a} - V_{b}. When no Current is drawn from the battery, V_{ab} = \\mathscr{E}, where \\mathscr{E} is the EMF. When a Current I flows from the battery, there is a drop given by:\nV_{ab} = \\mathscr{E} - Ir\n\n\n                  \n                  Battery with Internal Resistance \n                  \n                \n\nA 65.0\\text{-}\\ohm resistor is connected to the terminals of a battery whose EMF is 12.0 \\text{ V} and whose internal Resistance is 0.5 \\text{ }\\ohm. Calculate (a) the current in the circuit, (b) the terminal voltage V_{ab}, and (c) the power dissipated in the resistor R and in the battery’s internal resistance r.\nSolution:\n(a) These are Resistors in Series, so the total resistance is R + r. The current is then I = \\frac{\\mathscr{E}}{R+r} = \\frac{12.0 \\text{ V}}{65.5 \\text{ } \\ohm} = 0.183 \\text{ A}.\n(b) The terminal voltage is V_{ab} = \\mathscr{E} - Ir = 12.0 \\text{ V} - (0.183 \\text{ A})(0.5 \\text{ }\\ohm) = 11.9 \\text{ V}\n(c) The Power dissipated in R is I^{2}R = 2.18 \\text{ W} and in r is I^{2}r = 0.02 \\text{ W}.\n\n\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 26"},"Concepts/Science/Physics/Electricity-and-Magnetism/Tesla":{"title":"Tesla","links":["Electromagnetism","Concepts/Science/Physics/Electricity-and-Magnetism/Magnetic-Field","Concepts/Science/Physics/Energy/Ampere","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics/em"],"content":"Tesla\nTopic: Electromagnetism\nThe Tesla is the unit of the Magnetic Field, and is defined as 1 \\text{ T} = 1 \\text{ N/A} \\cdot \\text{m}\n(1 Newton per Ampere meter)\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 27"},"Concepts/Science/Physics/Electricity-and-Magnetism/Torque-on-a-Current-Loop-in-a-Magnetic-Field":{"title":"Torque on a Current Loop in a Magnetic Field","links":["Electromagnetism","torque","Concepts/Science/Physics/Electricity-and-Magnetism/Current","Concepts/Science/Physics/Electricity-and-Magnetism/Dipoles","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics/em"],"content":"Torque on a Current Loop in a Magnetic Field\nTopic: Electromagnetism\nThe torque on a Current loop (in a uniform magnetic field) is then \\vec{\\tau} = \\vec{\\mu} \\times \\vec{\\textbf{B}}\nThis is reminiscent of electric Dipoles. We can, just like electric dipoles, define a type of potential energy for a magnetic dipole in a magnetic field, which is: U = - \\vec{\\mu} \\times \\vec{\\textbf{B}}; \\quad U\\left(\\frac{\\pi}{2}\\right) = 0\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 27"},"Concepts/Science/Physics/Electricity-and-Magnetism/Transformers":{"title":"Transformers","links":["Electromagnetism","Concepts/Science/Physics/Electricity-and-Magnetism/Circuits/Alternating-Current","Concepts/Science/Physics/Electricity-and-Magnetism/Current","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics/em"],"content":"Transformers\nTopic: Electromagnetism\nA transformer is a device which changes the magnitude of an Alternating Current’s voltage. It consists of a primary coil of N_{P} loops of wire and a secondary coil of N_{S} loops. The changing flux due to an Alternating Current voltage in the primary coil induces an AC voltage in the secondary coil. In a theoretical 100% efficient transformer, the ratio of output to input voltages (V_{S}/V_{P}) is equals to the ratio of number of turns N_{S} to N_{P}: \\frac{V_{S}}{V_{P}} = \\frac{N_{S}}{N_{P}}\nThe ratio of the Current is in the inverse: \\frac{I_{S}}{I_{P}}= \\frac{N_{P}}{N_{S}}\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 29"},"Concepts/Science/Physics/Electricity-and-Magnetism/Vacuum-Magnetic-Permeability":{"title":"Vacuum Magnetic Permeability","links":["Electromagnetism","Concepts/Science/Physics/Electricity-and-Magnetism/Magnetic-Field-of-a-Moving-Point-Charge","Concepts/Science/Physics/Electricity-and-Magnetism/Tesla","Concepts/Science/Physics/Energy/Ampere","Permittivity-of-Free-Space","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics/em"],"content":"Vacuum Magnetic Permeability\nTopic: Electromagnetism\nThe vacuum magnetic permeability is a physical constant that is used in the Magnetic Field of a Moving Point Charge. It is given by \\mu_{0} = 4 \\pi \\times 10^{-7} \\text{(T m)/A}\nwhere T is Tesla, m is meters, and A is Ampere.\nIt is related to the Permittivity of Free Space.\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 28"},"Concepts/Science/Physics/Electricity-and-Magnetism/Volt":{"title":"Volt","links":["Electromagnetism","Alessandro-Volta","Concepts/Science/Physics/Electricity-and-Magnetism/Voltage","Concepts/Science/Physics/Energy/Joules","Concepts/Science/Physics/Electricity-and-Magnetism/Coulomb","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics/em"],"content":"Volt\nTopic: Electromagnetism\nNamed in honor of Alessandro Volta, the Volt is the unit for Potential Difference. It is defined as\n1 \\text{ V} = 1 \\text{ J/C}\nwhere J is Joules and C is Coulomb.\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 23-1"},"Concepts/Science/Physics/Electricity-and-Magnetism/Voltage":{"title":"Voltage","links":["Electromagnetism","Concepts/Science/Physics/Electricity-and-Magnetism/Electric-Potential-Energy","Concepts/Science/Physics/Electricity-and-Magnetism/Charge","Concepts/Science/Physics/Electricity-and-Magnetism/Electrical-Fields","Concepts/Science/Physics/Electricity-and-Magnetism/Volt","School-Notes/Archives/Physics/Newtons-Laws-of-Motion","Concepts/Science/Physics/Energy/Conservation-of-Energy","Concepts/Math/Linear-Algebra/Vectors/Vector-Dot-Products","Concepts/Math/Calculus/Integrals/Multivariable/Line-Integral","Concepts/Science/Physics/Electricity-and-Magnetism/Electric-Field-Determined-from-Voltage","Concepts/Science/Physics/Electricity-and-Magnetism/Circuits/Capacitors","Concepts/Science/Physics/Electricity-and-Magnetism/Electric-Potential-Due-To-A-Point-Charge","Concepts/Science/Physics/Electricity-and-Magnetism/Potential-Due-to-Any-Charge-Distribution","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics/em"],"content":"Voltage\nTopic: Electromagnetism\n\nThe Electric Potential Energy per unit Charge.\n\nIf we put a tiny positive test charge q in a uniform Electric Field, it have some amount of electric potential energy U_{a} at some arbitrary point a relative to some zero. Then, the electric potential V_{a} at this point is defined as\nV_{a} = \\frac{U_{a}}{q} \nThis gives us the potential difference between point a and the zero, b.\nThe unit is the Volt.\n\n\n                  \n                  Comparison to Mechanics \n                  \n                \n\nIn Electromagnetism, many of our concepts have equivalents to Newtons Laws of Motion. Voltage has a mechanical analog of force, F. It can be thought of as voltage representing the amount of force required to hold a charge, much like a normal force holds a mass.\n\n\nElectric Potential and the Electric Field\nThe potential difference can be derived from the Conservation of Energy as\n\\Delta V = V_{ba} = V_{b} - V_{a} = - \\int\\limits_{a}^{b}{\\vec{\\textbf{E}}\\cdot d\\vec{\\ell}}\nNotice that is the Vector Dot Products between the electric field and some infinitesimal displacement d \\vec{\\ell}. That makes this a Line Integral. \nWe can go the opposite direction, as well: Electric Field Determined from Voltage.\nSpecific Cases\nTransclude of Capacitors#^8bdbf4\nTransclude of Electric-Potential-Due-To-A-Point-Charge#^79d358\nBuilding on this point charge example, we can find the Potential Due to Any Charge Distribution.\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 23-1"},"Concepts/Science/Physics/Electricity-and-Magnetism/Weber-Unit":{"title":"Weber Unit","links":["Electromagnetism","Concepts/Science/Physics/Electricity-and-Magnetism/Magnetic-Flux","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics","science/physics/em"],"content":"Weber Unit\nTopic: Electromagnetism\nWeber Unit\nThe weber unit is the unit of Magnetic Flux. It is given by 1 \\text{ Wb} = 1 \\text{ V} \\cdot \\text{s}\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 29"},"Concepts/Science/Physics/Energy/Ampere":{"title":"Ampere","links":["Concepts/Science/Physics/Energy/Energy","Concepts/Science/Physics/Electricity-and-Magnetism/Charge","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics/energy"],"content":"Ampere\nTopic: Energy\nThe Ampere is the unit of Electrical Charge.\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics: Chapter null"},"Concepts/Science/Physics/Energy/Conservation-of-Energy":{"title":"Conservation of Energy","links":["Concepts/Science/Physics/Energy/Energy","Concepts/Science/Physics/Energy/Conservative-Forces"],"tags":["science/physics"],"content":"Conservation of Energy\nTopic: Energy\n\n\n                  \n                  Law of Conservation of Energy \n                  \n                \n\nEnergy can neither be created nor destroyed, only converted from one form of energy to another.\n\n\nE_{total}=K_{E} + P_{E} + Q\nThe total energy within a closed system is equal to the sum of the kinetic energy, potential energy, and internal/thermal energy. Alternatively, it could be stated that:\nW_{net} = W_{conservative} + W_{non-conservative}\nConservation of Mechanical Energy\n\n\n                  \n                  Conservation of Mechanical Energy \n                  \n                \n\nIf only Conservative Forces act, then the total mechanical energy of a system is conserved.\n\n\nProof\nk = \\frac{1}{2}mv^{2} =&gt; W_{net}=\\Delta K\n\\text{Potential Energy }  U =&gt; \\Delta U = -W_{conservative}\nThus, if only conservative forces act:\n\\begin{aligned}\n\\Delta K &amp;= -\\Delta U \\\\\nK_{f} - K_{i} &amp;= U_{i} - U_{f}\\\\\nU_{i} + K_{i} &amp;= U_{f} + K_{f} \\\\\nE_{i} &amp;= E_{f} \n\\end{aligned}\n\n\n                  \n                  Sample Problem \n                  \n                \n\nA roller coast includes a vertical drop of 59.4 meters. If the speed at the crest is 0 and no friction is present, what would be the speed of the roller coaster at the bottom of the drop?\nE_{total} = (PE+KE)_{top} = (PE + KE)_{bottom}\nSince there is no kinetic energy at the top and no potential energy at the ground, we conclude that:\nPE_{top} = KE_{bottom}\nTherefore:\n(mgh)_{top} = (\\frac{1}{2}mv^{2})_{bottom}\ngh = \\frac{1}{2}v^2 \\to v = \\sqrt{2gh} = \\sqrt{(2)(-9.81 m/s^2)(-59.4)} = 34.138 m/s\nThe speed at the bottom is 34.1 meters per second.\n\n\n\nReferences"},"Concepts/Science/Physics/Energy/Conservative-Forces":{"title":"Conservative Forces","links":["Concepts/Science/Physics/Energy/Energy","Concepts/Science/Physics/Newtonian-Mechanics/Newtons-Law-of-Gravity","Concepts/Science/Physics/Materials/Hookes-Law","Concepts/Science/Physics/Energy/Elastic-Potential-Energy","Concepts/Science/Physics/Electricity-and-Magnetism/Electric-Potential-Energy","Concepts/Math/Calculus/Integrals/Multivariable/Vector-Fields","Concepts/Math/Calculus/Derivatives/Multivariable/Curl-Operator","Concepts/Math/Proofs/Simply-Connected-Regions","Concepts/Math/Calculus/Derivatives/Multivariable/Gradient-Field","Concepts/Math/Calculus/Integrals/Multivariable/Greens-Theorem"],"tags":["science/physics"],"content":"Conservative Forces\nTopic: Energy\nA force is conservative if:\n\nThe work done by moving an object from an initial to final position is independent of the path taken\nThe work done by the force is 0 in a round trip\n\nIn other words, a conservative force can only be written as a function of position.\nThe three most common conservative forces in elementary physics are:\n\nNewtons Law of Gravity\nHookes Law (Elastic Potential Energy)\nElectric Potential Energy\n\nHow To Tell if a Force is Conservative\nIf a force is given by a Vector Field \\vec{\\textbf{F}}, and if curl(\\vec{\\textbf{F}}) = 0 and the domain where \\vec{\\textbf{F}} is defined is simply connected, then \\vec{\\textbf{F}} is conservative and is a Gradient Field and you can apply Greens Theorem.\n\nReferences"},"Concepts/Science/Physics/Energy/Elastic-Potential-Energy":{"title":"Elastic Potential Energy","links":[],"tags":["science/physics"],"content":"Elastic Potential Energy\nThe work done on a spring is the area under the Force versus Elongation curve. This also equals the change in elastic potential of the system (EPE). Since a Force versus Elongation curve is linear, the area under it is a triangle, and the area of a triangle is \\frac{1}{2}(base)(height), so  the elastic potential energy is:\nEPE = \\frac{1}{2}(F \\Delta x) = \\frac{1}{2}(k\\Delta x^2)"},"Concepts/Science/Physics/Energy/Energy":{"title":"Energy","links":["Concepts/Science/Physics/Energy/Potential-Energy","Concepts/Science/Physics/Energy/Kinetic-Energy"],"tags":["science/physics","science/chemistry"],"content":"Energy\nEnergy is the ability to cause change or the ability to do work and is measured in the SI unit Joules. All forms of energy can be measured in a unit called Joule.\n1 \\text{ J} = \\frac{\\text{ kg} \\cdot \\text{m}}{^2}{\\text{ s}^{2}}\n1 calorie = 4.186 Joules\n1 Kilocalorie = 4186 Joules\nWork is the process of causing matter to move against an opposing force. When matter moves, it is changing position, and that requires energy.\nAll forms of energy can be classified as either potential or kinetic energy.\nPotential Energy\nTransclude of Potential-Energy\nKinetic Energy\nTransclude of Kinetic-Energy#kinetic-energy"},"Concepts/Science/Physics/Energy/Heating-and-Cooling-Curves":{"title":"Heating and Cooling Curves","links":["Concepts/Science/Physics/Thermodynamics/Temperature","Concepts/Science/Chemistry/Phase-Changes","temperature"],"tags":["science/physics"],"content":"Heating and Cooling Curves\nTemperature changes and phase transistions over time are modeled by heating curves and cooling curves. They both show the relationship between the temperature of the substance (plotted on the vertical axis), and the time that has passed (plotted on the horizontal axis).\nA heating curve shows constant heating, with particles gaining energy and phase transitions from solid to liquid or liquid to gas.\nA cooling curve shows constant cooling, with particles losing energy and phase transitions from gas down to solid.\nThe curves often have horizontal lines to show the phase transition over time.\nSample Heating Curve\n\nSample Cooling Curve\n\n"},"Concepts/Science/Physics/Energy/Joules":{"title":"Joules","links":["Concepts/Science/Physics/Energy/Energy","Concepts/Science/Physics/Energy/Work","James-Prescott-Joule"],"tags":["science/physics/energy"],"content":"Joules\nTopic: Energy\nThe Joule is the SI unit for energy and Work, named after James Prescott Joule. A Joule is defined as 1 Newton Meter. That means that a Joule is the work done when a force of 1 Newton displaces a mass through a distance of 1 meter in the direction of the force. It can alternatively be described as:\n\n1 Watt/second\n\\frac{\\text{kg} \\times \\text{m}^{2}}{\\text{s}^{2}}\n\n\nReferences"},"Concepts/Science/Physics/Energy/Kinetic-Energy":{"title":"Kinetic Energy","links":["Concepts/Science/Physics/Energy/Energy","Concepts/Science/Physics/Newtonian-Mechanics/Mass","Concepts/Science/Physics/Newtonian-Mechanics/Velocity","Concepts/Science/Physics/Energy/Joules","Concepts/Science/Physics/Angular-Motion/Angular-Motion","Concepts/Science/Physics/Angular-Motion/Moment-of-Inertia","Concepts/Science/Physics/Angular-Motion/Angular-Velocity"],"tags":["science/physics/energy"],"content":"Kinetic Energy\nTopic: Energy\nKinetic energy is the energy which a particle has a result of its movement. Kinetic energy is generally defined by the formula\nk = \\frac{1}{2}mv^{2}\nwhere m is the Mass of the object, v is the Velocity, and k is the kinetic energy, measured in Joules.\nAngular Motion\nWhen angular motion is involved as well as translational, you must account for the energy that is spent rotating the object. As such, the formula becomes\nK = \\frac{1}{2}mv^{2} + \\frac{1}{2}I_{cm} \\omega^{2}\nk is the kinetic energy, measured in Joules, m is the Mass of the object, v is the Velocity, I_{cm} is the Moment of Inertia, and \\omega is the Angular Velocity.\n\nReferences"},"Concepts/Science/Physics/Energy/Potential-Energy":{"title":"Potential Energy","links":["Concepts/Science/Physics/Energy/Energy","Concepts/Science/Physics/Energy/Conservative-Forces","School-Notes/Archives/Calculus-Based-Physics-I/Calculus-Based-Physics","Concepts/Science/Physics/Newtonian-Mechanics/Mass","Concepts/Science/Physics/Newtonian-Mechanics/Newtons-Law-of-Gravity","Concepts/Science/Physics/Materials/Spring-Constant","Concepts/Science/Physics/Energy/Conservation-of-Energy","School-Notes/Archives/Physics/Unit-4/Physics-04.03"],"tags":["science/physics"],"content":"Potential Energy\nTopic: Energy\nPotential energy (U) is:\n\nstored energy\ncan only be defined for Conservative Forces\nDefined for a system of two objects\n\ne.g. holding up a pen increases the potential energy of the earth-pen system; this is normally omitted for brevity\n\n\n\nThe two most common examples of potential energy in Calculus-Based Physics are:\n\nGravitational Potential Energy: U_{grav} = mgy where m is the Mass, y is the height from some specific reference point, and g is the acceleration due to gravity.\nElastic Potential Energy: U_{s}=\\frac{1}{2}kx^{2}, where k is a Spring Constant and x is the distance which the spring is compressed.\n\nChange in Potential Energy\nConservation of Energy\nGravitational Potential Energy\nPotential energy due to the elevated position of an object is called gravitational potential energy (GPE). It is the focus of Physics 04.03.\nThe GPE of an object depends on the mass and height of the object, as well as the gravitational acceleration.\nGPE = mgh\n\nReferences"},"Concepts/Science/Physics/Energy/Power":{"title":"Power","links":["Concepts/Science/Physics/Energy/Energy","Concepts/Science/Physics/Electricity-and-Magnetism/Circuits/Circuit","Concepts/Science/Physics/Electricity-and-Magnetism/Voltage","Concepts/Science/Physics/Electricity-and-Magnetism/Current","Concepts/Science/Physics/Electricity-and-Magnetism/Ohms-Law","Concepts/Science/Physics/Electricity-and-Magnetism/Energy-Stored-in-a-Capacitor","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics"],"content":"Power\nTopic: Energy\nPower is defined as the energy over time, and is measured in Watts or Horsepower.\n1 \\text{ W} = 1 \\text{ J/s}\nPower in a Circuit is given by P = \\frac{dq}{dt}V = IV = I^{2}R = \\frac{V^{2}}{R}\nwhere V is Voltage and I is Current. This resembles Ohms Law and the Energy Stored in a Capacitor but is different.\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 25-5"},"Concepts/Science/Physics/Energy/Work-Energy-Theorem":{"title":"Work Energy Theorem","links":["Concepts/Science/Physics/Energy/Energy","Concepts/Science/Physics/Energy/Work","Concepts/Science/Physics/Energy/Kinetic-Energy"],"tags":["science/physics"],"content":"Work Energy Theorem\nTopic: Energy\nThe work energy theorem relates Work to Kinetic Energy. Specifically, it states that the work done by the sum of all forces acting on an object is equal to the change in the kinetic energy of that object:\nW = \\Delta K.\n\nReferences"},"Concepts/Science/Physics/Energy/Work":{"title":"Work","links":["Concepts/Science/Physics/Energy/Work-Energy-Theorem","Concepts/Science/Physics/Energy/Power"],"tags":["science/physics","math/calculus"],"content":"Work\nWork is the application of energy. The standard equation for work is:\nW = Fd\nwhere W = the work done, measured in J, F = the applied constant force, measured in newtons, and d = the displacement the object moves in the direction of the force, measured in meters.\nWork is the area under a Force versus Displacement Graph.\nWork is equal to the change in kinetic energy: Work Energy Theorem\nIntegral\nWork is much better expressed as an integral.\nW = \\int\\limits_{a}^{b}{(F(x))dx}\nWhere F(x) is the force at a distance. This is important when the force varies over distance. In physics, this might be written as:\nW = \\int\\limits_{a}^{b}{\\vec{\\textbf{F}} \\cdot d\\vec{l}}\nPower\nThe rate at which work is done is called Power.\nOther Units\n\nFoot pound: The work accomplished when a one pound force pushes something through a distance of one foot.\nHorsepower: a unit of measurement for power, 1 hp = 550 ft * lb/s = 746 Watts. 4\n"},"Concepts/Science/Physics/Fluid-Dynamics/Absolute-Pressure":{"title":"Absolute Pressure","links":["Concepts/Science/Physics/Fluid-Dynamics/Fluids","Concepts/Science/Physics/Fluid-Dynamics/Hydrostatic-Pressure"],"tags":["science","flashcards"],"content":"Absolute Pressure\nTopic: Fluids\nWhat is absolute pressure? :?: Absolute pressure is the total net pressure, P = P_{0} + P_{g} \\to \\text{Pressure} = \\text{External Pressure + Gauge Pressure}\n\nAbsolute pressure is what is typically used in equations, such as the Hydrostatic Equation, so you’ll have to convert.\n\nReferences"},"Concepts/Science/Physics/Fluid-Dynamics/Bernoulli's-Equation":{"title":"Bernoulli's Equation","links":["Fluid-Dynamics","Concepts/Science/Physics/Fluid-Dynamics/Absolute-Pressure","Concepts/Science/Physics/Materials/Density","Concepts/Science/Physics/Newtonian-Mechanics/Velocity","Concepts/Science/Physics/Energy/Conservation-of-Energy","Concepts/Science/Physics/Energy/Work","Concepts/Science/Physics/Energy/Kinetic-Energy","Concepts/Science/Physics/Energy/Potential-Energy","Concepts/Science/Physics/Newtonian-Mechanics/Newtons-Law-of-Gravity"],"tags":["science/physics/fluids"],"content":"Bernoulli’s Equation\nTopic: Fluid Dynamics\nP_{1} + \\frac{1}{2} \\rho v_{1}^{2} + \\rho g h_{1} = P_{2} + \\frac{1}{2} \\rho v_{2}^{2} + \\rho g h\nWhere P is Absolute Pressure, \\rho is Density, v is Velocity, and h is the height of the fluid at each point.\nThis equation comes from the Conservation of Energy. If you add up all the forms of energy that the liquid at any point has, it has to be constant.\n\nThe first term comes from pressure and volume being able to do Work\nThe second term comes from the Kinetic Energy of the liquid. This is called the kinetic energy density\nThe third term comes from the Potential Energy due to Newtons Law of Gravity\n\n"},"Concepts/Science/Physics/Fluid-Dynamics/Bernoulli's-Principle":{"title":"Bernoulli's Principle ","links":["Concepts/Science/Physics/Fluid-Dynamics/Fluids","Concepts/Science/Physics/Fluid-Dynamics/Equation-of-Continuity","Concepts/Science/Physics/Fluid-Dynamics/Bernoulli's-Equation","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics"],"content":"Topic: Fluids\nBernoulli’s Principle\nFluid velocity and pressure are inverse. Therefore if a liquid is moving faster, it exhibits less pressure on the walls of the pipe. This, along with the Application, gives an interesting idea: narrower, faster flowing pipes put less pressure on the pipe.\nSee also Bernoulli’s Equation.\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 13"},"Concepts/Science/Physics/Fluid-Dynamics/Buoyancy":{"title":"Buoyancy","links":["Concepts/Science/Physics/Newtonian-Mechanics/Weight","Concepts/Science/Physics/Fluid-Dynamics/Fluids","Concepts/Science/Physics/Materials/Density"],"tags":["science/physics"],"content":"Buoyancy\n\nthe buoyant force on a submerged object is equal to the Weight of the displaced fluid\n\nWhen an object is placed into the water, it displaces water equal to its volume. The weight of that water is called the buoyancy.\nF_{b}= \\rho g V\nAn object is neutrally buoyant when the force of gravity = the force of buoyancy. This occurs when the Density of the object is equal to the Density of the water.\nA object is negatively buoyant when gravity is stronger than buoyant force. The opposite is true for positive buoyancy."},"Concepts/Science/Physics/Fluid-Dynamics/Computational-Fluid-Dynamics":{"title":"Computational Fluid Dynamics","links":["Fluid-Dynamics"],"tags":["science/physics/fluids"],"content":"Computational Fluid Dynamics\nTopic: Fluid Dynamics\nThe study of Fluid Dynamics using computers.\n\nReferences"},"Concepts/Science/Physics/Fluid-Dynamics/Critical-Temperature":{"title":"Critical Temperature","links":["Concepts/Science/Physics/Fluid-Dynamics/Fluids","Concepts/Science/Chemistry/Phase-Changes","temperature","Concepts/Science/Physics/Fluid-Dynamics/Ideal-Gas","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics"],"content":"Critical Temperature\nTopic: Fluids\nAt different pressures, volumes, and temperatures, a substance may or may not undergo Phase Changes. There exists a combination of pressure and temperature for each substance such that it a Gas barely transforms into a liquid, called the critical point. The temperature of this value is called the critical temperature.\nIn the following diagram, point c represents the critical point.\n\n\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 18"},"Concepts/Science/Physics/Fluid-Dynamics/Equation-of-Continuity":{"title":"Equation of Continuity","links":["Concepts/Science/Physics/Fluid-Dynamics/Fluids","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics"],"content":"Equation of Continuity\nTopic: Fluids\nThe equation of continuity for fluids relates the rate of flow at one point to another, stating that they must be equal across the fluid. This is applied in narrowing or widening pipes, for example.\n\\rho_{1}v_{1}A_{1} = \\rho_{2}v_{2}A_{2}\n\\rho is density, v is velocity, and A is cross-sectional area.\nConceptual\nIf you have a certain amount of liquid flowing through a cross-section of a pipe in a certain period of time you can imagine that liquid is pushing on all the other water further down the pipe. Therefore the rate at which the liquid is passing through must be equal everywhere.\nApplication\nIn areas where the area is narrower, it will have to move faster.\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 13"},"Concepts/Science/Physics/Fluid-Dynamics/Fluids":{"title":"Fluids","links":["Concepts/Science/Physics/Fluid-Dynamics/Pressure","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["topic","science/physics","flashcards"],"content":"Fluids\nWhat is a fluid? :?: Something that flows, including gases, liquids, and plasmas.\n\nWhat causes Pressure in a fluid? :?: The weight of the fluid and the collisions of the molecules.\n\nSubtopics\ntable without id file.inlinks\nwhere file.name = this.file.name\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 13"},"Concepts/Science/Physics/Fluid-Dynamics/Gauge-Pressure":{"title":"Gauge Pressure","links":["Concepts/Science/Physics/Fluid-Dynamics/Fluids","Concepts/Science/Physics/Fluid-Dynamics/Pressure"],"tags":["science/physics","flashcards"],"content":"Gauge Pressure\nTopic: Fluids\nWhat is gauge pressure? :?: Pressure relative to some reference value, e.g. 1 atm, as measured by a gauge. For example, when pumping up tires, the scale will read 0 when it is not attached to a tire even though it is under 1 atmosphere of pressure, because that is how the gauge is calibrated.\n\n\nReferences"},"Concepts/Science/Physics/Fluid-Dynamics/Hydraulics":{"title":"Hydraulics","links":["Concepts/Science/Physics/Fluid-Dynamics/Fluids","Concepts/Science/Physics/Fluid-Dynamics/Pascals-Principle","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics"],"content":"Hydraulics\nTopic: Fluids\nHydraulics rely on Pascals Principle to give mechanical advantage in some way. For example, you might lift a car using a hydraulic lift that functions by putting some force on one piston with a small area that lifts a much larger piston by a smaller amount.\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 13"},"Concepts/Science/Physics/Fluid-Dynamics/Hydrostatic-Pressure":{"title":"Hydrostatic Pressure","links":["Concepts/Science/Physics/Fluid-Dynamics/Fluids","Concepts/Science/Physics/Fluid-Dynamics/Absolute-Pressure","Concepts/Science/Physics/Fluid-Dynamics/Gauge-Pressure","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["flashcards","science"],"content":"Hydrostatic Pressure\nTopic: Fluids\nHydrostatic pressure is the pressure in a fluid at rest.\nWhat does hydrostatic mean? :?: Fluid at rest.\n\nHydrostatic Equation\nP = P_{0} + \\rho gh\n\\text{Pressure = External Pressure + density * gravity * height or depth}\nNote that this is Absolute Pressure, not Gauge Pressure.\nHorizontal Line Property\nAcross a horizontal line, the pressure in a continuous fluid is equal.\n\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 13"},"Concepts/Science/Physics/Fluid-Dynamics/Ideal-Gas-Law":{"title":"Ideal Gas Law","links":["Concepts/Science/Physics/Fluid-Dynamics/Fluids","Concepts/Science/Physics/Fluid-Dynamics/Ideal-Gas","Concepts/Science/Physics/Thermodynamics/Temperature","Concepts/Science/Physics/Fluid-Dynamics/Pressure","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/chemistry","science/physics"],"content":"Ideal Gas Law\nTopic: Fluids\nThe Ideal Gas law is an idealized relationship between the Temperature, Pressure, quantity, and volume of a gas:\nPV = nRT,\nwhere n represents the number of moles and R = 8.314 \\text{ J/(mol * K)} is the universal gas constant. \n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 17-6"},"Concepts/Science/Physics/Fluid-Dynamics/Ideal-Gas":{"title":"Ideal Gas","links":["Concepts/Science/Physics/Fluid-Dynamics/Fluids","Concepts/Science/Physics/Fluid-Dynamics/Ideal-Gas-Law","temperature","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics"],"content":"Ideal Gas\nTopic: Fluids\nAn ideal gas is a gas which obeys the Ideal Gas Law. Specifically, it is a gas which we make certain assumptions about so that we can more accurately and reliably model it using kinetic theory. The assumptions are:\n\nThere are a large number of molecules, N, each of mass m, moving in random directions with a variety of speeds\nThe molecules are, on average, separated by an amount much greater than the diameter of each molecule\nMolecules obey the laws of classical mechanics, and interact only in collisions; attractive forces are negligible\nCollisions are assumed to be perfectly elastic and of very short duration\n\nUnder these assumptions, we can do some pretty interesting physics to derive a relationship between the kinetic energy and the temperature of a gas.\nConsider a container with a side of area A. It is filled with a gas of N molecules, each mass m. Consider a single molecule of that gas, with an initial velocity \\vec{v} = v_{x}. It collides with the wall, creating a perfectly elastic collision and bouncing back with a velocity of - v_{x}. The wall therefore must exert a force of F = \\frac{dP}{dt} = \\frac{2mv_{x}}{dt} on the molecule. The molecule bounces back, hits the other wall, and then returns travelling a total distance of 2 \\ell over a time v_{x}\\Delta t \\to \\Delta t = \\frac{2\\ell}{v_{x}}. Finally, we can state that the force due to one molecule is\nF = \\frac{dp}{dt} = \\frac{\\Delta (mv)}{\\Delta t} = \\frac{2mv_{x}}{\\frac{2\\ell}{v_{x}}} = \\frac{mv_{x}^{2}}{\\ell}\nNow, let us extend to all molecules.\nF = \\frac{m}{\\ell} (v_{x1}^{2} + v_{x2}^{2} + \\dots + v_{xN}^{2})\nLet \\bar{v} be the average velocity.\n\\bar{v_{x}^{2}} = \\frac{v_{x1}^{2} + v_{x2}^{2} + \\dots + v_{xN}^{2}}{N}\nWe said that the average velocity is in a random direction, so \\bar{v_{x}} = \\bar{v_{y}} = \\bar{v_{z}}. By Pythagoras, we can say that \\bar{v^{2}} = \\bar{v_{x}^{2}} + \\bar{v_{y}^{2}} + \\bar{v_{z}^{2}}. Therefore, \\bar{v^{2}} = 3\\bar{v_{x}^{2}}.\nF = \\frac{m}{\\ell}N\\bar{v_{x}^{2}} = \\frac{m}{\\ell} N \\frac{\\bar{v^{2}}}{3}\nThe pressure on the wall is then P = \\frac{F}{A} = \\frac{1}{3} \\frac{Nm\\bar{v^{2}}}{A\\ell} = \\frac{1}{3} \\frac{Nm\\bar{v^{2}}}{V} \\to PV = \\frac{Nm\\bar{v^{2}}}{3} = \\frac{2}{3} N\\left( \\frac{1}{2} m\\bar{v^{2}}\\right)\nFrom the Ideal Gas Law, we know that PV = NkT, so\n\\frac{2}{3}\\left( \\frac{1}{2} m\\bar{v^{2}}\\right) = kT\nThe kinetic energy is therefore \\frac{3}{2} kT, and thus the average kinetic energy of molecules in an ideal gas is proportional to the absolute temperature of the gas.\nTo determine the average speed of molecules in a gas, use the equation\nv_\\text{root-mean-square} = \\sqrt{\\bar{v^{2}}} = \\sqrt{\\frac{3kT}{m}}\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; 18"},"Concepts/Science/Physics/Fluid-Dynamics/Mean-Free-Path":{"title":"Mean Free Path","links":["Concepts/Science/Physics/Fluid-Dynamics/Fluids","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics"],"content":"Mean Free Path\nTopic: Fluids\nThe mean free path of a gas is the average distance which a molecule travels between collisions. The formula is given by\n\\ell_{m} = \\frac{1}{4 \\pi r^{2} (N/V)}\nwhere r is the molecular radius, N is the number of molecules, and V is the volume of the container.\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 18"},"Concepts/Science/Physics/Fluid-Dynamics/Navier-Stokes-Equations":{"title":"Navier-Stokes Equations","links":["Fluid-Dynamics","Concepts/Math/Differential-Equations/Partial-Differential-Equations","Concepts/Science/Physics/Fluid-Dynamics/Fluids","Concepts/Science/Physics/Newtonian-Mechanics/Velocity","Concepts/Science/Physics/Materials/Density","Concepts/Science/Physics/Fluid-Dynamics/Pressure","Viscosity","Concepts/Science/Physics/Newtonian-Mechanics/Force","Concepts/Math/Calculus/Derivatives/Multivariable/Divergence-Operator","Concepts/Science/Chemistry/Law-of-Conservation-of-Matter","Concepts/Math/Calculus/Derivatives/Multivariable/Partial-Derivatives","Concepts/Math/Calculus/Derivatives/Multivariable/Gradient-Vector","Concepts/Math/Multivariable-Calculus/Laplace-Operator"],"tags":["science/physics/fluids"],"content":"Navier-Stokes Equations\nTopic: Fluid Dynamics\nThe Navier-Stokes Equations are a series of Partial Differential Equations that describe the motion of Fluids.\nThey can be presented in many forms.\nIncompressible, Newtonian Fluids\nLet \\vec{\\textbf{u}} denote Velocity, \\rho denote fluid Density, p denote Pressure, \\mu denote Viscosity, and \\vec{\\textbf{F}} denote any external Force.\nThe Divergence Operator of the velocity is 0 (essentially, Law of Conservation of Matter):\n\\nabla \\cdot \\vec{\\textbf{u}} = 0\nThe acceleration is dependent on internal forces and external forces:\n\\rho \\frac{\\partial \\vec{\\textbf{u}}}{\\partial t} = - \\nabla p + \\mu \\nabla^{2} \\vec{\\textbf{u}} + \\rho \\vec{\\textbf{F}}\n(note the Partial Derivatives, Gradient, and Laplace Operator).\nWe can develop some basic intuition for each of these terms. The gradient term implies that the the fluid will tend to accelerate from a high pressure area to a low pressure one. The viscosity term acts much like friction, but it can also spread out. The third term is the result of external forces like gravity, walls, or other restrictions on the liquid.\n\nReferences"},"Concepts/Science/Physics/Fluid-Dynamics/Pascals-Principle":{"title":"Pascals Principle","links":["Concepts/Science/Physics/Fluid-Dynamics/Fluids","Concepts/Science/Physics/Fluid-Dynamics/Hydraulics","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["flashcards","science/physics"],"content":"Pascals Principle\nTopic: Fluids\nWhat is Pascal’s Principle? :?: The principle that the pressure throughout a fluid is equal.\n\nFormally, Pascal’s Principle might be defined as:\n\nA pressure change at any point in a confined and in-compressible fluid is transmitted throughout the fluid such that the same change occurs everywhere.\n\nThis is the fundamental principle through which Hydraulics work.\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 13"},"Concepts/Science/Physics/Fluid-Dynamics/Pressure":{"title":"Pressure","links":["Concepts/Science/Physics/Fluid-Dynamics/Fluids","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["flashcards","science/physics"],"content":"Pressure\nTopic: Fluids\n\\text{Pressure} = P = \\frac{F}{A}\nMeasured in Pascals: 1 Pa = 1 N / m^2. Also measured in kilopascals kPa, atmospheres 1 atm = 101.3 kPa, and pounds per square inch, 1 atm = 14.7 psi.\nPressure always acts perpendicular to the surface of an object.\nThe pressure force in a fluid is caused by:\n\nThe weight of the column of fluid above\nThe collisions of fluid molecules\n\nWhat is pressure? :?: Force per unit area.\n\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 13"},"Concepts/Science/Physics/Fluid-Dynamics/Saturated-Vapor-Pressure":{"title":"Saturated Vapor Pressure","links":["Concepts/Science/Physics/Fluid-Dynamics/Fluids","Concepts/Science/Physics/Fluid-Dynamics/Vapor","Evaporation","Concepts/Science/Physics/Fluid-Dynamics/Pressure","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics"],"content":"Saturated Vapor Pressure\nTopic: Fluids\nAir normally contains Vapor, and it mainly comes from Evaporation. In a closed container, when the amount of molecules in the vapor is equal to the number of molecules returning to the liquid, the gas is said to be saturated. The Pressure of the vapor when it is saturated is called the saturated vapor pressure.\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 18"},"Concepts/Science/Physics/Fluid-Dynamics/Torricelli's-Theorem":{"title":"Torricelli's Theorem","links":["Fluid-Dynamics","Concepts/Science/Physics/Fluid-Dynamics/Bernoulli's-Equation","Concepts/Science/Physics/Fluid-Dynamics/Bernoulli's-Principle"],"tags":["science/physics/fluids"],"content":"Torricelli’s Theorem\nTopic: Fluid Dynamics\nThe velocity of the fluid coming out of the spout is the same as the velocity of a single droplet of fluid that falls from the height of the surface of the fluid in the container.\nThis is an application of Bernoulli’s Equation - or perhaps better said to be a particular case of Bernoulli’s Principle. The total energy at the source has to be equal to the energy at the spout.\nImagine a barrel of water with a spout and hose connected at the bottom. If you pointed the hose directly upward, the outcoming water would reach just as high as the current level of water in the barrel. This is essentially the logic behind Torricelli’s Theorem.\n\nReferences\n\nFluids in Motion: Crash Course Physics #15\n"},"Concepts/Science/Physics/Fluid-Dynamics/Van-der-Waals-Equation-of-State":{"title":"Van der Waals Equation of State","links":["Concepts/Science/Physics/Fluid-Dynamics/Fluids","Concepts/Science/Physics/Fluid-Dynamics/Ideal-Gas-Law","Concepts/Science/Physics/Fluid-Dynamics/Ideal-Gas","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics"],"content":"Van der Waals Equation of State\nTopic: Fluids\nThe Ideal Gas Law is just that — ideal. It turns out that gases don’t behave exactly like this, especially as your approach high pressures. The Van der Waals Equation of State is a way of accounting for the inaccuracies in reality.\nThe two Ideal Gas assumptions that the Van der Waals equation accounts for are the effects of attractive forces between molecules and the finite volume of the molecules of a gas.\nIf we assume that the molecules of a gas are spherical with radius r and behave like hard spheres, the smallest distance possible is between two is 2r. Thus the actual volume cannot be 0. Let b represent the unavailable volume per mole of gas. Then we have\nP(V - nb) = nRT\nNext, we consider the intermolecular attraction between molecules. The molecules on the edge of the gas, near the wall of a container, are slowed down by these molecular forces and therefore exert less pressure on the wall. This gives us the term \\frac{a}{\\left(\\frac{V}{n}\\right)^{2}}, combining to give us the Van der Waals Equation of State:\n\\boxed{\\left(P + \\frac{a}{\\left(\\frac{V}{n}\\right)}^{2}\\right)\\left(\\frac{V}{n} - b\\right) = RT}\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 18"},"Concepts/Science/Physics/Fluid-Dynamics/Vapor":{"title":"Vapor","links":["Concepts/Science/Physics/Fluid-Dynamics/Fluids","Concepts/Science/Physics/Fluid-Dynamics/Ideal-Gas","Concepts/Science/Physics/Fluid-Dynamics/Critical-Temperature","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics"],"content":"Vapor\nTopic: Fluids\nA vapor is very similar to a gas. However, the difference is that a substance below its Critical Temperature in the gaseous state is called a vapor; above the critical temperature it is called a gas.\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 18"},"Concepts/Science/Physics/Materials/Bulk-Modulus":{"title":"Bulk Modulus","links":["Concepts/Science/Physics/Fluid-Dynamics/Pressure"],"tags":["science/physics"],"content":"Bulk Modulus\nIf an object is subjected to an inward force on all sides, its volume changes according to its material Bulk Modulus, by the equation:\n\\frac{\\Delta V}{V_{0}}=\\frac{-1}{B}\\Delta P\nWhere \\Delta V is the change in volume, V_{0} is the initial volume, B is the bulk modulus, and \\Delta P is the change in Pressure.\n"},"Concepts/Science/Physics/Materials/Center-of-Mass":{"title":"Center of Mass","links":["Concepts/Science/Physics/Newtonian-Mechanics/Momentum/Linear-Momentum","Concepts/Science/Physics/Angular-Motion/Angular-Motion","Concepts/Science/Physics/Newtonian-Mechanics/Mass","Concepts/Math/Calculus/Integrals/Multivariable/Double-Integrals","Concepts/Math/Calculus/Integrals/Multivariable/Triple-Integrals","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics"],"content":"Center of Mass\nTopic: Linear Momentum, Angular Motion\n\nThe weighted average position of the Mass in a system\n\nYou could calculate each dimension of the coordinate independently:\nx_{cm}= \\sum\\limits_{i=1}^{n} \\frac{m_{i}x_{i}}{M} \nwhere M is the total mass = \\sum\\limits_{i=1}^{n}{m_{i}}.\nYou can repeat for y and z.\nPlanar Object\nLet the center of mass of a planar object of density \\delta(x,y) and mass M be (\\bar{x}, \\bar{y}). These coordinates are found by the following double integrals:\n\\bar{x} = \\frac{1}{M} \\iint_{R} x\\delta dA; \\quad \\bar{y} = \\frac{1}{M} \\iint_{R} y\\delta dA;\nVolumetric\n\\bar{x} = \\frac{1}{\\text{Mass}} \\iiint_{R} x \\delta dV (same for y and z). This is a triple integral, techniques for which are discussed there.\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 9"},"Concepts/Science/Physics/Materials/Density":{"title":"Density","links":["Concepts/Science/Physics/Materials/Materials"],"tags":["science/physics"],"content":"Density\nTopic: Materials\nDensity is a measure of how much matter fits into an amount of space. It can be area, volume, or technically even linear. Typically, you will see the form:\n\\text{Density} = \\rho = \\frac{m}{V}\nWhere \\rho is density, m is mass, and V is volume. It has units of \\text{kg/}\\text{m}^{3}.\n"},"Concepts/Science/Physics/Materials/Hookes-Law":{"title":"Hooke's Law","links":["Concepts/Science/Physics/Materials/Materials","Concepts/Science/Physics/Energy/Conservative-Forces","Concepts/Science/Physics/Materials/Spring-Constant","Concepts/Science/Physics/Energy/Elastic-Potential-Energy","Concepts/Science/Physics/Materials/Young's-Modulus"],"tags":["science/physics"],"content":"Hooke’s Law\nTopic: Materials, Conservative Forces\nThe relationship between the force applied to a spring and its resulting elongation is linear. The constant of proportionality k is called the Spring Constant, and the equation that relates these variables is\nF = k\\Delta x\nwhere F is the force, k is the spring constant and \\Delta  x is the change in length.\nNotably, \\Delta x \\propto L, where L is the length of the spring. i.e. double the length, double the stretch.\nTransclude of Elastic-Potential-Energy\nTransclude of Young&#039;s-Modulus"},"Concepts/Science/Physics/Materials/Material-Stress":{"title":"Material Stress","links":["Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics"],"content":"Material Stress\nStress can be considered the ratio of deforming force to the cross sectional area of the solid.\n\\text{Stress} = \\frac{F}{A_{cs}}\nThere are three types of material stress:\n\nTension: Pulling\nCompression: Pushing\nShear: Force parallel to the surface\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 12"},"Concepts/Science/Physics/Materials/Materials":{"title":"Materials","links":[],"tags":["topic","science/physics"],"content":"Materials\nStuff we make things out of!\nSubtopics\ntable without id file.inlinks\nwhere file.name = this.file.name"},"Concepts/Science/Physics/Materials/Spring-Constant":{"title":"Spring Constant","links":["Concepts/Science/Physics/Materials/Young's-Modulus","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics"],"content":"Spring Constant\nThe spring constant is a material constant that dictates how hard it is to pull a spring. It depends on:\n\nThe material’s Young’s Modulus, Y = E\nThe length L\nArea of the cross section perpendicular to the force A_{cs}\n\nThe units of the spring constant is in dimensions of force per unit length, or N/m.\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 12"},"Concepts/Science/Physics/Materials/Strain":{"title":"Strain","links":["Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics"],"content":"Strain\nStrain is the ratio of the change in length of the solid to the original length of the solid. \\text{Strain} = \\frac{\\Delta L} {L_0}\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 12"},"Concepts/Science/Physics/Materials/Thermal-Stresses":{"title":"Thermal Stresses","links":["Concepts/Science/Physics/Thermodynamics/Thermodynamics","Concepts/Science/Physics/Materials/Material-Stress","Concepts/Science/Physics/Thermodynamics/Linear-Expansion","Concepts/Science/Physics/Materials/Young's-Modulus","Concepts/Science/Physics/Thermodynamics/Temperature","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics"],"content":"Thermal Stresses\nTopic: Thermodynamics\nThe Material Stress due to Linear Expansion is given by:\n\\frac{F}{A}  = \\alpha E \\Delta T\nwhere \\alpha is the coefficient of Linear Expansion, E is the Young’s Modulus for the material, and \\Delta T is the change in Temperature.\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 17"},"Concepts/Science/Physics/Materials/Ultimate-Strength":{"title":"Ultimate Strength","links":["Concepts/Science/Physics/Materials/Materials","Concepts/Science/Physics/Materials/Material-Stress","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics"],"content":"Ultimate Strength\nThe ultimate strength of a material is the maximum Material Stress that a specific material can withstand before breaking or fracturing.\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 12"},"Concepts/Science/Physics/Materials/Volume-Expansion":{"title":"Volume Expansion","links":["Concepts/Science/Physics/Materials/Materials","Concepts/Science/Physics/Thermodynamics/Linear-Expansion","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics"],"content":"Volume Expansion\nTopic: Materials\nIn a similar manner to Linear Expansion, a material will generally increase in volume when heated. The formula for this expansion is given by\nV = V_{0}(1 + \\beta) \\Delta T\nwhere \\beta is the coefficient of volume expansion, typically in the range of 3\\alpha, where \\alpha is the coefficient of linear expansion.\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 17"},"Concepts/Science/Physics/Materials/Young's-Modulus":{"title":"Young's Modulus","links":["Concepts/Science/Physics/Materials/Material-Stress","Concepts/Science/Physics/Materials/Strain"],"tags":["science/physics"],"content":"Young’s Modulus\nThe measure of the stiffness of a material is called Young’s Modulus (Y), named after Thomas Young (1773-1829). This modulus is the ratio of stress to strain for a body obeying Hooke’s Law.\nThe equation for Young’s Modulus is:\n\nwhere Y is Young’s Modulus,\nF is the deforming force\nA_{cs} is the cross-sectional area\n\\Delta L is the change in length\nL_0 is the original length of the object"},"Concepts/Science/Physics/Newtonian-Mechanics/Force":{"title":"Force ","links":["School-Notes/Archives/Physics/Newtons-Laws-of-Motion","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics"],"content":"Topic: Newtons Laws of Motion\nForce\nA force is essentially a push or pull.\nBy Newton’s Second Law of Motion, the acceleration of an object is based on its mass and the force being applied.\nF_{net} = ma \\to a = \\frac{F_{net}}{m}\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapters 3-5"},"Concepts/Science/Physics/Newtonian-Mechanics/Friction":{"title":"Friction ","links":["School-Notes/Archives/Physics/Newtons-Laws-of-Motion"],"tags":["science/physics"],"content":"Topic: Newtons Laws of Motion\nFriction\nFriction is a force that counteracts motion. There are three main types of friction.\nStatic Friction\nThe friction that must be overcome to start moving. Also referred to as the force of friction between two objects at rest relative to each other.\nF_{s} \\leq \\mu_{s}\\times F_{n}\nKinetic Friction\nThe force which counteracts an object from moving.\nF_{k}=\\mu_{k}\\times F_{n}\nRolling Friction\nThe friction that occurs from an object not being perfectly round.\nCar Tires\nCar tires are generally thought of as being static friction, because a perfect circle rolling has only one point of contact, which is instantaneously at rest relative to the road.\n\nReferences"},"Concepts/Science/Physics/Newtonian-Mechanics/Inertial-Frames-of-Reference":{"title":"Inertial Frames of Reference  ","links":["Textbooks/Physics/Modern-Physics/Modern-Physics"],"tags":["science/physics/relativity"],"content":"Inertial Frames of Reference\nAn inertial frame of reference is one where the velocity is constant. This means you can be moving, as long as you are not accelerating (that includes changing direction!)\n\n\n                  \n                  The Principle of Galilean Relativity \n                  \n                \n\nNewton’s Laws of Motion apply equally in any inertial frame of reference.\n\n\n\nThere is No Special Frame of Reference\nAll frames of reference are considered equal. It is perfectly valid for a cyclist traveling at a constant 20 mph to say that a passerby, who from their frame of reference isn’t moving, has a velocity of -20 mph.\n\nReferences\nModern Physics; Chapter 1"},"Concepts/Science/Physics/Newtonian-Mechanics/Internal-and-External-Forces":{"title":"Internal and External Forces ","links":["Concepts/Science/Physics/Newtonian-Mechanics/Momentum/Linear-Momentum","Concepts/Science/Physics/Physics-System"],"tags":["science/physics"],"content":"Topic: Linear Momentum\nInternal and External Forces\nWhen one object in a Physics System puts force on another object in a system, it is considered an internal force.\nAn external force is caused by an object outside the system.\n\nReferences"},"Concepts/Science/Physics/Newtonian-Mechanics/Keplers-Laws":{"title":"Keplers Laws ","links":[],"tags":["science/physics","flashcards"],"content":"Keplers Laws\nKepler was a famous 16-17th century mathematician and astronomer, most notable for his discovery of 3 laws which govern the motion of planets.\n1st Law\n\n\n                  \n                  Kepler&#039;s 1st \n                  \n                \n\nThe planets move in elliptical orbits, with the sun as a focus.\n\n\n2nd Law\n\n\n                  \n                  Kepler&#039;s 2nd \n                  \n                \n\nPlanets cover equal area in equal times.\n\n\n\n3rd Law\n\n\n                  \n                  Kepler&#039;s 3rd \n                  \n                \n\nA planet’s orbital period is proportional to the cube of its orbit.\nT^{2} \\propto r^{3}\n\n\n\nReferences"},"Concepts/Science/Physics/Newtonian-Mechanics/Kinematic-Equations":{"title":"Kinematic Equations ","links":["Concepts/Science/Physics/Newtonian-Mechanics/Kinematics"],"tags":["science/physics/mechanics"],"content":"Topic: Kinematics\nKinematic Equations\nConstant Acceleration\nThe following four equations govern basic kinematics with constant acceleration. They can be derived from\nx = x_{0}+v_{0}t+ \\frac{1}{2}at^{2}\nv=v_{0}+at\nv_{\\text{avg}}=\\frac{v+v_{0}}{2}\nv^{2}=v_{0}^{2}+ 2a(x -x_{0})\n\nReferences"},"Concepts/Science/Physics/Newtonian-Mechanics/Kinematics":{"title":"Kinematics","links":[],"tags":["topic"],"content":"Kinematics\nKinematics\nSubtopics\ntable without id file.inlinks\nwhere file.name = this.file.name"},"Concepts/Science/Physics/Newtonian-Mechanics/Mass":{"title":"Mass  ","links":["Concepts/Science/Physics/Newtonian-Mechanics/Weight","School-Notes/Archives/Beaver-Works/Embedded-Security-and-Hardware/Metric-Prefixes-and-SI-Units"],"tags":["science/physics","science"],"content":"Topic:\nMass\nMass is a measure of the amount of matter in an object. It is distinct from Weight.\nThe SI unit for mass is the kilogram.\n\nReferences"},"Concepts/Science/Physics/Newtonian-Mechanics/Momentum/Collisions-in-Two-Dimensions":{"title":"Collisions in Two Dimensions ","links":["Concepts/Science/Physics/Newtonian-Mechanics/Momentum/Linear-Momentum","Concepts/Science/Physics/Newtonian-Mechanics/Momentum/Collisions","vectors"],"tags":["science/physics"],"content":"Topic: Linear Momentum\nCollisions in Two Dimensions\nCollisions in two dimensions are a little tricky because you need to know all four vector components to find the resulting vectors.\nSpecial Case: Elastic Collision of Equal Mass\nSuppose a 2-D elastic collision between equal mass objects, and that object B is at rest. The result of the collision is that the two objects (A + B) will move apart at right angles.\nThis is useful for billiard ball collisions.\n\nReferences"},"Concepts/Science/Physics/Newtonian-Mechanics/Momentum/Collisions":{"title":"Collisions ","links":["Concepts/Science/Physics/Newtonian-Mechanics/Momentum/Linear-Momentum","Concepts/Science/Physics/Physics-System","Concepts/Science/Physics/Newtonian-Mechanics/Momentum/Law-of-Conservation-of-Linear-Momentum","Concepts/Science/Physics/Newtonian-Mechanics/Momentum/Elastic-Collisions","Concepts/Science/Physics/Newtonian-Mechanics/Momentum/Inelastic-Collisions"],"tags":["science/physics"],"content":"Topic: Linear Momentum\nCollisions\nCollisions are interactions between two or more objects in a Physics System. Total momentum is conserved in all collisions. There are two types of collisions, classified as:\nElastic Collisions\nInelastic Collisions\nMany real-life collisions are classified as being kinetic for simplicity sake, but they rarely are truly conservative.\nCollisions in Two Dimensions\n\nReferences"},"Concepts/Science/Physics/Newtonian-Mechanics/Momentum/Elastic-Collisions":{"title":"Elastic Collisions  ","links":["Concepts/Science/Physics/Newtonian-Mechanics/Momentum/Linear-Momentum","Concepts/Science/Physics/Newtonian-Mechanics/Momentum/Collisions","Concepts/Science/Physics/Energy/Kinetic-Energy"],"tags":["science/physics"],"content":"Topic: Linear Momentum\nElastic Collisions\nIn an elastic collision, the total Kinetic Energy remains constant.\nOne Dimensional Elastic Collisions\nThe following equations allow you to determine the final speeds of two objects, a and b in an elastic collision, assuming that b is at rest at the start of the problem. You can manipulate your frame of reference in order to make this true.\nV_{a}&#039; = \\left(\\frac{m_{a}-m_{b}}{m_{a}+m_{b}}\\right) V_{a}\nV_{b}&#039; = \\left(\\frac{2m_{a}}{m_{a}+m_{b}}\\right)V_{a}\nThe speed of approach of the two objects is exactly equal to the speed of the separation of the two objects after the collision:\nV_{b}&#039; - V_{a}&#039; = V_{a}\n***\n\n## References"},"Concepts/Science/Physics/Newtonian-Mechanics/Momentum/Impulse":{"title":"Impulse ","links":["Concepts/Science/Physics/Newtonian-Mechanics/Momentum/Linear-Momentum"],"tags":["science/physics"],"content":"Topic: Linear Momentum\nImpulse\nAn impulse is the change in Linear Momentum.\n\\Delta \\vec{P} = \\vec{F}_{net avg} \\Delta t\nAn impulse has units of \\vec{J} or Newton seconds.\nThe impulse is the same for a large force acting over a short time or a small force acting over a large time.\nIn integral form:\n\\vec{J} = \\int\\limits_{t1 }^{t2}{(\\vec{\\textbf{F}}_{\\text{ net external}})dt}\n\nReferences"},"Concepts/Science/Physics/Newtonian-Mechanics/Momentum/Inelastic-Collisions":{"title":"Inelastic Collisions ","links":["Concepts/Science/Physics/Newtonian-Mechanics/Momentum/Linear-Momentum","Concepts/Science/Physics/Newtonian-Mechanics/Momentum/Collisions","Concepts/Science/Physics/Energy/Kinetic-Energy","Concepts/Science/Physics/Newtonian-Mechanics/Momentum/Perfectly-Inelastic-Collision"],"tags":["science/physics"],"content":"Topic: Linear Momentum\nInelastic Collisions\nA collision in which the total Kinetic Energy does not remain constant. Note the special case of Perfectly Inelastic Collision, where the objects stick together.\n\nReferences"},"Concepts/Science/Physics/Newtonian-Mechanics/Momentum/Law-of-Conservation-of-Linear-Momentum":{"title":"Law of Conservation of Linear Momentum","links":["Concepts/Science/Physics/Newtonian-Mechanics/Momentum/Linear-Momentum","Concepts/Science/Physics/Newtonian-Mechanics/Internal-and-External-Forces","Concepts/Science/Physics/Physics-System"],"tags":["science/physics"],"content":"Law of Conservation of Linear Momentum\nTopic: Linear Momentum\n\n\n                  \n                  Conservation of Linear Momentum \n                  \n                \n\nIf the net external force acting on a system is zero, then the total linear momentum of the system is constant or conserved.\n\n\n"},"Concepts/Science/Physics/Newtonian-Mechanics/Momentum/Linear-Momentum":{"title":"Linear Momentum ","links":["Concepts/Science/Physics/Energy/Kinetic-Energy","Concepts/Science/Physics/Newtonian-Mechanics/Momentum/Law-of-Conservation-of-Linear-Momentum"],"tags":["science/physics"],"content":"Linear Momentum\n\\vec{P} = m\\vec{v}\nNote that momentum has a direction, unlike Kinetic Energy.\nThe rate of change of momentum is equal to the net force:\n\\sum\\limits \\vec{F} =  \\frac{d\\vec{P}}{dt}\nThis feels quite natural as if there is no net force there will be no change in momentum. The idea doesn’t really tell us anything new about single objects, but is instead useful for systems of objects.\nMomentum is often conserved. Law of Conservation of Linear Momentum.\nThe units for momentum are just \\frac{\\text{ kg}\\text{ m}}{\\text{s}}. There isn’t a common name for this.\nSubtopics\ntable without id file.inlinks\nwhere file.name = this.file.name\n\nReferences\nPhysics Chapter 9"},"Concepts/Science/Physics/Newtonian-Mechanics/Momentum/Perfectly-Inelastic-Collision":{"title":"Perfectly Inelastic Collision ","links":["Concepts/Science/Physics/Newtonian-Mechanics/Momentum/Linear-Momentum","Concepts/Science/Physics/Newtonian-Mechanics/Momentum/Collisions","Concepts/Science/Physics/Newtonian-Mechanics/Momentum/Law-of-Conservation-of-Linear-Momentum"],"tags":["science/physics"],"content":"Topic: Linear Momentum\nPerfectly Inelastic Collision\nA collision in which the objects stick together. There is only one final velocity.\nIn order to solve these problems, you use the Law of Conservation of Linear Momentum.\n"},"Concepts/Science/Physics/Newtonian-Mechanics/Newtons-Law-of-Gravity":{"title":"Newton's Law of Gravity  ","links":[],"tags":["science","science/physics"],"content":"Newton’s Law of Gravity\nEvery mass in the universe attracts every other mass in the universe with a force that is directly proportional to the product of the two masses involved and is inversely proportional to the square of the distance separating them.\nF_{g} = G\\frac{m_{1} \\times m_{2}}{r^{2}}\nG equals the gravitational constant \\dfrac{6.67 E^{-11} N * m}{kg^2}, the masses are measured in kilograms, and the distance is measured in meters. \n\nReferences"},"Concepts/Science/Physics/Newtonian-Mechanics/Projectile-Motion":{"title":"Projectile Motion ","links":["Concepts/Science/Physics/Newtonian-Mechanics/Kinematics","Concepts/Science/Physics/Newtonian-Mechanics/Kinematic-Equations","Free-Fall"],"tags":[],"content":"Topic: Kinematics\nProjectile Motion\nProjectile motion is an application of the Kinematic Equations for constant acceleration when the only force of acceleration is gravity. In other words, the projectile object is in Free Fall.\nEquations\n\nReferences"},"Concepts/Science/Physics/Newtonian-Mechanics/Rolling-Motion":{"title":"Rolling Motion  ","links":["Concepts/Science/Physics/Angular-Motion/Angular-Motion","Concepts/Science/Physics/Angular-Motion/Angular-Velocity","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics"],"content":"Topic: Angular Motion\nRolling Motion\nRolling motion occurs when there is translational and angular motion.\nFor it to occur without slipping,\nv_{cm} = R \\omega\nWhere v_{cm} is the velocity of the center of mass, R is the radius of the rolling object, and \\omega is the Angular Velocity.\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 10"},"Concepts/Science/Physics/Newtonian-Mechanics/Velocity":{"title":"Velocity","links":["Concepts/Math/Linear-Algebra/Vectors/Vectors"],"tags":["science/physics"],"content":"Velocity\nVelocity is a vector that denotes how fast and in what direction something is moving.\nMathematically, it is written as \\vec{v} = \\frac{d \\vec{s}}{dt}\nwhere \\vec{s} represents the displacement."},"Concepts/Science/Physics/Newtonian-Mechanics/Weight":{"title":"Weight  ","links":["Concepts/Science/SI-Units"],"tags":["science"],"content":"Weight\nThe weight of an object is defined in two ways:\n\nThe mass of the object times the force of gravity: W = mg\nThe value measured on a scale\n\nThe issue with the second definition is that a scale will read different values if you are accelerating. I suppose that mg might be different too…\nUnit\nIf W = mg, then the SI Units for weight are \\text{ kg} \\times \\text{m/s}^{2}, which is called a Newton (N).\n\nReferences"},"Concepts/Science/Physics/Optics/Index-of-Refraction":{"title":"Index of Refraction","links":[],"tags":["science/physics/optics"],"content":"Index of Refraction\nA medium is a material through which light or some other wave passes.\nDifferent transparent mediums have different optical densities, based on the speed of light in the material. For example, light travels faster in air than in glass.\nEach transparent material is then assigned a value called an index of refraction. The greater the index, the slower that light travels. The symbol for the index of refraction is n, and the equation is:\nn =\\frac{c}{v}\nWhere n represents the index of refaction without a unit,\nc represents the speed of light in a vacuum. This is a constant 3.00 E8 \\frac{m}{s}.\nv represents the speed of light in the specific material. The unit must agree with the unit for c.\nIndex of Refraction for Common Substances\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSubstanceIndex of Refractionair1.00ethyl alcohol1.36water1.33glass1.52ice1.31diamond2.42"},"Concepts/Science/Physics/Optics/Snells-Law":{"title":"Snell's Law","links":[],"tags":["science/physics"],"content":"Snell’s Law\nSnell’s Law allows use to predict the path of light as it travels from one medium to another. Many scientists tried to find a mathematical relationship for this, but the discovery came at the hand of Willebrord Snell, a Duth mathematician.\nThe Snell’s Law Equation\nn_{1} \\sin{\\theta_{1}} = n_{2} \\sin{\\theta_{2}}\nWhere n_{1} is the index of refraction of the first medium, n_{2} is the second, \\theta_{1} is the angle of incidence, in degrees, and \\theta_{2} is the angle of refraction.\nThe following image shows these angles:\n"},"Concepts/Science/Physics/Physics-System":{"title":"Physics System","links":["Concepts/Science/Physics/Newtonian-Mechanics/Momentum/Linear-Momentum"],"tags":["science/physics"],"content":"Physics System\nTopic: Linear Momentum\nA physics system is just a collection of objects.\nClosed System\nA closed system allows energy to flow in and out, but not matter.\nOpen System\nIn an open system, energy and matter can both flow in and out.\nIsolated System\nAn isolated system, generally used as an ideal, is a system in which neither mass nor energy can flow into or out of.\n\nReferences"},"Concepts/Science/Physics/Quantum-Mechanics/Electrons":{"title":"Electrons","links":["Concepts/Science/Chemistry/Atoms","Concepts/Science/Physics/Electricity-and-Magnetism/Elementary-Charge","Concepts/Science/Physics/Quantum-Mechanics/Quantum-Mechanics"],"tags":["science/physics/qm","science/chemistry"],"content":"Electrons\nElectrons are negatively charged subatomic particles that orbit the nuclei of Atoms. A single electron has one negative Elementary Charge, denoted -e.\nElectrons form the basis of electricity, magnetism, and more. Additionally, they are fundamental to the field of Quantum Mechanics.\n"},"Concepts/Science/Physics/Quantum-Mechanics/Photons":{"title":"Photons","links":["Concepts/Science/Physics/Quantum-Mechanics/Electrons","Concepts/Science/Physics/Waves/Waves"],"tags":["science/physics"],"content":"Photons\nPhotons are a fundamental particle, like Electrons. They are bundles, or quanta, of light.\nIn certain experiments, it is observed that light behaves exactly like a wave. Such as Young’s Experiment with the double slits. Light also reflects, just like Waves.\nHowever, certain other experiments with light show that light travels as photons in quanta, containing certain measurable amounts of energy. As a result, the nature of light is now called the wave-particle duality. It is accepted that light will behave as a wave under some conditions, and a particle under others. This a conundrum that is difficult to understand.\nThe energy of a photon is equal to the frequency times Planck’s constant: E = hf"},"Concepts/Science/Physics/Quantum-Mechanics/Planck-Constant":{"title":"Planck's Constant","links":["Concepts/Science/Physics/Quantum-Mechanics/Photons","Concepts/Science/Physics/Waves/Frequency","Concepts/Science/SI-Units"],"tags":["science/physics/qm"],"content":"Planck’s Constant\nPlanck’s constant, denoted by h, is a fundamental physical constant. A photon has energy equal to its Frequency multiplied by h.\nIn SI Units, it has the exact value h = 6.62607015 \\times 10^{-34} \\text{ J}\\cdot \\text{Hz}^{-1}.\n"},"Concepts/Science/Physics/Quantum-Mechanics/Quantum-Mechanics":{"title":"Quantum Mechanics","links":["Concepts/Science/Chemistry/Atoms","Textbooks/Physics/Modern-Physics/Modern-Physics"],"tags":["science/physics/qm"],"content":"Quantum Mechanics\n\n\n                  \n                  Quantum Mechanics \n                  \n                \n\nThe study of the behavior of nature at a scale below the atom.\n\n\n\nReferences\nModern Physics: Chapter 4"},"Concepts/Science/Physics/Quantum-Mechanics/Strong-Interaction":{"title":"Strong Interaction","links":["Concepts/Science/Chemistry/Fundamental-Forces","Concepts/Science/Chemistry/Quarks","Concepts/Science/Chemistry/Protons","Concepts/Science/Chemistry/Neutrons","Concepts/Science/Chemistry/Hadrons","Concepts/Science/Physics/Quantum-Mechanics/Strong-Nuclear-Force"],"tags":["science/physics/qm"],"content":"Strong Interaction\nThe Strong Interaction is a Fundamental Forces that confines Quarks into Protons, Neutrons, and other Hadrons. It also binds hadrons together, where it is called the nuclear force.\n\nReferences"},"Concepts/Science/Physics/Quantum-Mechanics/Strong-Nuclear-Force":{"title":"Strong Nuclear Force","links":["Concepts/Science/Chemistry/Hadrons","Concepts/Science/Chemistry/Protons","Concepts/Science/Chemistry/Neutrons","Nucleus","Concepts/Science/Chemistry/Atoms","Concepts/Science/Physics/Electricity-and-Magnetism/Electrical-Fields","Concepts/Science/Physics/Quantum-Mechanics/Strong-Interaction"],"tags":["science/physics/qm"],"content":"Strong Nuclear Force\nThe strong nuclear force acts between Hadrons, most commonly observed between the Protons and Neutrons in the Nucleus of Atoms. The nuclear force is strong enough to overcome the force caused by the Electrical Fields of like charges when protons are placed near each other, allowing for nuclei to bind together.\nNote that this is NOT the Strong Interaction\n\nReferences"},"Concepts/Science/Physics/Relativity/Einstein-Notation":{"title":"Einstein Notation ","links":["Concepts/Math/Tensor-Calculus/Tensors","Concepts/Math/Tensor-Calculus/Dummy-Index","Concepts/Math/Tensor-Calculus/Free-Index"],"tags":["math","science/physics","math/tensors"],"content":"Topic: Tensors\nEinstein Notation\nIn tensor math, you generalize by summing over a list of indices a lot, for example\n\\sum\\limits_{i=1}^{3} a_{i}x_{i} = a_{1}x_{1} + a_{2}x_{2} + a_{3}x_{3}\nEinstein notation is a shorthand for this:\n\\sum\\limits_{i=1}^{3} a_{i}x_{i} \\to a_{i}x_{i}\nIn this case, i is called a Dummy Index.\nRules\n\nAny twice-repeated index in a single term is summed over.\n\na_{ij}b_{j} = a_{i1}b_{1} + a_{i2}b_{2} + a_{i2}b_{2}\nYou can replace a “dummy index” with anything that is not already in the expression and that is over the same range.\n\n\nA Free Index is not summed over.\nNo index may occur 3 or more times in a given term.\nIn an equation involving Einstein notation, the free indices on both sides must match\n\nx_{i} = a_{ij}b_{j} \\quad \\checkmark\nA_{i} = B_{ij} \\quad \\times\n\n\n\nNon-identities\n\na_{ij}(x_{i} + y_{i}) \\neq a_{ij}x_{i} + a_{ij}y_{j}\nIf you expand it out, the left hand side has highest terms of i = 2 and j = 2, so both i and j are dummy indices. However in the right handside the left term has a free variable j and a dummy variable i, and the right has the inverse. These are inconsistent.\na_{ij}x_{i}y_{j} \\neq a_{ij}x_{j}y_{i}\nWe have dummy indices on both sides, however the coefficients are different when you expand so these aren’t equal.\n\nIdentities\n\na_{ij}(x_{j} + y_{j}) = a_{ij}x_{j} + a_{ij}y_{j}\na_{ij}x_{i}y_{j} = a_{ij}y_{j}x_{i} - commutative multiplication\n(a_{ij} + a_{ji})x_{i}x_{j} = 2a_{ij}x_{i}x_{j}\n\n\nReferences\nEinstein Summation Convention: an Introduction\nEinstein Notation: Proofs, Examples, and Kronecker Delta"},"Concepts/Science/Physics/Relativity/Special-Relativity":{"title":"Special Relativity ","links":["Laws-of-Physics","General-Relativity","Concepts/Science/Physics/Newtonian-Mechanics/Inertial-Frames-of-Reference"],"tags":["science/physics","school"],"content":"Topic: Laws of Physics\nSpecial Relativity\nSpecial relativity is the idea proposed by Einstein to solve the conundrum that the speed of light is constant regardless of your speed. It is the special case of General Relativity where both frames of reference are inertial.\nThe Conundrum\nAs described in Inertial Frames of Reference, there is no special frame of reference, and all laws of motion apply equally. However, we have observed that the speed of light is constant regardless of how you are moving. That is contradictory; if you are moving at the speed of light towards a flashlight, shouldn’t the light particles be traveling towards you at a speed of 2c?\nWell, to solve that discrepancy, Einstein devised the idea of relativity; that time and space distort around an object, becoming more distorted as the object moves at a larger percentage of c.\nA famous example of this is clocks. If you have three stationary clocks at different places, they will all see time in the same manner; after an hour has passed, all should show that an hour has passed. Now, take one of the clocks and let it move at 95% the speed of light. In the time in which the two stationary clocks observe 1 hour, the moving clock will only experience:\n\\Delta t&#039; = \\beta \\Delta t = 1 hr\\times \\sqrt{1 - \\frac{(0.95c)^{2}}{c^{2}}} \\times \\frac{60 \\text{ minutes}}{1hr} = 18.7 \\text{ minutes}\nIf you stopped the moving clock after that 1 hour, you would find that it read a dramatically different value from that of the two that were stationary the entire time.\n\nReferences"},"Concepts/Science/Physics/Scalars":{"title":"Scalars","links":[],"tags":["science/physics","math"],"content":"Scalars\nScalars are quantities that can be described completely by their magnitude or size are called scalar quantities. Common examples are:\n\nDistance\nSpeed\nMass\nTime\nYou can add scalar quantities together if their units are the same.\n"},"Concepts/Science/Physics/Significant-Figures":{"title":"Significant Figures","links":["Measurement"],"tags":["science/physics","flashcards"],"content":"Significant Figures\nTopic: Measurement\nSignificant figures are the amount of numbers that are significant to our final figure. The number of significant figures is determined by the measurement tool.\nThere is some uncertainty in every measurement. Every measurement has a number of known digits + 1 uncertain digit.\nThe number of significant figures is determined by the measurement, not the unit, so when you convert you can never gain accuracy. This is why significant figures have rules for 0s.\nThe result of a calculation has as many significant figures as the number used in the calculation with the fewest sig figs. The exception is addition/subtraction, when you use decimal places.\nIf an answer matches an official answer except for the final digit of the figure, it is normally acceptable. Think about answers with the context of units and significant figures before turning an assignment in.\nRules for Significant Figures\n\nAll non-zero numbers are significant\nZeros between non-zero digits\nTrailing zeroes only when there is a decimal point\nLeading zeros are not significant\n\n\nFlashcards\nHow many significant figures are in 0.01? (…):?:1\n\nHow many significant figures are in 22.95? (…):?:4\n\nHow many significant figures are in 0.301? (…):?:3\n"},"Concepts/Science/Physics/Thermodynamics/Adiabatic-Processes":{"title":"Adiabatic Processes","links":["Concepts/Science/Physics/Thermodynamics/Thermodynamics","Concepts/Science/Physics/Thermodynamics/Thermodynamic-Processes","Concepts/Science/Physics/Thermodynamics/Heat","Concepts/Science/Physics/Thermodynamics/First-Law-of-Thermodynamics","Concepts/Science/Physics/Thermodynamics/Molar-Specific-Heat","temperature","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics"],"content":"Topic: Thermodynamics\nAdiabatic Processes\nIn an adiabatic process, no Heat flow occurs; typically due to very short time periods, or extremely well insulated systems.\nAdiabatic Problem Solving\nQ = 0, so by the First Law of Thermodynamics,\n\\Delta E_{\\text{int}} = -W\nIt can also be derived that, if you let \\gamma = \\frac{C_{p}}{C_{v}} (see Molar Specific Heat),\nPV^{\\gamma} = \\text{constant}\nFor an ideal diatomic gas at or near room temperature, \\gamma is 1.4.\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 19"},"Concepts/Science/Physics/Thermodynamics/Boltzmann-Constant":{"title":"Boltzmann Constant","links":["Concepts/Science/Physics/Thermodynamics/Thermodynamics","Concepts/Science/Physics/Fluid-Dynamics/Ideal-Gas-Law","Concepts/Science/Physics/Thermodynamics/Entropy","Concepts/Science/Physics/Thermodynamics/Thermal-Radiation","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics"],"content":"Topic: Thermodynamics\nBoltzmann Constant\nThe Boltzmann Constant, denoted k_{b}, is an extremely prevalent value in thermodynamics. It is used in the Ideal Gas Law, quantifying Entropy, and Thermal Radiation. It is given the value\nk_{b} = \\frac{R}{N_{A}} = 1.38 \\times 10^{-23}  \\text{ J/K}\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 19; 20"},"Concepts/Science/Physics/Thermodynamics/Calorimetry":{"title":"Calorimetry","links":["Concepts/Science/Physics/Thermodynamics/Thermodynamics","temperature","Concepts/Science/Physics/Thermodynamics/Heat","Concepts/Science/Physics/Thermodynamics/Latent-Heat","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics"],"content":"Topic: Thermodynamics\nCalorimetry\nCalorimetry is the techniques used to solve for the temperature or energy required to change the temperature of a substance. It involves Heat and Latent Heat. A calorimeter attempts to isolate the system, so that no mass or energy flows into or out. Most problems rely on the assumption that the system is isolated, such that\n\\sum\\limits Q =0\n\n\n                  \n                  What is the final temperature of the system?\n                  \n                \n\n200 cubic centimeters of tea at 95 degrees Celsius are poured into a 150 gram cup at 25 degrees Celsius. What will be the common final temperature T of the tea and cup when equilibrium is reached? Assume the system is isolated.\nWe assume that tea is approximately water. 1 cc of water is 1 gram, so we have 200 grams of water at 95 degrees Celsius. The specific heat of water is c_{w}. The specific heat of glass is c_{g} and there are 150 grams.\n\\begin{aligned} \\sum\\limits Q &amp;= 0\\\\ 0 &amp;= m_{w}c_{w}(T-T_{tea}) + m_{c}c_{c}(T-T_{cup})\\\\ 0 &amp;= m_{w}c_{w}T - m_{w}c_{w}T_{tea} + m_{c}c_{c}T - m_{c}c_{c}T_{cup}\\\\ m_{w}c_{w}T + m_{c}c_{c}T &amp;= m_{w}c_{w}T_{tea} + m_{c}c_{c}T_{cup}\\\\ T &amp;= \\frac{m_{w}c_{w}T_{tea} + m_{c}c_{c}T_{cup}}{m_{w}c_{w} + m_{c}c_{c}}\\end{aligned}\nThen you simply substitute.\n\n\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 19"},"Concepts/Science/Physics/Thermodynamics/Carnot-Engine":{"title":"Carnot Engine","links":["Concepts/Science/Physics/Thermodynamics/Thermodynamics","Concepts/Science/Physics/Newtonian-Mechanics/Friction","Concepts/Science/Physics/Thermodynamics/Heat-Engines","temperature","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics"],"content":"Topic: Thermodynamics\nCarnot Engine\nThe Carnot Engine, pioneered by a French general in Napelon’s army, is an idealized reversible engine that would be optimally efficient.\nThe cycle of the engine goes like this:\nflowchart TD\n\nA[Isovolumetric Expansion] --&gt; B[Adiabatic Expansion] --&gt; C[Isothermal Compression] --&gt; D[Adiabatic Compression] --&gt; A\n\nRestrictions\nA Carnot Engine must, by definition, be reversible. That means each leg must be reversible. However, Friction is non-reversible, so a Carnot Engine assumes no friction. Obviously this is an idealized model.\nEfficiency\nIn a Carnot Engine, the efficiency is\n\\frac{Q_{L}}{Q_{H}} = \\frac{T_{L}}{T_{H}} \\to e_\\text{max} = 1 - \\frac{T_{L}}{T_{H}}\nThis can actually be generalized to say that ALL Heat Engines are bounded in efficiency by the temperature high and low of their cycle.\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 20"},"Concepts/Science/Physics/Thermodynamics/Coefficient-of-Performance":{"title":"Coefficient of Performance","links":["Concepts/Science/Physics/Thermodynamics/Thermodynamics","Concepts/Science/Physics/Thermodynamics/Heat-Efficiency","Concepts/Science/Physics/Thermodynamics/Heat-Engines","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics"],"content":"Topic: Thermodynamics\nCoefficient of Performance\nThe coefficient of performance is closely related to the Heat Efficiency of a heat engine. The coefficient of performance instead describes the “efficiency” of a fridge, AC, heat pump, or minisplit. These are essentially heat engines in reverse; you use work (electricity) to extract heat from a colder environment.\nFor a fridge/AC, the coefficient of performance is\nCoP = \\frac{Q_{L}}{W}  = \\frac{Q_{L}}{Q_{H}-Q_{L}}\nand the ideal situation gives\nCoP_\\text{max} = \\frac{T_{L}}{T_{H}-T_{L}}\nFor a heat pump, it is instead\nCoP = \\frac{Q_{H}}{W} = \\frac{Q_{H}}{Q_{H}-Q_{L}}; \\quad CoP_\\text{max} = \\frac{T_{H}}{T_{H}-T_{L}}\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 20’"},"Concepts/Science/Physics/Thermodynamics/Entropy":{"title":"Entropy","links":["Concepts/Science/Physics/Thermodynamics/Thermodynamics","Concepts/Science/Physics/Energy/Joules","Kelvin","Concepts/Science/Physics/Thermodynamics/Temperature","heat","Concepts/Science/Physics/Thermodynamics/Second-Law-of-Thermodynamics","temperature","Concepts/Science/Physics/Thermodynamics/Boltzmann-Constant","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics"],"content":"Topic: Thermodynamics\nEntropy\nEntropy is a measure of disorder. It is a state variable. It is given the symbol S and measured in Joules per Kelvin.\nChanges in Entropy\nWe approximate that, at the same Temperature, a change in entropy is given by\n\\Delta S = \\frac{Q}{T}\nThis gives us the very important fact that when heat flows from hot to cold, as described by the Second Law of Thermodynamics, entropy increases. One way to conceptualize this is that a small change in an already very disorderly situation has less of an effect than a small change in a very orderly system. This change in entropy formula is more accurately stated as\ndS = \\frac{dQ}{T}\nQuantifying Entropy\nIt is far easier to calculate a change in entropy than to give an exact value. However, it is a state variable, so a given state must have some exact amount of entropy. To calculate this, we first consider the idea of macro and microstates. A macrostate is a combination of state variables, including pressure, temperature, volume, and entropy. A microstate is one possible way in which a system of particles and arrange themselves to get a specific macrostate. It turns out that this number is enormous. If you denote the number of microstates as \\Omega, then Boltzmann found that entropy is\nS = k_{b} \\ln{\\Omega}\nwhere k_{b} is the Boltzmann Constant.\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 20"},"Concepts/Science/Physics/Thermodynamics/Equipartition-of-Energy":{"title":"Equipartition of Energy","links":["Concepts/Science/Physics/Thermodynamics/Thermodynamics","Degree-of-Freedom","Concepts/Science/Physics/Fluid-Dynamics/Ideal-Gas","Concepts/Science/Physics/Thermodynamics/Internal-Energy","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics"],"content":"Topic: Thermodynamics\nEquipartition of Energy\nThe theory of the equipartition of energy states that each Degree of Freedom of an Ideal Gas equally contains approximately \\frac{1}{2}kT energy. A monoatomic gas therefore has an Internal Energy of \\frac{3}{2}kT, because it only has translational modes. Now you would assume that diatomic gas might have 6 degrees of freedom, 3 translational and 3 rotational, but one of the rotational axes has such a small moment of inertia that it is ignored. There is also the vibrational modes, but these are only active above roughly 1000 Kelvin. Therefore, a diatomic gas generally has\nE_\\text{int} = \\frac{5}{2}kT = \\frac{5}{2} nRT\nof internal energy. This is the value generally used for air.\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 19"},"Concepts/Science/Physics/Thermodynamics/First-Law-of-Thermodynamics":{"title":"First Law of Thermodynamics","links":["Concepts/Science/Physics/Thermodynamics/Thermodynamics","Concepts/Science/Physics/Physics-System","Concepts/Science/Physics/Thermodynamics/Internal-Energy","Concepts/Science/Physics/Thermodynamics/Heat","Concepts/Science/Physics/Energy/Work","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics"],"content":"Topic: Thermodynamics\nFirst Law of Thermodynamics\nThe first law of thermodynamics states that, for a closed system,\n\\Delta E_{\\text{int}} = Q - W\nwhere E_\\text{int} is the Internal Energy of a system, Q is the Heat flow into the system, and W is the Work done by the system. Note the sign convention.  \n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 19"},"Concepts/Science/Physics/Thermodynamics/Gas-Laws":{"title":"Gas Laws","links":["temperature"],"tags":["science/physics","science/chemistry"],"content":"Gas Laws\nBoyle’s Law\nThere is an inverse relationship between the pressure of a gas and its volume, if the temperature and number of moles are held constant.\nP_{1}V_{1}=P_{2}V_{2}\nCharles’s Law\nThere is a direct relationship between the volume of a gas and its temperature, if the pressure and number of moles are held constant.\n\\frac{V_{1}}{T_{1}}=\\frac{V_{2}}{T_{2}}\nGay-Lussac’s Law\nThere is a direct relationship between the pressure of a gas and its temperature, if the volume and number of moles are held constant.\n\\frac{P_{1}}{T_{1}}=\\frac{P_{2}}{T_{2}}\nAvogadro’s Law\nThere is a direct relationship between the volume of a gas and the number of moles of the gas, if pressure and temperature are held constant.\n\\frac{V_{1}}{n_{1}}=\\frac{V_{2}}{n_{2}}"},"Concepts/Science/Physics/Thermodynamics/Heat-Efficiency":{"title":"Heat Efficiency","links":["Concepts/Science/Physics/Thermodynamics/Thermodynamics","Concepts/Science/Physics/Thermodynamics/Heat-Engines","Concepts/Science/Physics/Energy/Work","Concepts/Science/Physics/Thermodynamics/Heat","heat","Concepts/Science/Physics/Thermodynamics/Coefficient-of-Performance","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics"],"content":"Topic: Thermodynamics\nHeat Efficiency\nIn a Heat Engine, there is a concept called efficiency. It reflects how much Work you get out for a certain amount of Heat input:\n\\text{Efficiency} = e = \\frac{\\text{what you get out}}{\\text{what you put in}} = \\frac{W}{Q_{H}}\nIn a heat engine, W = Q_{H} - Q_{L}, so\ne = \\frac{Q_{H}-Q_{L}}{Q_{H}} = 1 - \\frac{Q_{L}}{Q_{H}}\nThere is a related concept called the Coefficient of Performance for cooling objects like fridges and air conditioners.\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 20"},"Concepts/Science/Physics/Thermodynamics/Heat-Engines":{"title":"Heat Engines","links":["Concepts/Science/Physics/Thermodynamics/Thermodynamics","heat","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics"],"content":"Topic: Thermodynamics\nHeat Engines\nHeat engines are objects which take in heat and produce work.\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 20"},"Concepts/Science/Physics/Thermodynamics/Heat-Flow":{"title":"Heat Flow","links":["Concepts/Science/Physics/Thermodynamics/Thermodynamics","Concepts/Science/Physics/Thermodynamics/Heat","Concepts/Science/Physics/Thermodynamics/Thermal-Conduction","Concepts/Science/Physics/Thermodynamics/Thermal-Radiation","Concepts/Science/Physics/Thermodynamics/Thermal-Convection","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics"],"content":"Topic: Thermodynamics\nHeat Flow\nHeat can flow in three main ways:\nTransclude of Thermal-Conduction#thermal-conduction\nTransclude of Thermal-Radiation#thermal-radiation\nTransclude of Thermal-Convection#thermal-convection\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 19"},"Concepts/Science/Physics/Thermodynamics/Heat":{"title":"Heat ","links":["Concepts/Science/Physics/Thermodynamics/Thermodynamics","temperature","Concepts/Science/Physics/Thermodynamics/Thermal-Equilibrium","Concepts/Science/Physics/Newtonian-Mechanics/Mass","Concepts/Science/Physics/Thermodynamics/Specific-Heat","Concepts/Science/Physics/Thermodynamics/Latent-Heat"],"tags":["science/physics"],"content":"Topic: Thermodynamics\nHeat\nHeat is the amount of thermal energy flowing from one substance to another. It is the energy that transfers from one object to another because of a temperature difference. Matter contains several forms of energy, but it does not contain heat. Instead, heat is energy in transit moving from a body of higher temperature to a body of lower temperature. Once the heat is transferred, the energy is no longer considered to be heat.\nTransclude of Thermal-Equilibrium\nHeat Transfer\nTo calculate the quantity of heat transfer related to a temperature change of a substance, use this equation:\nQ = mc\\Delta T\nWhere Q = the quantity of heat, measured in Joules (J)\nm is the Mass of the substance, measured in Kilograms (kg)\nc is the Specific Heat capacity of the substance, measured in \\frac{J}{kg*C \\degree}\n\\Delta T is the change in temperature of the substance, measured in C \\degree\nTransclude of Latent-Heat\n"},"Concepts/Science/Physics/Thermodynamics/Internal-Energy":{"title":"Internal Energy","links":["Concepts/Science/Physics/Thermodynamics/Thermodynamics","Concepts/Science/Physics/Physics-System","Concepts/Science/Physics/Energy/Energy","Concepts/Science/Physics/Energy/Joules","Concepts/Science/Physics/Thermodynamics/First-Law-of-Thermodynamics","Concepts/Science/Physics/Fluid-Dynamics/Ideal-Gas","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics"],"content":"Topic: Thermodynamics\nInternal Energy\nA Physics System has an inherent amount of Energy, which arises from the molecular motion of matter. The amount is represented by U or E_\\text{int}, and is measured in Joules. The change in internal energy of a closed system is represented in the First Law of Thermodynamics.\nFor an Ideal Gas, the change is calculated as\n\\Delta E_{\\text{int}} = n C_{v} \\Delta T\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 19"},"Concepts/Science/Physics/Thermodynamics/Isobaric-Processes":{"title":"Isobaric Processes","links":["Concepts/Science/Physics/Thermodynamics/Thermodynamics","Concepts/Science/Physics/Thermodynamics/Thermodynamic-Processes","Concepts/Science/Physics/Fluid-Dynamics/Pressure","Concepts/Science/Physics/Newtonian-Mechanics/Mass","Concepts/Science/Physics/Energy/Work","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics"],"content":"Topic: Thermodynamics\nIsobaric Processes\nIso = same, baric = pressure. This is a Thermodynamic Processes in which the Pressure is kept constant. We assume the Mass also stays constant.\nAn isobaric PV diagram\n\nIsobaric Problem Solving\nIn an isobaric process, the Work is\nW = P\\Delta V\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 19"},"Concepts/Science/Physics/Thermodynamics/Isothermal-Processes":{"title":"Isothermal Processes","links":["Concepts/Science/Physics/Thermodynamics/Thermodynamics","Concepts/Science/Physics/Thermodynamics/Temperature","Concepts/Science/Physics/Thermodynamics/Thermodynamic-Processes","temperature","Concepts/Science/Physics/Newtonian-Mechanics/Mass","Concepts/Science/Physics/Thermodynamics/First-Law-of-Thermodynamics","Concepts/Science/Physics/Thermodynamics/Work-In-Volume-Changes","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics"],"content":"Topic: Thermodynamics\nIsothermal Processes\nIso = same, thermal = Temperature. This is a Thermodynamic Processes in which the temperature is kept constant. We assume the Mass also stays constant.\nThe following image shows a pressure-volume diagram for an isothermal process.\n\nIsothermal Problem Solving\nIn an ideal gas, the internal energy only depends on the temperature. Since the temperature remains constant, we know that, by the First Law of Thermodynamics,\nE_\\text{int} = Q - W = 0 \\to \\boxed{Q = W}\nIt can also be found, using the integral in Work In Volume Changes that the work done in isothermically going from volume A to volume B is\nW = nRT \\ln{\\left(\\frac{V_{b}}{V_{a}}\\right)}\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 19"},"Concepts/Science/Physics/Thermodynamics/Isovolumetric-Processes":{"title":"Isovolumetric Processes","links":["Concepts/Science/Physics/Thermodynamics/Thermodynamics","Concepts/Science/Physics/Thermodynamics/Thermodynamic-Processes","Concepts/Science/Physics/Newtonian-Mechanics/Mass","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics"],"content":"Topic: Thermodynamics\nIsovolumetric Processes\nIso = same, volumetric = volume. This is a Thermodynamic Processes in which the volume is kept constant. We assume the Mass also stays constant.\nPV diagram\n\nIsovolumetric Problem Solving\nIf the volume remains constant, than the work done on the system is 0, so\n\\Delta E_{\\text{int}} = Q\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 19"},"Concepts/Science/Physics/Thermodynamics/Latent-Heat":{"title":"Latent Heat","links":["Concepts/Science/Physics/Thermodynamics/Heat","Concepts/Science/Physics/Newtonian-Mechanics/Mass","temperature","Concepts/Science/Chemistry/Phase-Changes","heat"],"tags":["science/physics"],"content":"Latent Heat\nThe latent heat of fusion is defined as the amount of Heat one unit Mass of material, at its melting point, must absorb to change from the solid phase to the liquid phase with no change in temperature. See Phase Changes. The latent heat of vaporization is the same for boiling.\nIf you are trying to calculate the heat transfer related to a phase change, use the equation below:\nQ=m \\cdot H_f||H_v\nwhere Q is the quantity of heat in J, m is the mass in kg, and H_f is the latent heat of fusion or H_v is the latent heat of vaporization"},"Concepts/Science/Physics/Thermodynamics/Laws-of-Thermodynamics":{"title":"Laws of Thermodynamics","links":["heat","temperature","Concepts/Science/Physics/Thermodynamics/First-Law-of-Thermodynamics","Concepts/Science/Physics/Thermodynamics/Second-Law-of-Thermodynamics"],"tags":["science/physics"],"content":"Laws of Thermodynamics\nThe Zeroth Law of Thermodynamics\nThere is no net flow of heat between two systems in thermal contact that have the same temperature.\nThe First Law of Thermodynamics\nIn a closed system, the total amount of heat energy added to a system is equal to the increase in the internal energy of the system plus the work done by the system.\nQ = W + \\Delta U\nwhere Q = the heat added,\nW = the work done,\nU = the internal energy of an object.\nSee First Law of Thermodynamics.\nSample Problem\n\n\n                  \n                  Sample First Law of Thermodynamics Problem \n                  \n                \n\nWhile playing tennis, Joan does 5.5 E7 J of work and gives off 2.3 E7 J of heat. What is the change in Joan’s internal energy?\nQ = -2.3 E7 J; negative because it is given off to the environment\nW = 5.5 E7 J; positive because the work is done on the environment\n\\Delta U = ? = Q - W = (-2.3 E7 J) - (5.5 E7 J) = -7.8 E7 J\n\n\nThe Second Law of Thermodynamics\nHeat itself never flows from a cold object to a hot object. Second Law of Thermodynamics."},"Concepts/Science/Physics/Thermodynamics/Linear-Expansion":{"title":"Linear Expansion","links":["Concepts/Science/Physics/Thermodynamics/Temperature","temperature"],"tags":["science/physics"],"content":"Linear Expansion\nMaterials change in size when they heat up or cool off; they expand or contract. Generally, a material expands when Temperature rises. The amount of expansion per Celsius (or Kelvin) degree is an intrinsic property of a substance. This property is called the coefficient of linear expansion (\\alpha).\nThe equation for calculating how much a substance will increase linearly with a change in temperature is shown below:\n\\Delta L = \\alpha L_{0} \\cdot \\Delta T\nwhere \\Delta L is the change in length, \\alpha is the coefficient of linear expansion, L_0 is the original length, and \\Delta T is the change in temperature.\nAn alternative form is given by\n\\ell = \\ell_{0}(1 + \\alpha \\Delta T)"},"Concepts/Science/Physics/Thermodynamics/Molar-Specific-Heat":{"title":"Molar Specific Heat","links":["Concepts/Science/Physics/Thermodynamics/Thermodynamics","Concepts/Science/Physics/Thermodynamics/Specific-Heat","Concepts/Science/Physics/Fluid-Dynamics/Ideal-Gas","Concepts/Science/Physics/Thermodynamics/Thermodynamic-Processes","Concepts/Science/Physics/Thermodynamics/Temperature","Concepts/Science/Physics/Thermodynamics/Isovolumetric-Processes","temperature","Concepts/Science/Physics/Thermodynamics/Isobaric-Processes","Concepts/Science/Physics/Fluid-Dynamics/Ideal-Gas-Law","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics"],"content":"Topic: Thermodynamics\nMolar Specific Heat\nThe Specific Heat of a Ideal Gas depends on the type of process in which the Temperature is being changed. This is because during an Isovolumetric Processes no work is being done to expand the container, so all heat flow goes into raising the temperature, while in an Isobaric Processes some energy must be spent to do work to expand, so not all energy increases temperature.\nConstant Volume: Q = nC_{v} \\Delta T\nConstant Pressure: Q = nC_{p} \\Delta T\nInterestingly, a result can be found that shows that the relationship between C_{v} and C_{p} is almost exactly the Universal Gas Constant.\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 19"},"Concepts/Science/Physics/Thermodynamics/Second-Law-of-Thermodynamics":{"title":"Second Law of Thermodynamics","links":["Concepts/Science/Physics/Thermodynamics/Thermodynamics","Concepts/Science/Physics/Thermodynamics/Entropy","Concepts/Science/Physics/Thermodynamics/Heat-Engines","Concepts/Science/Physics/Thermodynamics/Heat-Efficiency","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics"],"content":"Topic: Thermodynamics\nSecond Law of Thermodynamics\nThe second law of thermodynamics can be stated in many ways. First, note that Entropy (S) is disorder.\n\nIn any natural process, \\Delta S \\geq 0\nHeat naturally or spontaneously flows from hot to cold\nThere is no such thing as a perfect Heat Engines; you can’t have 100% Heat Efficiency.\n\nWhile these distinct definitions may seem disconnected, they can be all explained to mean the same thing using PV diagrams and a bit of trickery.\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 20"},"Concepts/Science/Physics/Thermodynamics/Specific-Heat":{"title":"Specific Heat","links":["Concepts/Science/Physics/Thermodynamics/Thermodynamics","Concepts/Science/Physics/Energy/Energy","Concepts/Science/Physics/Thermodynamics/Molar-Specific-Heat","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics"],"content":"Topic: Thermodynamics\nSpecific Heat\nThe specific heat of a material specifies how much Energy is required to raise a kilogram of the material by one degree Celsius. Each material has a different value, and these values change ever-so-slightly with temperature.\nTransclude of Molar-Specific-Heat#molar-specific-heat\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 19"},"Concepts/Science/Physics/Thermodynamics/Temperature":{"title":"Temperature","links":["Concepts/Science/Chemistry/Matter","Concepts/Science/Physics/Energy/Kinetic-Energy","Concepts/Science/Chemistry/Molecules","Concepts/Science/Physics/Thermodynamics/Heat","Concepts/Science/Physics/Thermodynamics/Internal-Energy","Concepts/Science/Physics/Thermodynamics/Linear-Expansion","Concepts/Science/Chemistry/Intensive-Properties","Concepts/Science/SI-Units","Kelvin"],"tags":["science"],"content":"Temperature\nThe temperature of a sample of Matter is a measure of the average Kinetic Energy of the Molecules that make up that sample.\nIn everyday speech, Heat and temperature are related, but they are scientifically subtly different. Heat is an amount of Thermal Energy, whereas temperature is a property of a sample.\nNearly all matter expands when its temperature increases, and contracts when its temperature decreases. A common thermometer measures temperature by using a liquid that expands or contracts, like mercury. This phenomenon is called Linear Expansion.\nTemperature is an Intensive Property. It is measured by the SI unit known as the Kelvin."},"Concepts/Science/Physics/Thermodynamics/Thermal-Conduction":{"title":"Thermal Conduction","links":["Concepts/Science/Physics/Thermodynamics/Thermodynamics","Concepts/Science/Physics/Thermodynamics/Heat","Concepts/Science/Physics/Quantum-Mechanics/Electrons","Concepts/Science/Physics/Electricity-and-Magnetism/Electrical-Conductors","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics"],"content":"Topic: Thermodynamics\nThermal Conduction\nTwo materials in contact with one another have a tendency to transfer Heat. On a molecular level, this occurs because the hotter object (or part of an object) has more molecular motion than the cold. When the molecules in the hot air vibrate more quickly, they will collide more often with the cooler ones, transferring energy, which propagates through the medium. Metals are good at this process because of free Electrons, which is also why they are good Electrical Conductors.\nIt is experimentally found that the heat flow Q over a time interval t is given by\n\\frac{Q}{t} = kA \\frac{T_{1}-T_{2}}{\\ell}\nwhere k is a constant of thermal conductivity (in units J/(s * m * K)), A is the cross-sectional area of the material, \\ell is the thickness of the material, and T_{1}, T_{2} are the temperatures.\nYou often see this represented in differential terms, with a temperature gradient:\n\\frac{dQ}{dt} = -kA \\frac{dT}{dx}\nThermal Constant\nMaterials with high thermal conductivity are said to be good conductors. Those with low values are said to be good insulators.\nR-Values\nTypically measured in Imperial units, a materials R-value measures how good of a insulator it is.\nR = \\frac{\\ell}{k}\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 19"},"Concepts/Science/Physics/Thermodynamics/Thermal-Convection":{"title":"Thermal Convection","links":["Concepts/Science/Physics/Thermodynamics/Thermodynamics","Concepts/Science/Physics/Fluid-Dynamics/Fluids","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics"],"content":"Topic: Thermodynamics\nThermal Convection\nConvection is the process whereby heat flows due to the bulk movement of molecules from one location to another inside a Fluids.\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 19"},"Concepts/Science/Physics/Thermodynamics/Thermal-Equilibrium":{"title":"Thermal Equilibrium","links":[],"tags":["science/physics"],"content":"Thermal Equilibrium\nWhen heat spontaneously flows from a warmer substance to a cooler one and the objects reach the same temperature, we say that the objects have reached thermal equilibrium."},"Concepts/Science/Physics/Thermodynamics/Thermal-Radiation":{"title":"Thermal Radiation","links":["Concepts/Science/Physics/Thermodynamics/Thermodynamics","Concepts/Science/Physics/Electricity-and-Magnetism/Electromagnetic-Waves","Concepts/Science/Physics/Thermodynamics/Heat-Flow","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics"],"content":"Topic: Thermodynamics\nThermal Radiation\nObjects are said to radiate heat, which is the result of the emission of Electromagnetic Waves. The rate at which an object radiates heat has been found to be proportional to the fourth power of the Kelvin temperature, T. The rate of Heat Flow is given by the equation\n\\frac{Q}{t} = \\epsilon \\sigma AT^{4}\nwhere \\epsilon = [0, 1] is the emissivity of the material, \\sigma is the Sigmund-Boltzmann Constant, \\sigma = 5.67 \\times 10^{-8} \\text{W/m}^{2} \\cdot \\text{K}^{4}, and A is the surface area of the emitting object.\nObjects with a high emissivity are found to also have a high rate of absorption; that is, a good emitter is a good absorber.  \n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 19"},"Concepts/Science/Physics/Thermodynamics/Thermodynamic-Processes":{"title":"Thermodynamic Processes","links":["Concepts/Science/Physics/Thermodynamics/Thermodynamics","Concepts/Science/Physics/Thermodynamics/Isothermal-Processes","Concepts/Science/Physics/Thermodynamics/Isobaric-Processes","Concepts/Science/Physics/Thermodynamics/Isovolumetric-Processes","Concepts/Science/Physics/Thermodynamics/Adiabatic-Processes","Concepts/Science/Physics/Thermodynamics/Work-In-Volume-Changes","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics"],"content":"Topic: Thermodynamics\nThermodynamic Processes\nThere are four idealized types of thermodynamic processes. They are listed below:\nTransclude of Isothermal-Processes#isothermal-processes\nTransclude of Isobaric-Processes#isobaric-processes\nTransclude of Isovolumetric-Processes#isovolumetric-processes\nTransclude of Adiabatic-Processes\nTransclude of Work-In-Volume-Changes\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 19"},"Concepts/Science/Physics/Thermodynamics/Thermodynamics":{"title":"Thermodynamics ","links":["Concepts/Science/Physics/Thermodynamics/Heat","Concepts/Science/Physics/Energy/Work","Concepts/Science/Physics/Thermodynamics/Temperature","Concepts/Science/Physics/Thermodynamics/First-Law-of-Thermodynamics","Concepts/Science/Physics/Thermodynamics/Second-Law-of-Thermodynamics","Third-Law-of-Thermodynamics","School-Notes/Archives/PHYS-231---Calculus-Based-Physics-II/Chapter-Notes/Calculus-Based-Physics-Chapter-17","School-Notes/Archives/PHYS-231---Calculus-Based-Physics-II/Chapter-Notes/Calculus-Based-Physics-Chapter-18","School-Notes/Archives/PHYS-231---Calculus-Based-Physics-II/Chapter-Notes/Calculus-Based-Physics-Chapter-19","School-Notes/Archives/PHYS-231---Calculus-Based-Physics-II/Chapter-Notes/Calculus-Based-Physics-Chapter-20","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["topic"],"content":"Thermodynamics\nThermodynamics is the branch of physics which handles Heat, Work, and Temperature. It is described by 3 Laws:\nTransclude of First-Law-of-Thermodynamics#first-law-of-thermodynamics\nTransclude of Second-Law-of-Thermodynamics#second-law-of-thermodynamics\nTransclude of Third-Law-of-Thermodynamics\nThere are many other important topics in thermodynamics, linked in subtopics below. For further details, please review Chapters 17, 18, 19, and 20 in Physics for Scientists &amp; Engineers with Modern Physics.\nSubtopics\ntable without id file.inlinks\nwhere file.name = this.file.name"},"Concepts/Science/Physics/Thermodynamics/Ultraviolet-Catastrophe":{"title":"Ultraviolet Catastrophe","links":["Concepts/Science/Physics/Thermodynamics/Thermodynamics","Concepts/Science/Physics/Thermodynamics/Thermal-Radiation","Concepts/Science/Physics/Quantum-Mechanics/Photons","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics"],"content":"Topic: Thermodynamics\nUltraviolet Catastrophe\nIn the study of radiation, classical theory predicted that the energy of radiation caused by vibration could be of any energy. This idea, however, predicted that an ideal emitter would have emit an unbounded amount of energy, which obviously could not be true.\nThe ultraviolet catastrophe caused much upheaval in classical physics, but was ultimately resolved by Planck’s discovery that energy is discrete. Planck stated that radiation could only have values of hf, where f is the frequency and h is the eponymous Planck’s constant, h = 6.64 \\times 10^{-34} \\text{ J/s}.\nWhile Planck discovered this idea, he did not have strong justification for it. It was Albert Einstein who explained the discreteness by proposing what was later named the photon, at least according to my physics professor.\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 19"},"Concepts/Science/Physics/Thermodynamics/Work-In-Volume-Changes":{"title":"Work In Volume Changes","links":["Concepts/Science/Physics/Thermodynamics/Thermodynamics","Concepts/Science/Physics/Fluid-Dynamics/Ideal-Gas","Concepts/Science/Physics/Energy/Work","Concepts/Science/Physics/Energy/Joules","Concepts/Science/Physics/Fluid-Dynamics/Pressure","Concepts/Science/Physics/Thermodynamics/First-Law-of-Thermodynamics","Concepts/Science/Physics/Thermodynamics/Thermodynamic-Processes","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics"],"content":"Topic: Thermodynamics\nWork In Volume Changes\nWhen the volume of an Ideal Gas changes, it must do some amount of Work to expand. This amount is given by\nW = \\int\\limits_{V_{a}}^{V_{b}}{PdV}\nwhere W is the Work in Joules, V_{a} and V_{b} are the starting and ending volumes, and P is the Pressure of the gas. This idea is very important for the First Law of Thermodynamics and the Thermodynamic Processes.\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 19"},"Concepts/Science/Physics/Ticker-Tape-Diagrams":{"title":"Ticker Tape Diagrams","links":[],"tags":["science/physics"],"content":"Ticker Tape Diagrams\nA common way to analyze motion is with ticker tape diagrams. They mark equal time intervals and measures the distance between dots to ascertain the motion of the object.\nThe following list is ticker-tape patterns matched with what it means about the motion of an object:\n\nEqually-spaced dots = Constant speed\nMore spaces between the equally-spaced dots = Faster motion\nSpacing between consecutive dots increasing   =  Accelerating\nSpacing between consecutive dots decreasing  = Decelerating\nA bunch of dots bundled in one location = Rest\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nType of Line on the GraphPosition-Time GraphSpeed-Time GraphA zero horizontal lineThe object is standing still at the point of referenceThe object is at rest.A non-zero horizontal lineThe object is standing still at some location away from the point of referenceThe object is moving at a constant speedAn increasing diagonal lineThe object is moving away from the point of referenceThe object is speeding up.A decreasing diagonal lineThe object is moving closer to the point of reference.The object is slowing down."},"Concepts/Science/Physics/Unit-Fraction":{"title":"Unit Fraction","links":["Measurement"],"tags":["science/physics"],"content":"Unit Fraction\nTopic: Measurement\nIn the context of units and measurements, a unit fraction is a fraction that expresses the relationship between two units. For example, there are 2.54 centimeters in 1 inch, which can be expressed as \\frac{2.54 \\text{ cm}}{1 \\text{ in}}.\n\nFlashcards\nReferences\n\n @todo write unit fractions and common examples [due:: 2023-08-28]\n"},"Concepts/Science/Physics/Waves/De-Broglie-Wavelength":{"title":"De Broglie Wavelength","links":["Concepts/Science/Physics/Waves/Waves","Concepts/Science/Physics/Quantum-Mechanics/Planck-Constant","Concepts/Science/Physics/Newtonian-Mechanics/Momentum/Linear-Momentum"],"tags":["science/physics"],"content":"De Broglie Wavelength\nFrench physicist Louis de Broglie postulated that every particle of matter is endowed with a wave to guide it as it travels. All bodies have a wavelength that is related to the body’s momentum, and given by the equation\n\\lambda = \\frac{h}{p}\nwhere \\lambda is the wavelength, h is the physical constant called Planck’s Constant, and p is the Linear Momentum"},"Concepts/Science/Physics/Waves/Doppler-Equation":{"title":"Doppler Equation","links":[],"tags":["science","science/physics"],"content":"Doppler Equation\nTo an observed frequency when the source of the sound is approaching or receding, we will apply the Doppler Equation: f_{o}=\\left[\\frac{v}{v \\pm v_{s}} \\right]f_{s}\nWhere f_{o} is the observed frequency, v is the speed of sound, v_{s} is the speed of the sound’s source, and f_{s} is the frequency emitted by the source of the sound. A plus sign is used when the source is moving away from the observer, and a minus sign is used when the source is moving toward the observer."},"Concepts/Science/Physics/Waves/Frequency":{"title":"Frequency","links":["Concepts/Science/Physics/Waves/Waves","Concepts/Science/Physics/Angular-Motion/Angular-Frequency"],"tags":["science/physics"],"content":"Frequency\nFrequency, most often measured in hertz (\\text{Hz}), is the number of occurrences of an event per unit of time.\nMost typically, we hear frequency in relation to Waves, where frequency f indicates the number of completed cycles of the wave per second.\nFrequency is related to Angular Frequency by a factor of 2 \\pi.\n"},"Concepts/Science/Physics/Waves/Longitudinal-Waves":{"title":"Longitudinal Waves ","links":["Concepts/Psychology/Sensation-and-Perception/Senses/Hearing/Sound-Waves"],"tags":["science/physics/waves"],"content":"Longitudinal Waves\n\nlongitudinal waves move parallel to the direction of the wave\n\nan example is Sound Waves in air. The molecules push each other forward and then bounce back, creating pockets of expansion (rarefaction) and compression.\n"},"Concepts/Science/Physics/Waves/SHM/Damped-Harmonic-Motion":{"title":"Damped Harmonic Motion ","links":["Concepts/Science/Physics/Waves/SHM/Simple-Harmonic-Motion","Concepts/Math/Differential-Equations/Methods-of-Solution/Solutions-of-Homogeneous-Linear-Equations-with-Constant-Coefficients"],"tags":["science/physics"],"content":"Topic: SHM\nDamped Harmonic Motion\nA damping force is one which impedes the oscillations of Simple Harmonic Motion, such as friction or air drag. The basic equation which describes the forces in such a case is\nma = -F - bv\nMass on a Spring\nma = -kx - bv \\to \\frac{d^{2}x}{dt^{2}} + \\frac{b}{m} \\frac{dx}{dt} + \\frac{k}{m}x = 0\nIt turns out that the solution to this is\nx(t) = Ae^{-\\gamma t}\\cos{(\\omega&#039; t + \\phi)}\nif:\n\\gamma = \\frac{b}{2m} \\quad \\text{and} \\quad \\omega&#039; = \\sqrt{\\frac{k}{m} - \\frac{b^{2}}{4m^{2}}}\nIf \\frac{b^{2}}{4m^{2}} is equal to 4mk, then there are no vibrations and the motion returns to equilibrium in the shortest time possible. This is known as critical damping.\nIf \\frac{b^{2}}{4m^{2}} is instead less than 4mk, the system is under-damped and there will be oscillations.\nIf \\frac{b^{2}}{4m^{2}} is greater than 4mk, the system is over-damped, and there will not be oscillations but it will not return to equilibrium in the fastest time.\nSolution Proof\nWe have the equation m\\frac{d^{2}x}{dt^{2}}  + \\beta \\frac{dx}{dt} + k x = 0 from the above physics. We introduce that \\lambda = \\frac{\\beta}{2m} and \\omega^{2} = \\frac{k}{m}, yielding \\frac{d^{2}x}{dt^{2}} + 2 \\lambda \\frac{dx}{dt} + \\omega^{2} x. By the technique in Solutions of Homogeneous Linear Equations with Constant Coefficients, we have m_{1} = - \\lambda + \\sqrt{\\lambda^{2} - \\omega^{2}}, \\quad m_{2} = -\\lambda - \\sqrt{\\lambda^{2} - \\omega^{2}}\nThe sign of this discriminant gives us the cases above:\n\nif \\lambda^{2} - \\omega^{2} &gt; 0, it is overdamped: x(t) = e^{-\\lambda t}(c_{1} e^{\\sqrt{\\lambda^{2} - \\omega^{2}}t}) + c_{2}e^{- \\sqrt{\\lambda^{2} - \\omega^{2}}t}\n\\lambda^{2} - \\omega^{2} = 0 is critically damped: x(t) = e^{-\\lambda t}(c_{1} + c_{2}t)\n\\lambda^{2} - \\omega^{2} &lt; 0 gives complex roots and it is underdamped: x(t) = e^{-\\lambda t}(c_{1} \\cos{(\\sqrt{\\omega^{2} - \\lambda^{2}}t)} + c_{2} \\sin{(\\sqrt{\\omega^{2} - \\lambda^{2}}t)})\n\nSimple Pendulum with Damping\n\\frac{d^{2}\\theta}{dt^{2}} + \\frac{b}{\\ell} \\frac{d\\theta}{dt} + \\frac{g}{\\ell}\\theta = 0\nSolution:\n\\theta = Ae^{-\\gamma t} \\cos{(\\omega&#039; t + \\phi)}\nwhen\n\\gamma = \\frac{b}{2\\ell} \\quad \\text{and} \\quad \\omega&#039; = \\sqrt{\\frac{g}{\\ell} - \\frac{b^{2}}{4\\ell^{2}}}\n\nReferences"},"Concepts/Science/Physics/Waves/SHM/Mass-On-A-Spring":{"title":"Mass On A Spring ","links":["Concepts/Science/Physics/Waves/SHM/Simple-Harmonic-Motion","Concepts/Science/Physics/Newtonian-Mechanics/Mass","Concepts/Science/Physics/Materials/Spring-Constant","Concepts/Science/Physics/Materials/Hookes-Law","Concepts/Science/Physics/Waves/SHM/Damped-Harmonic-Motion","Concepts/Science/Physics/Newtonian-Mechanics/Newtons-Law-of-Gravity","School-Notes/Archives/Physics/Newtons-Laws-of-Motion","Concepts/Math/Differential-Equations/Methods-of-Solution/Solutions-of-Homogeneous-Linear-Equations-with-Constant-Coefficients","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics"],"content":"Topic: SHM\nMass On A Spring\nA mass on a spring is one of the most quintessential examples of Simple Harmonic Motion, and involves a system with a Mass suspended on the very end of a spring. Hang this vertically and pull down, and the spring will oscillate above and below the equilibrium position in Simple Harmonic Motion. The position, or height, as a function of time, can be described as\ny = A \\cos{(\\omega t + \\phi)}\nwhere A is the amplitude, or the amount you initially pulled it by,\n\\omega is the angular frequency, which must equal \\sqrt{\\frac{k}{m}}, and \\phi is the phase shift; for example if you didn’t release the spring at t=0.\nThis solution can be found by solving (or proved by substitution) the equation \\frac{d^{2}x}{dt^{2}} + \\frac{k}{m}x = 0\nwhich comes from:\nma = \\sum\\limits F \\to m \\frac{d^{2}x}{dt^{2}} = -kx\nwhere k is the Spring Constant and F = -kx comes from Hookes Law.\nDon’t forget about the more complex Damped Harmonic Motion.\nSolving the Differential Equation\nBy Hookes Law we have a force acting opposite to Newtons Law of Gravity. The spring exerts a force of F = -ks where s is the elongation and k is the spring constant. A mass m is affixed to the bottom of the spring, causing it to reach an equilibrium position when mg = ks.\nWhen a initial displacement is given (or an initial velocity), the system starts to vibrate. We denote x(t) as the displacement. The sum of all the forces is equal to ma (see Newtons Laws of Motion): \\sum\\limits F = m a = m \\frac{d^{2}x}{dt^{2}} = mg - k(x + s) = mg -ks - kx = -kx\nRearranging, we have that m \\frac{d^{2}x}{dt^{2}} + kx = 0\nOr, as it is more often written, \\frac{d^{2}x}{dt^{2}} + \\omega^{2} x=0where \\omega = \\sqrt{\\frac{k}{m}}. By the technique outlined in Solutions of Homogeneous Linear Equations with Constant Coefficients, we can find that \\lambda = \\pm i \\omega \\Longrightarrow x(t) = c_{1} \\cos{(\\omega t)} + c_{2} \\sin{(\\omega t)}\nThis is also written as x(t) = A \\sin{( \\omega t + \\phi)}\nwhere A = \\sqrt{c_{1}^{2} + c_{2}^{2}} and \\phi = \\arctan{(\\frac{c_{1}}{c_{2}})}, as determined by the initial conditions. (or a similarly shifted cosine function, x(t) = A \\cos{(\\omega t - \\phi)}).\n\n\n                  \n                  Example: Finding the Equation of Motion \n                  \n                \n\nA force of 400 Newtons stretches a spring 2 meters. A mass of 50 kilograms is attached to the end of the spring, and it is initially released from the equilibrium position with an upward velocity of 10 m/s. Find the equation of motion.\nSolution:\nFirst, we identify the given condition that x&#039;(0) = 10 \\text{ m/s}. The spring constant is F = kx \\to k = \\frac{F}{x} = \\frac{400 \\text{ N}}{2 \\text{ m}} =200 \\text{ N/m}. The equation of motion is \\sum\\limits F = ma = mg - k(x - s) = mg - kx - ks = -kx\nwhich yields ma + kx = 0, where a = \\frac{d^{2}x}{dt^{2}}. If we let \\omega = \\sqrt{\\frac{k}{m}} = 2 \\text{ rad/s}, then we have the differential equation x&#039;&#039; + \\omega^{2} x = 0.\nTo solve this, we let x = e^{\\lambda t}, such that x&#039;&#039; = \\lambda^{2} e^{\\lambda t}. The system then becomes \\lambda^{2} + \\omega^{2} = 0, so \\lambda = \\pm i \\omega. The general solution to the system is then x(t) = c_{1}e^{2i  t} + c_{2}e^{-2i t} = c_{1}&#039; \\cos{(2 t)} + c_{2}&#039; \\sin{(2 t)}\nNow, we apply the condition that x&#039;(0) = -2 c_{1} \\sin{(0)} + 2c_{2} \\cos{(0)} = 2c_{2} = -10 \\to c_{2} = -5. Therefore, the final equation of motion is \\boxed{x(t) = -5 \\sin{(2t)}}\n\n\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 14"},"Concepts/Science/Physics/Waves/SHM/Physical-Pendulum":{"title":"Physical Pendulum ","links":["Concepts/Science/Physics/Waves/SHM/Simple-Harmonic-Motion","Concepts/Science/Physics/Waves/SHM/Simple-Pendulum","Small-Angle-Approximation","Concepts/Math/Differential-Equations/Differential-Equations","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics"],"content":"Topic: Simple Harmonic Motion\nPhysical Pendulum\nA physical pendulum is a pendulum where the mass is distributed, not concentrated at the end as with a ball on string (Simple Pendulum). A physical pendulum experiences torque equal to\n\\tau = -mgh \\sin{(\\theta)} \\approx -mgh\\theta\nwhere m is the mass, g is the acceleration due to gravity, h is the distance along the object from the pivot point to the center of mass, and \\theta is the angle from the vertical. We can use the Small-Angle Approximation to estimate that the torque is linear.\nI\\alpha = \\tau \\to I \\frac{d^{2}\\theta}{dt^{2}} = -mgh\\theta\n\\frac{d^{2}\\theta}{dt^{2}} + \\frac{mgh}{I}\\theta = 0\nThe solution to this Differential Equation is\n\\theta(t) = \\theta_\\text{max} \\cos{(\\omega t + \\phi)}\nwhen \\omega = \\sqrt{\\frac{mgh}{I}}\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 14"},"Concepts/Science/Physics/Waves/SHM/Resonance":{"title":"Resonance ","links":["Concepts/Science/Physics/Waves/SHM/Simple-Harmonic-Motion","Concepts/Science/Physics/Waves/Frequency","Concepts/Science/Physics/Waves/SHM/Simple-Pendulum","Concepts/Science/Physics/Waves/SHM/Mass-On-A-Spring","Concepts/Math/Differential-Equations/Differential-Equations","Concepts/Math/Differential-Equations/Forms/Undetermined-Coefficients-for-Non-Homogeneous-ODEs","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics"],"content":"Topic: SHM\nResonance\nAn object has a natural Frequency, at which it undergoes Simple Harmonic Motion. For a Simple Pendulum, this is \\omega = \\sqrt{\\frac{g}{\\ell}}. For a Mass On A Spring, this is \\omega = \\sqrt{\\frac{k}{m}}. When an additional driving force is applied to an object, it will be most effective when applied at the same frequency as the natural.  This phenomenon is referred to as resonance.\nMass on a Spring\n\\sum\\limits F = ma = -kx -bv + F_{0} \\cos{(\\omega t)}\n\\frac{d^{2}x}{dt^{2}} + \\frac{b}{m} \\frac{dx}{dt} + kx = F_{0} \\cos{(\\omega t)}\nThis is a non-homogenous Differential Equation, which is somewhat difficult to solve, but a solution is:\nx(t) = A_{0} \\sin{(\\omega t + \\phi_{0})}\nwhere A_{0} = \\frac{F_{0}}{m\\sqrt{(\\omega^{2} - \\omega_{0}^{2}) + \\frac{b^{2}\\omega^{2}}{m^{2}}}} \\quad \\text{and} \\quad \\phi_{0} = \\arctan{\\left(\\frac{\\omega_{0}^{2} - \\omega^{2}}{\\omega\\left(\\frac{b}{m}\\right)}\\right)}\nSee Undetermined Coefficients for Non-Homogeneous ODEs for techniques to solve this.\nQ-Value\nThe width or (q)uality of a resonant peak is often specified by its Q-value:\nQ = \\frac{m\\omega_{0}}{b}\n\\text{Width of Resonant Peak} = \\frac{\\text{Mass} \\times \\text{ Natural Frequency}}{\\text{Damping Constant}}\n\nThe given images shows how different Q values can impact the behavior of resonance.\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 14"},"Concepts/Science/Physics/Waves/SHM/Simple-Harmonic-Motion":{"title":"Simple Harmonic Motion","links":["Concepts/Science/Physics/Angular-Motion/Angular-Frequency","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics"],"content":"Simple Harmonic Motion\nSimple harmonic motion relies on two key facts:\n\nMust have some equilibrium position\nIf disturbed, experiences a linear restoring force which acts to return the system to equilibrium\n\nThe most basic equation for simple harmonic motion is\nx(t) = A \\cos{(\\omega t + \\phi)}\nwhere A is the amplitude, \\omega is the Angular Frequency, and \\phi is the angular offset or phase.\nThe maximum acceleration is A\\omega^{2}.\nSubtopics\ntable without id file.inlinks\nwhere file.name = this.file.name\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 14"},"Concepts/Science/Physics/Waves/SHM/Simple-Pendulum":{"title":"Simple Pendulum ","links":["Concepts/Science/Physics/Waves/SHM/Simple-Harmonic-Motion","Concepts/Science/Physics/Waves/SHM/Damped-Harmonic-Motion","Small-Angle-Approximation","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics"],"content":"Topic: SHM\nSimple Pendulum\nA simple pendulum is a system consisting of a rod of length \\ell, at the end of which all mass is concentrated. An example is a very thin string, such that its mass is negligible, with a very dense metal ball at the end.\nIf disturbed, the pendulum will try to come to rest, but endlessly cycle back and forth in Simple Harmonic Motion. Without damping, the equation describing the position is:\nx(t) = A \\cos{(\\omega t + \\phi)}\nwhen \\omega = \\sqrt{\\frac{g}{\\ell}}. This implies that the period of the pendulum does not rely on the mass. The solution also relies on the Small-Angle Approximation.\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 14"},"Concepts/Science/Physics/Waves/Transverse-Waves":{"title":"Transverse Waves ","links":[],"tags":["science/physics"],"content":"Transverse Waves\n\nparticles move perpendicular to the wave’s direction\n\n"},"Concepts/Science/Physics/Waves/Wave-Intensity":{"title":"Wave Intensity ","links":["Concepts/Science/Physics/Waves/Waves","Concepts/Science/Physics/Energy/Power","Concepts/Science/Physics/Energy/Energy"],"tags":["science/physics"],"content":"Topic:  Waves\nWave Intensity\nThe intensity of a wave is defined as the average Power transported across a unit area perpendicular to the direction of Energy flow:\nI = \\frac{\\overline{P}}{\\overline{S}} = 2\\pi^{2}v\\rho f^{2}A^{2}\nin units of watts per square meter (\\text{W/m}^{2}).\nDerivation\nThe intensity of a wave comes from its energy as seen below:\nE = \\frac{1}{2}kA^{2}\nf = \\frac{1}{2\\pi} \\sqrt{\\frac{k}{m}} \\to k = 4\\pi^{2}f^{2}m\nE = 2 \\pi^{2} f^{2} m A^{2}\nFor a simple wave traveling in an elastic medium, it travels a distance of \\ell = \\lambda f t = vt in time t. The volume of this chunk is V = S \\times \\ell where S is the cross-sectional area, so m = \\rho V = \\rho S v t and\nE = 2\\pi^{2}f^{2}\\rho S v t A^{2}\nThe average rate of energy, or power of the wave, is:\n\\overline{P} = \\frac{E}{t} = 2\\pi^{2} f^{2} \\rho S v A^{2}\nI = \\frac{\\overline{P}}{\\overline{S}} = 2\\pi^{2}f^{2}\\rho v A^2\n\nReferences"},"Concepts/Science/Physics/Waves/Waves":{"title":"Waves ","links":["Concepts/Science/Physics/Quantum-Mechanics/Photons","Concepts/Psychology/Sensation-and-Perception/Senses/Hearing/Sound-Waves","Electromagnetic-Radiation","Concepts/Science/Physics/Waves/Transverse-Waves","Concepts/Science/Physics/Waves/Longitudinal-Waves","Concepts/Science/Physics/Angular-Motion/Angular-Frequency","Textbooks/Physics/Physics-for-Scientists-and-Engineers/Physics-for-Scientists--and--Engineers-with-Modern-Physics"],"tags":["science/physics"],"content":"Waves\nWaves are disturbances that move, carrying energy but not matter. They come in many, many forms, including light waves, ocean waves, Sound Waves, and Electromagnetic Radiation.\nThere are two primary categories of waves, although there is overlap within them:\n\nTransverse Waves\nLongitudinal Waves\n\nWhen graphed, a wave alternates between high points, called crests, and low points, called troughs in a rhythmic pattern. The most basic graphs of this form are \\sin{(x)} and \\cos{(x)}, which both have a crest of 1 and trough of -1.\nProperties\nThe most basic properties of waves are:\n\nAmplitude: typically denoted as A, a measure of how far the wave goes from equilibrium to reach either crest or trough.\nPeriod: denoted T, the time it takes for the wave to complete one full cycle\nFrequency: denoted f or F, the number of cycles which a wave completes in one second; inversely related to period\nAngular Frequency: denoted \\omega, the amount of times it completes a cycle of 2 \\pi radians in a second; \\omega = 2\\pi f\nWavelength: typically denoted \\lambda, the distance between two successive points, e.g. crest to crest\nVelocity: v = \\lambda f\n\n\nReferences\nPhysics for Scientists &amp; Engineers with Modern Physics; Chapter 15"},"KiCad":{"title":"KiCad","links":["Printed-Circuit-Boards"],"tags":["keyboards","pcb"],"content":"KiCad\nKiCad is an open-source suite for designing Printed Circuit Boards."},"Printed-Circuit-Boards":{"title":"Printed Circuit Boards","links":["Concepts/Science/Physics/Electricity-and-Magnetism/Circuits/Circuit","Concepts/Science/Physics/Electricity-and-Magnetism/Electrical-Conductors","Soldering"],"tags":["pcb"],"content":"Printed Circuit Boards\nA printed circuit board, or PCB, is a object that allows us to physically wire together, or route, the components of a Circuit. Typically, it consists of a plastic outer layer that sandwiches a copper conductive layer. The copper has traces that run from component to component and electrically connects them. Then, electrical components are fixed to conductive pads on the outer layers by Soldering."},"Research/Ergonomic-Mechanical-Keyboards/Ergonomic-Keyboards":{"title":"Ergonomic Keyboards","links":["Blog-Posts/Keyboards/ErgoTravel","Blog-Posts/Keyboards/Dactyl-Manuform-R-Track","Blog-Posts/Keyboards/Icarus","Blog-Posts/Keyboards/Silvis","Blog-Posts/Keyboards/Tantalus"],"tags":["keyboards"],"content":"Ergonomic Keyboards\nAn ergonomic keyboard is a tool for inputting symbols to a computer in a way that doesn’t compromise on the user’s comfort. Typical features that might make a keyboard more ergonomic that the traditional counterpart are a split design, ortholinear or columnar staggered keys, or non-traditional angles.\nI’ve spent a lot of time studying, building, using ergonomic keyboards. A tiny subset of my journey in this realm is documented in posts like\n\nErgoTravel\nDactyl Manuform R-Track\nIcarus\nSilvis\nTantalus\n"},"Soldering":{"title":"Soldering","links":["Printed-Circuit-Boards"],"tags":["pcb"],"content":"Soldering\nSoldering is the process of connecting a component to a PCB by melting solder between the surfaces.\nTraditionally, soldering is done using a soldering iron - essentially a very hot stick of metal that you gently touch to heat the circuit board, solder, and component together.\nIn more sophisticated designs, you may see solder paste, hot air guns, and reflow ovens used. By cutting out the manual element of the soldering iron, these techniques allow for much smaller packages on the components. Additionally, solder paste and reflow ovens scale much better for large scale assembly."},"index":{"title":"Hello, World!","links":[],"tags":[],"content":"Hello, World!\nHey there! I am Eben Quenneville, a Physics student at the University of New Hampshire. This is a publicly accessible sub-section of my personal notes network built using Obsidian. I published it using Quartz, an awesome static website generator for Markdown notes.\nThis website is meant to be an easy place for me to publish anything I’ve been thinking about and think others might be too.\nIn the future, I plan to upload useful notes about classes I’ve taken and projects I’ve done. This will be for my own reference and anyone else stumbling through."}}